[
  {
    "name": "Arcanist Spellcasting Increase",
    "identity": "Arcanist",
    "requirements": "Requires Spellbook, Spellcasting",
    "description": "Your spellcasting level increases by 1. You learn new spells for your spellbook as detailed in your spellbook feature. You can take this perk multiple times, and each time you do so your spellcasting level increases by 1. You may not take this perk if it would cause your spellcasting level to be higher than your character level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Signature Spell",
    "identity": "Arcanist",
    "requirements": "Requires Spellcasting Level 7",
    "description": "Choose a 1st level and 2nd level spell that you know. These spells are always prepared for you, and you can cast them at their lowest levels as if they were cantrips.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Signature Spell",
    "identity": "Arcanist",
    "requirements": "Requires Signature Spell, Level 9",
    "description": "Choose a 3rd level spell that you know. This spell is always prepared for you, and you can cast it at its lowest levels without expending a spell charge or spell points a number of times equal to your Spellcasting Modifier.\n\nAll expended uses of this ability recharge at the end of a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Improved Mage Armor",
    "identity": "Arcanist, Spellblade",
    "requirements": "Spellcasting",
    "description": "You can cast the spell Mage Armor as a cantrip, no longer requiring the expenditure of a spell charge or spell points. Additionally, when you cast the spell this way, it grants a defense bonus of +4 with no dexterity cap, and an Armor value of 2.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Tactician",
    "identity": "Arcanist, Spellblade",
    "requirements": "Requires Intelligence 14",
    "description": "You can give yourself a bonus to your initiative rolls equal to your Intelligence Modifier",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Abjurationist - Arcane Ward",
    "identity": "Arcanist",
    "requirements": "Requires Arcane Spellcasting",
    "description": "You have an arcane ward that protects you from harm. This ward has a number of hit points equal to your level + your Intelligence Modifier, which are refilled whenever you finish a Rest. Whenever you are hit by an attack or other damaging effect, your ward absorbs the damage instead. If this damage reduces the ward to 0 hit points, you take any remaining damage.\n\nThe ward does not share in any of your damage resistances.\n\nWhenever you cast a spell of 1st level or higher, the ward regains a number of hit points equal to the level of the spell.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Abjurationist - Shield Refresh",
    "identity": "Arcanist",
    "requirements": "Requires Novice Abjurationist - Arcane Ward, Level 5",
    "description": "Whenever you cast a spell, your ward gains additional hit points equal to _ your Intelligence Modifier (rounded up).",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Abjurationist - Spell Dampening",
    "identity": "Arcanist",
    "requirements": "Requires Advanced Abjurationist - Shield Refresh, Level 7",
    "description": "You have resistance to all damage from spells.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Conjurer - Conjurer's Step",
    "identity": "Arcanist",
    "requirements": "Requires Spellcasting",
    "description": "You can use an action to teleport yourself up to 30 feet to a location you can see. Alternatively, you can use two actions to target a willing ally within 30 feet and both teleport, magically swapping your positions. \n\nYou can use this feature a number of times equal to your Intelligence Modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Conjurer - Stable Summons",
    "identity": "Arcanist",
    "requirements": "Requires Novice Conjurer - Conjurer's Step, Level 5",
    "description": "Your summons spells no longer require concentration to maintain.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Conjurer- Active Summons",
    "identity": "Arcanist",
    "requirements": "Requires Advanced Conjurer - Stable Summons, Level 7",
    "description": "Your summons gain an extra action on each of their turns.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Diviner - Portens",
    "identity": "Arcanist",
    "requirements": "Requires Spellcasting",
    "description": "When you finish a Rest, roll two d20s and record the numbers rolled. You can replace any attack roll, saving throw, or ability check made by you or a creature that you can see with one of these foretelling rolls. You must choose to do so before the roll, and you can replace a roll in this way only once per turn. Each foretelling roll can be used only once. When you finish a Rest, you lose any unused foretelling rolls.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Diviner - 3rd Eye",
    "identity": "Arcanist",
    "requirements": "Requires Novice Diviner - Portens, Level 5",
    "description": "You can use your action to increase your powers of perception. When you do so, choose one of the following benefits, which lasts until you are incapacitated or you take a Rest. You can't use the feature again until you finish a Rest.\n\n- Darkvision. You gain magical darkvision out to a range of 60 feet.\n\n- Greater Comprehension. You can read any language.\n\n- See Invisibility. You can see invisible creatures and objects within 10 feet of you that are within line of sight.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Diviner - Advanced Portens",
    "identity": "Arcanist",
    "requirements": "Requires Advanced Diviner - 3rd Eye, Level 7",
    "description": "You roll three d20s for your Portens feature, rather than two.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Enchanter - Hypnotic Gaze",
    "identity": "Arcanist",
    "requirements": "Requires Arcane Spellcasting",
    "description": "You can use two actions to force one target within 15 feet of you to make a Will saving throw or become Enthralled until the end of your next turn. A creature Enthralled with this effect has their speed reduced to 0, is incapacitated, and is visibly dazed and disoriented.\n\nOn each of your subsequent turns, you can use an action to extend the effect another turn. This effect lasts until you choose not to extend it, if you leave the 15 foot range of the ability, if the creature can no longer see or hear you, or if the creature takes damage.\n\nOnce the effect ends, or if the creature succeeds on the saving throw, they are immune to this effect for 24 hours, and you can't use this ability again until after your next Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Enchanter - Deflecting Charm",
    "identity": "Arcanist",
    "requirements": "Requires Novice Enchanter - Hypnotic Gaze, Level 5",
    "description": "When a creature you can see within 30 feet makes an attack roll against you, you can use your reaction to force them to make a Will saving throw against your ability DC. On a failed save, the creature must target the creature closest to it (not including you or itself).\n\nOn a successful save, the attacker is immune to this effect for 24 hours.\n\nYou must choose to use this effect before knowing the results of the creature's attack roll.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Enchanter - Alter Memories",
    "identity": "Arcanist",
    "requirements": "Requires Advanced Enchanter - Deflecting Charm, Level 7",
    "description": "Whenever you use a spell or ability that Charms or Enthralls a creature, you can alter the creature's memories so it remains unaware of being charmed. Additionally, you can attempt to erase the target's memories of the time they were under your spell. The creature must succeed a Will saving throw against your Ability DC or lose a number of hours up to your Charisma Modifier (your choice) though the amount of time forgotten cannot exceed the length of time it was under your spell.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Evoker - Protective Casting",
    "identity": "Arcanist",
    "requirements": "Requires Spellcasting",
    "description": "When you cast a spell that targets an area, you can protect some of your allies inside the spells area of effect. Choose a number of allies up to your Intelligence Modifier (minimum 1), these allies automatically succeed on their saving throws against your spell.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Evoker - Potent Cantrips",
    "identity": "Arcanist",
    "requirements": "Requires Novice Evoker - Protective Casting, Level 5",
    "description": "If you cast a cantrip that forces a target to make a saving throw, the target takes half damage on a successful saving throw rather than none. If your cantrip causes creatures to suffer additional effects, they still do not do so on a successful save.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Evoker - Overchannel",
    "identity": "Arcanist",
    "requirements": "Requires Advanced Evoker - Potent Cantrips, Level 7",
    "description": "When you cast a spell of 5th level or lower that has a damage roll, you can overchannel the spell's power, causing it to do the maximum possible damage (you do not need to roll damage for it). The first time per day you do this, you suffer no ill effects. \n\nEach time after the first, you suffer 2d12 Dark damage per level of the spell. Each additional time you cast a spell after the second, the Dark damage increases by 1d12 per level of the spell.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Illusionist - Improved Illusions",
    "identity": "Arcanist",
    "requirements": "Requires Spellcasting",
    "description": "If you don't already know it, you learn the cantrip Minor Illusion. Whenever you cast this cantrip, you can create both sound and an image as part of the same casting and maintain both using the same concentration.\n\nAdditionally, you can use an action to manipulate any illusion spell you cast to change its sound or image (within the spell's normal parameters for the illusion), though you must be able to see the illusion to do so.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Illusionist - Illusory Copy",
    "identity": "Arcanist",
    "requirements": "Requires Novice Illusionist - Improved Illusions, Level 5",
    "description": "You can create an illusory duplicate of yourself as an instant, almost instinctual reaction to danger. When a creature makes an attack roll against you, you can use your reaction to interpose the illusory duplicate between the attacker and yourself. The attack automatically misses you, then the illusion dissipates.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Illusionist - Tangible Illusions",
    "identity": "Arcanist",
    "requirements": "Requires Advanced Illusionist - Illusory Copy, Level 7",
    "description": "Whenever you cast an illusion spell of 1st level or higher, you can choose one aspect of the illusion and make it real. Maintaining this object's realness requires its own concentration and Sustain a Spell action, but can otherwise the effect lasts as long as the spell does.\n\nThis illusion made real cannot deal damage or otherwise directly cause harm to anyone.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Necromancer - Grim Harvest",
    "identity": "Arcanist",
    "requirements": "Requires Spellcasting",
    "description": "When you kill an enemy with a spell of 1st level or higher, you regain hit points equal to 2 * the spells level + your spellcasting modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Necromancer - Master of Thralls",
    "identity": "Arcanist",
    "requirements": "Requires Novice Necromancer - Grim Harvest, Level 5",
    "description": "You learn the Summon Undead spell and always have it prepared if you must prepare your spells. When you cast Summon Undead, you summon an additional thrall as part of casting the spell. Additionally, each thrall you summon with the Summon Undead spell gains a number of hit points equal to your Level + your Intelligence Modifier.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Necromancer - Command Undead",
    "identity": "Arcanist",
    "requirements": "Requires Advanced Necromancer - Master of Thralls, Level 7",
    "description": "You gain resistance to Dark damage, and can attempt to gain control of any undead you encounter.\n\nUsing two actions, you can force each Undead creature you can see within 30 feet to make a Will saving throw against your ability DC. If it succeeds, it is immune to this effect. If it fails, you gain control over it as if it was one of your thralls for 24 hours.\n\nIntelligent undead are harder to control. If a targeted creature has an Intelligence of 8 or higher, they have advantage on the saving throw. If they have an intelligence of 12 or higher, they can repeat the saving throw every hour until it succeeds and breaks free.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Transmuter - Transmuter's Stone",
    "identity": "Arcanist",
    "requirements": "Requires Spellcasting",
    "description": "You can spend 8 hours creating a transmuter's stone that stores transmutation magic. You can benefit from the stone yourself or give it to another creature. A creature gains a benefit of your choice as long as the stone is in the creature's possession. When you create the stone, choose the benefit from the following options:\n\n- Darkvision out to a range of 60 feet\n\n- An increase to their climbing, swimming, or walking speed of 10 feet while the creature is unencumbered. If the creature does not have a climbing or walking speed, they gain the relevant speed.\n\n- Advantage on Fortitude saving throws\n\n- Resistance to acid, cold, fire, lightning, or thunder damage (your choice whenever you choose this benefit)\n\nEach time you Rest, you can change the effect of your stone if the stone is on your person.\n\nIf you create a new transmuter's stone, the previous one ceases to function.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Transmuter - Shapechanger",
    "identity": "Arcanist",
    "requirements": "Requires Novice Transmuter - Transmuter's Stone, Level 5",
    "description": "You learn the Polymorph spell , or add it to your spellbook if it is not there already. You can cast Polymorph without expending a spell slot. When you do so, you can target only yourself.\n\nOnce you cast Polymorph in this way, you can't do so again until you finish a Rest, though you can still cast it normally using an available spell slot.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Transmuter - Invoked Transmutation",
    "identity": "Arcanist",
    "requirements": "Requires Advanced Transmuter - Shapechanger, Level 7",
    "description": "You can use an action to consume the reserve of transmutation magic stored within your transmuter's stone in a single burst. When you do so, choose one of the following effects. Your transmuter's stone is destroyed and can't be remade until you finish a Rest.\n\n- Major Transformation. You can transmute one non-magical object - no larger than a 5-foot cube - into another non-magical object of similar size and mass and of equal or lesser value. You must spend 10 minutes handling the object to transform it.\n\n- Panacea. You remove all curses, diseases, and poisons affecting a creature that you touch with the transmuter's stone. The creature also regains all its hit points and has all of its wounds removed.\n\n- Restore Life. You cast the Raise Dead spell on a creature you touch with the transmuter's stone, without expending a spell slot or needing to have the spell in your spellbook.\n\n- Restore Youth. You touch the transmuter's stone to a willing creature, and that creature's apparent age is reduced by 3d10 years, to a minimum of 13 years. This effect doesn't extend the creature's lifespan.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Occult Spellcasting Increase",
    "identity": "Bard",
    "requirements": "Requires Occult Spellcasting",
    "description": "Your spellcasting level increases by 1. You learn new spells as detailed in your Occult Casting feature. You can take this perk multiple times, and each time you do so your spellcasting level increases by 1. You may not take this perk if it would cause your spellcasting level to be higher than your character level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Jack of All Trades",
    "identity": "Bard, Scoundrel",
    "requirements": "Requires Intelligence 14",
    "description": "You can add _ your level (rounded up) to any skill check that you do not have at least Apprentice Proficiency in.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Countercharm",
    "identity": "Bard",
    "requirements": "Requires Trained in Performance",
    "description": "As two actions, you can start a performance that empowers your allies resolve against mental attacks. Until the start of your next turn, all allies (including yourself) within 30 feet can add your Performance Skill Proficiency to the result of their Will saving throws.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Master of Disguise",
    "identity": "Bard",
    "requirements": "Requires Charisma 12",
    "description": "You can cast the spell Disguise Self a number of times per day equal to your Charisma modifier. This action does not count as casting a spell for you. \n\nAt 3rd level, you can cast the spell Alter Self as part of the same action and in the same way, creating even more elaborate disguises and illusions.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Cutting Words",
    "identity": "Bard",
    "requirements": "Requires Bardic Inspiration",
    "description": "When an enemy creature you can see makes a d20 roll, you can spend your reaction to roll one of your Bardic Inspiration dice and subtract the result from your enemies roll.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice College of Valor - Martial Inspiration",
    "identity": "Bard",
    "requirements": "Requires Bardic Inspiration, Level 2",
    "description": "Allies who have one of your Bardic Inspiration die can use it in the additional following ways: They can use it to increase the result of a single damage roll from a weapon attack, or they can use it to increase their Defense against a single attack from an enemy.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert College of Valor - Cast and Slash",
    "identity": "Bard",
    "requirements": "Requires Spellcasting, Level 5",
    "description": "Whenever you cast a spell or cantrip using two or more actions, you can make a single weapon attack as part of that action.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice College of Whispers - Mind Blade",
    "identity": "Bard",
    "requirements": "Requires Bardic Inspiration",
    "description": "Once per round, when you hit an enemy with a weapon attack, you can expend a use of your Bardic Inspiration to do additional Psychic damage to your target. This damage is a number of d6s equal to _ your level (rounded up).",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced College of Whispers - Mantle of Shadow",
    "identity": "Bard",
    "requirements": "Requires Novice College of Whispers - Mantle of Shadow, Level 5",
    "description": "When a humanoid dies within 30 feet of you that you can see, you can magically capture their shadow as a reaction. You retain this shadow until you use it or until you Rest. \n\nAs an action, you can consume the shadow to transform it into a disguise that appears on you. This disguise lasts for 1 hour, and while it lasts you appear to be the dead person, only alive and well. While appearing as this person, you have access to their surface level memories (no information deeper than what they would share with a casual acquaintance). Such information includes their general background and personal life, but does not include secrets or anything they would have attempted to conceal in life. \n\nThis information is enough for you to pass yourself off as the person by drawing on their memories. Another creature can see through this disguise by succeeding on an Insight check contested by your Deception check. You have advantage on this contest roll. \n\nOnce you capture a shadow with this feature, you cannot do so again until after a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert College of Whispers - Shadow Secrets",
    "identity": "Bard",
    "requirements": "Requires Advanced College of Whispers - Shadow Secrets, Level 7",
    "description": "As two actions, you can send a psychic whisper into the ear of a target you can see within 30 feet. The target must make a Will save against your Ability DC. If automatically succeeds the saving throw if it does not share a language with you. On a successful saving throw, the whisper sounds like an unintelligible mumble and has no effect.\n\nOn a failed saving throw, the target is Charmed by you for the next 8 hours, or until you or one of your allies takes hostile action towards it. It interprets these whispers as you knowing its most mortifying secret.\n\nWhile you gain no knowledge of what this secret is, the target is convinced that you know it. While Charmed this way, the target obeys your commands for fear that you will reveal its secret.\n\nIt won't risk its life for you or fight for you unless otherwise inclined to do so. It grants you gifts and favors it would give a close friend. \n\nWhen the effect ends, the creature has no understanding of why it held you in such fear. \n\nYou can only use this ability once per day.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice College of Glamour - Captivate",
    "identity": "Bard",
    "requirements": "Requires Bardic Inspiration",
    "description": "You can begin an enthralling performance, captivating your audience with your skills and seductive fey magic. If you perform for at least one minute, you can expend a use of your Bardic Inspiration to target a number of humanoids (up to your Charisma modifier) within 30 feet and force them to make a Will saving throw against your Ability DC. If a target succeeds this saving throw, they suffer no effect, but are otherwise unaware that you tried to Charm them.\n\nIf a target fails this saving throw, they are Charmed by you for one hour and idolize you: it speaks glowingly of you to anyone who will listen, it hinders anyone who opposes you (though it will avoid violence unless otherwise inclined), and seeks to gain your favor.\n\nThis effect ends early if you take any hostile action towards it, or if it witnesses you taking hostile action towards one of its allies.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced College of Glamour - Mantle of Majesty",
    "identity": "Bard",
    "requirements": "Requires Novice College of Glamour - Captivate, Level 5",
    "description": "Using two actions, you can assume a Mantle of Fey Majesty, cloaking yourself in illusions of Glamour and taking on an appearance of unearthly beauty for 1 minute. While in this state you can cast the spell Command without consuming any spell charges. Any creatures Charmed by you automatically fail the saving throw against your Command.\n\nYou can use this ability only once per day.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert College of Glamour - Deflecting Presence",
    "identity": "Bard",
    "requirements": "Requires Advanced College of Glamour - Mantle of Majesty, Level 7",
    "description": "Using two actions, you can assume a powerful fey presence for 1 minute or until you are incapacitated (whichever comes first). While in this state, any enemy who targets you with an attack must make a Will saving throw against your Ability DC. On a successful save, it has disadvantage on any spells you cast against it until the end of your next turn. On a failed save, it must choose a new target for its attack or lose the attack.\n\nYou can use this ability once per Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Brutal Critical",
    "identity": "Barbarian",
    "requirements": "Requires Strength 14",
    "description": "Whenever you make a damage roll for a critical hit with a melee weapon, you can increase the number of damage die rolled by 1.\n\nEach time you take this feature, the number of extra dice you can roll increases by 1 (to a maximum of 3). You cannot take this feature a second time before level 4, or a 3rd time before level 7.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Danger Sense",
    "identity": "Barbarian",
    "requirements": "Requires Wisdom 14",
    "description": "You gain advantage on all Reflex saves against effects you can see, such as spells, traps, or other avoidable effects.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Feral Instincts",
    "identity": "Barbarian",
    "requirements": "Requires Rage",
    "description": "You have advantage on initiative rolls, and can use your rage ability as a reaction if an enemy is the one who initiated combat.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Reckless Attacks",
    "identity": "Barbarian",
    "requirements": "",
    "description": "You can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Refuse Death",
    "identity": "Barbarian",
    "requirements": "Requires Level 5",
    "description": "When you are reduced to 0 hit points, you can make a DC 15 Fortitude saving throw to remain at 1 hit point instead. Each time you succeed at this saving throw, the DC increases by 5 and you gain a wound.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Resourceful",
    "identity": "Barbarian, Warden",
    "requirements": "Requires Wisdom 14",
    "description": "Choose two skills from the following: Athletics, Medicine, Nature, Perception, Society, Stealth, or Survival. You gain two skill increases to each of those skills.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Titan Mauler",
    "identity": "Barbarian",
    "requirements": "Requires Strength 18",
    "description": "You can wield a two-handed weapon in one hand. You can't wield two weapons in this way.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Berserker - Furious Flurry",
    "identity": "Barbarian",
    "requirements": "Requires Rage",
    "description": "While you are raging, your attacks do not suffer the multi-attack penalty.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Berserker - Mindless Rage",
    "identity": "Barbarian",
    "requirements": "Requires Novice Berserker - Furious Flurry, Level 3",
    "description": "While raging, you become a mindless vessel of violence. You have advantage on all will saving throws and are immune to being charmed or frightened while under the effects of your rage.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Berserker - Strike Back",
    "identity": "Barbarian",
    "requirements": "Requires Advanced Berserker - Mindless Rage, Level 7",
    "description": "Whenever a creature in your reach deals damage to you, you can use your reaction to make a melee weapon attack against that creature.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Immolator - Fire Storm",
    "identity": "Barbarian",
    "requirements": "Requires Rage",
    "description": "While you are raging, you have resistance to fire damage and exude an aura of fire. This aura extends out 10 feet from you in all directions. Each creature inside your aura (including yourself) takes Fire damage equal to your Constitution modifier at the beginning of each of their turns.\n\nAdditionally, the additional rage damage you add to each of your attacks becomes Fire damage instead of your weapon's type.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Immolator - Controlled Burn",
    "identity": "Barbarian",
    "requirements": "Requires Novice Immolator - Fire Storm, Level 3",
    "description": "You gain further control over your aura, and its radius extends to 15 feet. Additionally, you can partially protect your allies from the intense heat, granting them resistance to Fire damage (both from your aura and outside sources) while they are inside its radius.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Immolator - Wrath of the Inferno",
    "identity": "Barbarian",
    "requirements": "Requires Advanced Immolator - Controlled Burn, Level 7",
    "description": "You have mastered the element of fire, and its radius extends to 20 feet total. You gain the ability to channel its power against your foes directly: As a single action, you can force an enemy inside the aura to take the full power of your fury. This enemy must make a Reflex saving throw against your Ability DC or take 3d8 Fire damage. This damage increases to 4d8 at level 10. You can only use this action once per round.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Storm Caller - Bring the Storm",
    "identity": "Barbarian",
    "requirements": "Requires Rage",
    "description": "Whenever you enter your rage, you summon a small storm to surround you on the battlefield. Once on each of your turns as an action, you can evoke the storm to force one enemy within 10 feet of you to make a Reflex saving throw. On a failed save your target takes 2d6 Lightning damage, or half as much on a successful save. This damage increases to 3d6 at 4th level and 4d6 at 8th level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Storm Caller - Storm's Answer",
    "identity": "Barbarian",
    "requirements": "Requires Novice Storm Caller - Bring the Storm, Level 3",
    "description": "While you are raging, the storm punishes those who would stand against you. Whenever you are damaged by an enemy within 30 feet of you, you can use your reaction to force that enemy to make a Reflex saving throw. On a failed save your target takes 2d8 Lightning damage, or half as much on a successful save. This damage increases to 3d8 at 5th level and 4d8 at 9th level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Storm Caller - Lightning Call",
    "identity": "Barbarian",
    "requirements": "Requires Advanced Storm Caller - Storm's Answer, Level 7",
    "description": "You master the storm around you, and can summon its full might to destroy your enemies. Whenever you enter a rage, you create a bolt of lightning that arcs toward a target of your choice that you can see within 60 feet. Three bolts then leap from that target to as many as three other targets, each of which must be within 30 feet of the first target. A target can be a creature or an object and can be targeted by only one of the bolts. A target must make a Dexterity saving throw. The target takes 10d8 lightning damage on a failed save, or half as much damage on a successful one.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Warlord - Empowering Presence",
    "identity": "Barbarian",
    "requirements": "Requires Rage",
    "description": "Your presence inspires your allies and emboldens them forward. While you are raging, the aura of your presence extends in a 15 foot radius around you. You and each of your allies within the aura gain a number of temporary hit points equal to your Charisma modifier at the start of their turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Warlord - Force of Will",
    "identity": "Barbarian",
    "requirements": "Requires Novice Warlord - Empowering Presence, Level 3",
    "description": "The force of your presence carries through into your attacks. You can add your charisma modifier to the damage rolls of any melee weapon attacks you make.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Warlord - Fear and Awe",
    "identity": "Barbarian",
    "requirements": "Requires Advanced Warlord - Force of Will, Level 7",
    "description": "You are a master of the battlefield, and your presence weakens the resolve of your enemies. The radius of your presence aura increases to 20 feet. Whenever an enemy enters the aura, or begins their turn inside it, they must succeed at a Will saving throw or subtract your Charisma modifier from any attacks or saving throws they make while inside the aura until the beginning of their next turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Champion Spellcasting Increase",
    "identity": "Champion",
    "requirements": "Requires Champion Spellcasting",
    "description": "Your spellcasting level increases by 1. You can take this perk multiple times, and each time you do so your spellcasting level increases by 1. You may not take this perk if it would cause your spellcasting level to be higher than your character level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Aura of Courage and Devotion",
    "identity": "Champion",
    "requirements": "Requires Charisma 14",
    "description": "You, and all allies within 10 feet of you have advantage against being Frightened, Fear effects, as well as against being Charmed while you are conscious. This aura extends to 30 feet at 10th level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Aura of Glory",
    "identity": "Champion",
    "requirements": "Requires Charisma 14",
    "description": "When you or an ally within 10 feet of you score a critical hit or kill an enemy, they gain your Charisma modifier in temporary hit points. This aura extends to 30 feet at 10th level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Aura of Protection",
    "identity": "Champion",
    "requirements": "Requires Charisma 14, Level 5",
    "description": "You, and all allies within 10 feet of you, may add your Charisma Modifier to the result of their saving throws while you are conscious. This aura extends to 30 feet at 10th level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Aura of Sacrifice",
    "identity": "Champion",
    "requirements": "Requires Charisma 14",
    "description": "When an ally within 10 feet of you is damaged, you can magically redirect half that damage to yourself. This ability's range extends to 30 feet at 10th level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Aura of Warding",
    "identity": "Champion",
    "requirements": "Requires Charisma 14, Level 5",
    "description": "You, and all allies within 10 feet of you, may subtract your Charisma Modifier from any damage they would take from a spell. This aura extends to 30 feet at 10th level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Purification",
    "identity": "Champion, Priest",
    "requirements": "Requires Charisma 16",
    "description": "You can spend two actions to end a single spell currently affecting a target you can touch. You can use this ability a number of times equal to your Charisma modifier each day.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Retributive Strike",
    "identity": "Champion",
    "requirements": "",
    "description": "When one of your allies is damaged by an enemy and their attacker is within melee range of you, you can spend your reaction to make a single melee attack against that enemy.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Oath of the Sentinel Spells",
    "identity": "Champion",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Oath Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Ensnaring Strike, Speak with Animals",
    "2ndLevelSpells": "Moonbeam, Misty Step",
    "3rdLevelSpells": "Plant Growth, Protection from Energy",
    "4thLevelSpells": "Grasping Vine, Guardian of Nature",
    "5thLevelSpells": "Commune with Nature, Wrath of Nature"
  },
  {
    "name": "Novice Oath of the Sentinel - Nature's Wrath",
    "identity": "Champion",
    "requirements": "Requires Trained in Nature",
    "description": "Using two actions, you can cause spectral vines to spring up and reach for a creature within 20 feet of you that you can see. The creature must succeed on a Fortitude or Reflex saving throw (its choice) or be restrained. While restrained by the vines, the creature repeats the saving throw at the end of each of its turns. On a success, it frees itself and the vines vanish.\n\nYou can use this ability once per day.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Oath of the Sentinel - Undying Sentinel",
    "identity": "Champion",
    "requirements": "Requires Novice Oath of the Sentinel - Nature's Wrath, Level 5",
    "description": "When you are reduced to 0 hit points and are not killed outright, you can choose to drop to 1 hit point instead. Once you use this ability, you can't use it again until you finish a Rest.\n\nAdditionally, you suffer none of the drawbacks of old age, and you can't be aged magically.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Oath of the Sentinel - Elder Champion",
    "identity": "Champion",
    "requirements": "Requires Advanced Oath of the Sentinel - Undying Sentinel, Level 10",
    "description": "Using two actions, you undergo a transformation assuming the form of an ancient force of nature. For 1 minute, you gain the following benefits:\n\n- At the start of each of your turns, you regain 10 hit points.\n\n- Whenever you cast a spell that has a casting time of 2 or 3 actions, you can reduce its casting time by 1 action.\n\n- Enemy creatures within 10 feet of you have disadvantage on saving throws against your spells and Nature's Wrath.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Oath of the Conqueror Spells",
    "identity": "Champion",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Oath Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Command, Frost Armor",
    "2ndLevelSpells": "Hold Person, Spiritual Weapon",
    "3rdLevelSpells": "Crusader's Mantle, Fear",
    "4thLevelSpells": "Dominate Beast, Stoneskin",
    "5thLevelSpells": "Destructive Wave, Holy Weapon"
  },
  {
    "name": "Novice Oath of the Conqueror - Strike Fear",
    "identity": "Champion",
    "requirements": "Requires Charisma 14",
    "description": "Using two actions, you force each creature of your choice that you can see within 30 feet of you to make a Will saving throw. On a failed save, a creature becomes frightened of you for 1 minute. The frightened creature can repeat this saving throw at the end of each of its turns, ending the effect on itself on a success.\n\nYou can use this ability once per day.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Oath of the Conqueror - Scornful Rebuke",
    "identity": "Champion",
    "requirements": "Requires Novice Oath of the Conqueror - Strike Fear, Level 5",
    "description": "Whenever a creature hits you with an attack, that creature takes Psychic damage equal to your Charisma modifier (minimum of 1) if you're not incapacitated.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Oath of the Conqueror - Invincible Conqueror",
    "identity": "Champion",
    "requirements": "Requires Advanced Oath of the Conqueror - Scornful Rebuke, Level 10",
    "description": "Using two actions, you harness extraordinary martial prowess. For 1 minute, you gain the following benefits:\n\n- You have resistance to all damage.\n\n- Whenever you spend an action to make an attack, you can make a second attack as part of that action using the same multi-attack penalty.\n\n- Your critical threshold is decreased by 1.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Oath of the Protector Spells",
    "identity": "Champion",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Oath Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Command, Compelled Duel",
    "2ndLevelSpells": "Warding Bond, Zone of Truth",
    "3rdLevelSpells": "Aura of Vitality, Spirit Guardians",
    "4thLevelSpells": "Aura of Life, Guardian of Faith",
    "5thLevelSpells": "Circle of Power, Geas"
  },
  {
    "name": "Novice Oath of the Protector - Champion's Challenge",
    "identity": "Champion",
    "requirements": "Requires Charisma 14",
    "description": "As an action, you issue a challenge that compels other creatures to do battle with you. Each creature of your choice that you can see within 30 feet of you must make a Will saving throw. On a failed save, a creature can't willingly move more than 30 feet away from you. This effect ends on the creature if you are incapacitated or die or if you move more than 30 feet away from the creature.\n\nYou can use this ability once per day.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Oath of the Protector - Unbreakable Protector",
    "identity": "Champion",
    "requirements": "Requires Novice Oath of the Protector - Champion's Challenge, Level 5",
    "description": "You have advantage on saving throws to avoid becoming paralyzed or stunned",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Oath of the Protector - Champion of the People",
    "identity": "Champion",
    "requirements": "Requires Advanced Oath of the Protector - Unbreakable Protector, Level 10",
    "description": "Using an action, you inspire those around you. For 1 minute, you gain the following benefits:\n\n- You gain resistance to bludgeoning, slashing, and piercing damage\n\n- Your allies within 30 feet have advantage on death saving throws, and do not suffer wounds when they are stabilized or healed.\n\n- You and all allies within 30 feet have advantage on Will saving throws.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Oath of the Devoted Spells",
    "identity": "Champion",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Oath Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Protection from the Unnatural, Sanctuary",
    "2ndLevelSpells": "Lesser Restoration, Zone of Truth",
    "3rdLevelSpells": "Beacon of Hope, Dispel Magic",
    "4thLevelSpells": "Freedom of Movement, Guardian of Faith",
    "5thLevelSpells": "Commune, Holy Weapon"
  },
  {
    "name": "Novice Oath of the Devoted - Holy Blade",
    "identity": "Champion",
    "requirements": "Requires Charisma 14",
    "description": "Your weapon is infused with the might of your belief. Your weapon becomes a Flaming Weapon: As a free action, you may command it to ignite. It will become engulfed in flames, dealing an extra damage die of Fire damage and emitting bright light for 10 feet, and dim light for an additional 10 feet. The number of extra fire damage dice increases by 1 at 5th and 9th level. Additionally, you can add your Charisma modifier to attack rolls with this weapon.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Oath of the Devoted - Blessed and Bound",
    "identity": "Champion",
    "requirements": "Requires Novice Oath of the Devotion - Holy Blade, Level 5",
    "description": "You are always under the effects of a Protection from the Unnatural spell.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Oath of the Devoted - Holy Radiance",
    "identity": "Champion",
    "requirements": "Requires Advanced Oath of the Devotion - Blessed and Bound, Level 10",
    "description": "Using two actions, you emulate an aura of sunlight. For 1 minute, emit bright light in a 30 foot radius, and dim light an additional 30 feet beyond that.\n\n- Whenever an enemy creature starts its turn in the bright light, they take 10 Light damage.\n\n- Whenever an allied creature starts their turn in the bright light, they are healed for your Charisma Modifier in hit points.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Oath of the Hero Spells",
    "identity": "Champion",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Oath Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Expeditious Retreat, Guiding Bolt",
    "2ndLevelSpells": "Aid, Enthrall",
    "3rdLevelSpells": "Haste, Protection from Energy",
    "4thLevelSpells": "Compulsion, Find Greater Steed",
    "5thLevelSpells": "Conjure Volley, Skill Empowerment"
  },
  {
    "name": "Novice Oath of the Hero - Heroic Fury",
    "identity": "Champion",
    "requirements": "Requires Charisma 14",
    "description": "Using an action, you empower your strikes with Heroic Fury. For 1 minute, your critical threshold is decreased by 1.\n\nYou can use this ability once per day.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Oath of the Hero - Glorious Defense",
    "identity": "Champion",
    "requirements": "Requires Novice Oath of the Hero - Heroic Fury, Level 5",
    "description": "When a creature you can see hits you with an attack roll, you can use your reaction to gain a bonus to Defense against that attack, potentially causing it to miss you.\n\nThe bonus equals your Charisma modifier (minimum of +1). If the attack misses, you can make one weapon attack against the attacker as part of this reaction.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Oath of the Hero - Living Myth",
    "identity": "Champion",
    "requirements": "Requires Advanced Oath of the Hero - Glorious Defense, Level 10",
    "description": "Using an action, you embody the legends told about yourself both true and exaggerated. For 1 minute, you gain the following benefits:\n\n- You have advantage on all Charisma based Skill Checks.\n\n- Once on each of your turns when you miss with a melee weapon attack, you can choose to hit instead\n\n- If you fail a saving throw, you can spend your reaction to choose to succeed instead.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Oath of the Avenger Spells",
    "identity": "Champion",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Oath Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Bane, Guiding Bolt",
    "2ndLevelSpells": "Hold Person, Misty Step",
    "3rdLevelSpells": "Haste, Protection from Energy",
    "4thLevelSpells": "Banishment, Greater Invisibility",
    "5thLevelSpells": "Hold Monster, Flame Strike"
  },
  {
    "name": "Novice Oath of the Avenger - Force of Enmity",
    "identity": "Champion",
    "requirements": "Requires Charisma 14",
    "description": "Using an action, you can utter a vow of enmity against a creature you can see within 10 feet of you. You gain advantage on attack rolls against the creature for 1 minute or until it drops to 0 hit points or falls unconscious.\n\nYou can use this ability once per day.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Oath of the Avenger - Provoking Vow",
    "identity": "Champion",
    "requirements": "Requires Novice Oath of the Avenger - Force of Enmity, Level 5",
    "description": "When a creature under the effect of your Vow of Enmity makes an attack, you can use your reaction to make a melee weapon attack against that creature if it is within reach.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Oath of the Avenger - Avenging Angel",
    "identity": "Champion",
    "requirements": "Requires Advanced Oath of the Avenger - Provoking Vow, Level 10",
    "description": "Using two actions, you take the form of an avenging angel. For 1 minute, you gain the following benefits:\n\n- You manifest glowing wings from your back and gain a flying speed of 60 feet.\n\n- You emanate an aura of menace in a 30-foot radius. The first time any enemy creature enters the aura or starts its turn there during a battle, the creature must succeed on a Will saving throw or become frightened of you for 1 minute or until it takes any damage. Attack rolls against the frightened creature have advantage.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Bloodline Spellcasting Increase",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline Spellcasting",
    "description": "Your spellcasting level increases by 1. You learn new spells as detailed in your Bloodline Spellcasting feature. You can take this perk multiple times, and each time you do so your spellcasting level increases by 1. You may not take this perk if it would cause your spellcasting level to be higher than your character level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Bend Luck",
    "identity": "Inheritor",
    "requirements": "Requires Spell Points",
    "description": "When another creature you can see makes an attack roll, an ability check, or a saving throw, you can use your reaction and spend 2 Spell Points to roll 1d4 and apply the number rolled as a bonus or penalty (your choice) to the creature's roll. You can do so after the creature rolls but before any effects of the roll occur.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Metamagic",
    "identity": "Inheritor",
    "requirements": "Requires Spellcasting",
    "description": "You learn 2 additional metamagic abilitis from the Metamagics list. You can take this ability any number of times. Each time you take this feature your maximum Spell Points is increased by 4. If you do not already have a pool of Spell Points, you gain a pool of 4 Spell Points that can only be used for metamagics or other non-spell identity features. This pool refills at the end of each Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Bottomless Wellspring",
    "identity": "Inheritor",
    "requirements": "Requires Spell Points, Level 5",
    "description": "When you start a combat encounter and do not have any spell points remaining, you regain your level + your Casting modifier in spell points",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Divine Bloodline Spells",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline - Divine, Spellcasting",
    "description": "At each of the spellcasting levels listed on the Bloodline Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are of the same type as your bloodline.",
    "1stLevelSpells": "Bless, Command",
    "2ndLevelSpells": "Augury, Calm Emotions",
    "3rdLevelSpells": "Beacon of Hope, Mass Healing Word",
    "4thLevelSpells": "Aura of Purity, Divination",
    "5thLevelSpells": "Hallow, Mass Cure Wounds"
  },
  {
    "name": "Novice Divine Bloodline - Blessed Influence",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline - Divine, Spell Points",
    "description": "Up to once per turn, whenever you or an ally within 5 feet of you rolls dice to determine the number of hit points a spell restores, you can spend 1 spell point to reroll any number of those dice once, provided you aren't incapacitated.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Divine Bloodline - Angelic Flight",
    "identity": "Inheritor",
    "requirements": "Requires Novice Divine Bloodline - Blessed Influence, Level 6",
    "description": "You can use a single action to manifest a pair of spectral wings from your back. While the wings are present, you have a flying speed of 30 feet. The wings last until you're incapacitated, you die, or you dismiss them as an action. You can choose the wings appearance.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Divine Bloodline - Divine Rebirth",
    "identity": "Inheritor",
    "requirements": "Requires Advanced Divine Bloodline - Angelic Flight, Level 9",
    "description": "As an action when you have fewer than half of your hit points remaining, you can regain a number of hit points equal to half your hit point maximum.\n\nYou can use this ability once per day",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Draconic Bloodline Spells",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline - Draconic, Spellcasting",
    "description": "At each of the spellcasting levels listed on the Bloodline Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are of the same type as your bloodline.",
    "1stLevelSpells": "Chromatic Orb, Thunderwave",
    "2ndLevelSpells": "Dragon's Breath, Shatter",
    "3rdLevelSpells": "Fear, Thunder Step",
    "4thLevelSpells": "Fire Shield, Polymorph",
    "5thLevelSpells": "Hold Monster, Legend Lore"
  },
  {
    "name": "Novice Draconic Bloodline - Ancestral Influence",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline - Draconic",
    "description": "When you cast a spell that deals damage of the type associated with your draconic ancestry, add your Charisma modifier to that damage. At the same time, you can spend 1 sorcery point to gain resistance to that damage type for 1 hour.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Draconic Bloodline - Draconic Flight",
    "identity": "Inheritor",
    "requirements": "Requires Novice Draconic Bloodline - Ancestral Influence, Level 6",
    "description": "You gain the ability to sprout a pair of dragon wings from your back, gaining a flying speed equal to your current walking speed. You can create these wings as an action on your turn. They last until you dismiss them as an action.\n\nYou can't manifest your wings while wearing armor unless the armor is made to accommodate them, and clothing not made to accommodate your wings might be destroyed when you manifest them.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Draconic Bloodline - Behold the Dragon",
    "identity": "Inheritor",
    "requirements": "Requires Advanced Draconic Bloodline - Draconic Flight, Level 9",
    "description": "As an action, you can spend 5 spell points to draw on the draconic power in your blood and exude an aura of awe or fear (your choice) to a distance of 60 feet. For 1 minute or until you lose your concentration (as if you were casting a concentration spell), each hostile creature that starts its turn in this aura must succeed on a Will saving throw or be charmed (if you chose awe) or frightened (if you chose fear) until the aura ends.\n\nA creature that succeeds on this saving throw is immune to your aura for 24 hours.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Profane Bloodline Spells",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline - Profane, Spellcasting",
    "description": "At each of the spellcasting levels listed on the Bloodline Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are of the same type as your bloodline.",
    "1stLevelSpells": "Dissonant Whispers, Unnoticeable",
    "2ndLevelSpells": "Invisibility, Shadow Blade",
    "3rdLevelSpells": "Summon Shadowspawn, Voidgate",
    "4thLevelSpells": "Shadow Conflagration, Spectral Hound",
    "5thLevelSpells": "Mislead, Temporal Shunt"
  },
  {
    "name": "Novice Profane Bloodline - Living Shadow",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline - Profane",
    "description": "Your existence in a twilight state between life and death makes you difficult to defeat. When damage reduces you to 0 hit points, you can make a Will saving throw (DC 5 + the damage taken). On a success, you instead drop to 1 hit point. You can't use this feature if you are reduced to 0 hit points by Light damage or by a critical hit.\n\nOnce you succeed on this saving throw, you can't attempt to do so again until after your next Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Profane Bloodline - Shadow Step",
    "identity": "Inheritor",
    "requirements": "Requires Novice Profane Bloodline - Living Shadow, Level 6",
    "description": "You gain the ability to step from one shadow into another. When you are in dim light or darkness, as an action, you can teleport up to 120 feet to an unoccupied space you can see that is also in dim light or darkness.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Profane Bloodline - Become the Shadow",
    "identity": "Inheritor",
    "requirements": "Requires Advanced Profane Bloodline - Shadow Step, Level 9",
    "description": "You can spend 6 spell points as an action to transform yourself into a shadowy form. In this form, you have resistance to all damage except Arcane and Light damage, and you can move through other creatures and objects as if they were difficult terrain. You take 5 arcane damage if you end your turn inside an object. You remain in this form for 1 minute. It ends early if you are incapacitated, if you die, or if you dismiss it as a free action.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Storm Spirit Bloodline Spells",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline - Storm Spirit, Spellcasting",
    "description": "At each of the spellcasting levels listed on the Bloodline Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are of the same type as your bloodline.",
    "1stLevelSpells": "Fog Cloud, Thunderwave",
    "2ndLevelSpells": "Snowstorm, Warding Wind",
    "3rdLevelSpells": "Lightning Bolt, Sleet Storm",
    "4thLevelSpells": "Ice Storm, Watery Sphere",
    "5thLevelSpells": "Maelstrom, Destructive Wave"
  },
  {
    "name": "Novice Storm Spirit Bloodline - Invoke the Storm",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline - Storm Spirit",
    "description": "You gain resistance to lightning and thunder damage. In addition, whenever you start casting a spell of 1st level or higher that deals lightning or thunder damage, stormy magic erupts from you. This eruption causes creatures of your choice that you can see within 10 feet of you to take lightning or thunder damage (choose each time this ability activates) equal to your sorcerer level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Storm Spirit Bloodline - Static Charge",
    "identity": "Inheritor",
    "requirements": "Requires Novice Storm Spirit Bloodline - Invoke the Storm, Level 6",
    "description": "When you are hit by a melee attack, you can use your reaction to deal lightning damage to the attacker. The damage equals your level. The attacker must also make a Fortitude saving throw. On a failed save, the attacker is pushed in a straight line up to 20 feet away from you.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Storm Spirit Bloodline - Storm's Flight",
    "identity": "Inheritor",
    "requirements": "Requires Advanced Storm Spirit Bloodline - Static Charge, Level 9",
    "description": "You gain immunity to lightning and thunder damage.\n\nYou also gain a magical flying speed of 60 feet. Using two actions, you can reduce your flying speed to 30 feet for 1 hour and choose a number of creatures within 30 feet of you equal to your Charisma modifier. The chosen creatures gain a magical flying speed of 30 feet for 1 hour. Once you reduce your flying speed in this way, you can't do so again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Psion Bloodline Spells",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline - Psion, Spellcasting",
    "description": "At each of the spellcasting levels listed on the Bloodline Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are of the same type as your bloodline.",
    "1stLevelSpells": "Chaos Bolt, Dissonant Whispers",
    "2ndLevelSpells": "Crown of Madness, Mind Spike",
    "3rdLevelSpells": "Spirit Shroud, Vampiric Touch",
    "4thLevelSpells": "Compulsion, Phantasmal Killer",
    "5thLevelSpells": "Synaptic Static, Telekinesis"
  },
  {
    "name": "Novice Psion Bloodline - Subtle Casting",
    "identity": "Inheritor",
    "requirements": "Requires Bloodline - Psion",
    "description": "When you cast any of your Bloodline Spells, they require no verbal or somatic components.\n\nAdditionally, you gain resistance to psychic damage, and you have advantage on saving throws against being charmed or frightened",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Psion Bloodline - Psionic Warp",
    "identity": "Inheritor",
    "requirements": "Requires Novice Psion Bloodline - Subtle Casting, Level 6",
    "description": "You can unleash your Psionic power as a space-warping anomaly. Using two actions, you can teleport to an unoccupied space you can see within 120 feet of you. Immediately after you disappear, each creature within 30 feet of the space you left must make a Fortitude saving throw. On a failed save, a creature takes 3d10 Arcane damage and is pulled straight toward the space you left, ending in an unoccupied space as close to your previous space as possible. On a successful save, the creature takes half as much damage and isn't pulled.\n\nOnce you use this feature, you can't do so again until after you Rest, or unless you spend 5 spell points to use it again.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Psion Bloodline - Mass Mind Reader",
    "identity": "Inheritor",
    "requirements": "Requires Advanced Psion Bloodline - Psionic Warp, Level 9",
    "description": "Using two actions, you can open your mind and read the thoughts and plans of those around you. For 1 minute, you gain advantage on any Persuasion or Insight skill checks to interact with NPCs. If you are in combat, you gain advantage on all attack rolls against enemies within 30 feet, and all enemies within 30 feet have disadvantage on attack rolls against you and on Reflex saving throws from spells you cast.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Astral Protection",
    "identity": "Mystic",
    "requirements": "Requires Level 5",
    "description": "As a reaction or single action, you can spend 4 ki points to turn invisible for 1 minute. While invisible, you have resistance to all damage except arcane damage. If you take any hostile action, the invisibility ends early.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Deflect Missiles",
    "identity": "Mystic",
    "requirements": "Requires Dexterity 14 or Wisdom 14",
    "description": "You can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by your martial arts dice + your Dexterity modifier + your Wisdom modifier + your level.\n\nIf you reduce the damage to 0, you can catch the missile as long as it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, make a ranged attack with a range of 20/60 using the weapon or piece of ammunition you just caught, as part of the same reaction.\n\nYou are proficient with this attack, and can use your Dexterity modifier for both the attack roll and damage calculation.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Flexibility of Mind",
    "identity": "Mystic",
    "requirements": "Requires Ki, Level 5",
    "description": "Whenever you begin a combat encounter and don't have any Ki points remaining, you immediately regain a number of ki points equal to your Wisdom Modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Ki-Touched Mind",
    "identity": "Mystic",
    "requirements": "Requires Ki, Level 5",
    "description": "You can spend a single ki point to expand your mind to understand others. For 1 hour, you understand all spoken languages, so long as you are within 30 feet of someone who speaks that language. Additionally, anyone within 30 feet of you can understand you, so long as there is a language that they understand.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Slow Fall",
    "identity": "Mystic",
    "requirements": "Requires Wisdom 14",
    "description": "You can spend your reaction to magically slow your descent during a fall, reducing any fall damage you take by 5 * your level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Stunning Strike",
    "identity": "Mystic",
    "requirements": "Requires Ki",
    "description": "When you hit an enemy with an unarmed attack, you can spend a single ki point to force them to make a Fortitude saving throw or be stunned until the end of your next turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Unarmed Momentum",
    "identity": "Mystic",
    "requirements": "Requires Dexterity 16",
    "description": "When you take the attack action and make an unarmed attack, you can make a second attack as part of the same action. These strikes count as a single attack for the purpose of determining your multiple attack modifier. If you have the Flurry of Blows special ability, the number of attacks you can make with that ability increases to 3.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Drunken Master - Drunken Wanderer",
    "identity": "Mystic",
    "requirements": "Requires Flurry of Blows",
    "description": "You gain a skill increase to Performance.\n\nWhenever you use your Flurry of Blows ability, you can take the Step ability as part of the same action.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Drunken Master - Lucky Bounce",
    "identity": "Mystic",
    "requirements": "Requires Novice Drunken Master - Drunken Wanderer, Ki, Level 3",
    "description": "When you make an ability check, attack roll, or saving throw and have disadvantage on the roll, you can spend 2 ki points to negate the disadvantage for the roll.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Drunken Master - A Round for Everyone",
    "identity": "Mystic",
    "requirements": "Requires Advanced Drunken Master - Lucky Bounce, Level 5",
    "description": "When you use your Flurry of Blows, you can make up to three additional attacks with it, provided that you target a single creature with no more than two strikes of the flurry.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Kensei - Agile Parry",
    "identity": "Mystic",
    "requirements": "Requires Wisdom 14",
    "description": "You gain a skill increase to Society.\n\nWhen you are wielding a weapon, if you have a martial arts dice, you can choose to use that dice in place of your weapon's normal damage dice.\n\nIf you are wielding a weapon in one hand and make an unarmed strike as a part of your turn, you gain a +2 bonus to Defense until the start of your next turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Kensei - Martial Disciple",
    "identity": "Mystic",
    "requirements": "Requires Novice Kensei - Agile Parry, Ki, Martial Arts, Level 3",
    "description": "When you make an attack with a weapon you are proficient with, you can spend a ki point to add your martial arts dice to the damage roll of the attack.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Kensei - Preserved Momentum",
    "identity": "Mystic",
    "requirements": "Requires Advanced Kensei - Martial Disciple, Level 6",
    "description": "Once per turn when you miss an attack with a weapon or unarmed strike, you can reroll the attack.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Open Hand - Manipulative Strikes",
    "identity": "Mystic",
    "requirements": "Requires Flurry of Blows",
    "description": "Whenever you hit a creature with one of the attacks granted by your Flurry of Blows, you can impose one of the following effects on that target:\n\n- It must succeed on a Dexterity saving throw or be knocked prone.\n\n- It must make a Strength saving throw. If it fails, you can push it up to 15 feet away from you.\n\n- It can't take reactions until the end of your next turn.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Open Hand - Peaceful Wanderer",
    "identity": "Mystic",
    "requirements": "Requires Novice Open Hand - Manipulative Strikes, Level 3",
    "description": "At the start of each day, you take on an aura of tranquility. Until you take a hostile action, any creature that wishes to attack you or target you with a spell must first make a Will saving throw. On a failed save, they must choose a new target or lose the attack or ability. On a successful save they are immune to this effect for 24 hours.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Open Hand - Quivering Palm",
    "identity": "Mystic",
    "requirements": "Requires Advanced Open Hand - Peaceful Wanderer, Level 6",
    "description": "When you hit a creature with an unarmed strike, you can spend 3 ki points to start imperceptible lethal vibrations in your target's body, which last for a number of days equal to your level. The vibrations are harmless unless you use your action to end them. To do so, you and the target must be on the same plane of existence. When you use this action, the creature must make a Fortitude saving throw. If it fails, it is reduced to 0 hit points. If it succeeds, it takes 10d10 Dark damage.\n\nYou can have only one creature under the effect of this feature at a time. You can choose to end the vibrations harmlessly without using an action.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Shadow - Fade into Darkness",
    "identity": "Mystic",
    "requirements": "Requires Ki",
    "description": "Using two actions, you can spend 2 ki points to cast Darkness, Darkvision, Unnoticeable, or Silence, without providing material components.\n\nAdditionally, you gain the Minor Illusion cantrip if you don't already know it.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Shadow - Linked Shadows",
    "identity": "Mystic",
    "requirements": "Requires Novice Shadow - Fade into Darkness, Level 3",
    "description": "When you are in dim light or darkness, you can use a single action to teleport up to 60 feet to an unoccupied space you can see that is also in dim light or darkness. You then have advantage on the first melee attack you make before the end of the turn.\n\nAdditionally, When you are in an area of dim light or darkness, you can use two actions to become invisible. You remain invisible until you make an attack, cast a spell, or are in an area of bright light.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Shadow - And One from Me",
    "identity": "Mystic",
    "requirements": "Requires Advanced Shadow - Linked Shadows, Level 6",
    "description": "Whenever a creature within 5 feet of you is hit by an attack made by a creature other than you, you can use your reaction to make a melee attack against that creature.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Sun Soul - Flaming Fists",
    "identity": "Mystic",
    "requirements": "Requires Wisdom 14",
    "description": "You gain a new attack option that you can use whenever you make an unarmed attack. This special attack is a ranged spell attack with a range of 30 feet. You are proficient with it, and you add your Dexterity modifier to its attack and damage rolls. It deals Light damage equal to the damage you would deal with an unarmed attack.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Sun Soul - Summon the Sun",
    "identity": "Mystic",
    "requirements": "Requires Novice Sun Soul - Flaming Fists, Ki, Level 3",
    "description": "You gain the ability to create an orb of light that erupts into a devastating explosion. Using two actions, you magically create an orb and hurl it at a point you choose within 150 feet, where it erupts into a sphere of radiant light for a brief but deadly instant.\n\nEach creature in that 20-foot-radius sphere must succeed on a Fortitude saving throw or take 2d6 Light damage. A creature doesn't need to make the save if the creature is behind total cover.\n\nYou can increase the sphere's damage by spending ki points. Each point you spend, up to a maximum of 3, increases the damage by 2d6.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Sun Soul - Radiant Glow",
    "identity": "Mystic",
    "requirements": "Requires Advanced Sun Soul - Summon the Sun, Level 6",
    "description": "You shed bright light in a 30-foot radius and dim light for an additional 30 feet. You can extinguish or restore the light as a single action.\n\nIf a creature hits you with a melee attack while this light shines, you can use your reaction to deal Light damage to the creature. The Light damage equals your level + your Wisdom modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Priest Spellcasting Increase",
    "identity": "Priest",
    "requirements": "Requires Priest Spellcasting",
    "description": "Your spellcasting level increases by 1. You can take this perk multiple times, and each time you do so your spellcasting level increases by 1. You may not take this perk if it would cause your spellcasting level to be higher than your character level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Cast Down",
    "identity": "Priest",
    "requirements": "Requires Divine Spellcasting",
    "description": "When you cast a spell of 1st level or higher that targets a single enemy, if the attack is successful or if they fail the saving throw they must make a Fortitude saving throw or be knocked prone.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Divine Strike",
    "identity": "Priest",
    "requirements": "Requires Wisdom 14",
    "description": "Whenever you hit an enemy with a melee attack or cantrip, they take additional damage equal to your Wisdom modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Eternal Blessing",
    "identity": "Priest",
    "requirements": "Requires Divine Spellcasting, Level 3",
    "description": "You have an aura of divine blessing that extends in a 15 foot radius around you. Any ally inside this aura can add 1d4 to any attack roll, ability check, or saving throw.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Powerful Healer",
    "identity": "Priest",
    "requirements": "Requires Font of Healing",
    "description": "Whenever you heal an ally with your font of healing, you gain hit points equal to your Wisdom Modifier. Additionally whenever you cast a healing spell, the size of all its healing dice are increased by 1.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Snatched from the Grave",
    "identity": "Priest",
    "requirements": "Requires Font of Healing, level 5",
    "description": "When an ally dies from damage or from failing death saves, you can use your reaction and expend a use of your Font of Healing to return them to life with 1 hit point and 3 wounds.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Arcana Domain Spells",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Domain Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Mage Armor, Magic Missile",
    "2ndLevelSpells": "Mirror Image, Silence",
    "3rdLevelSpells": "Dispel Magic, Magic Circle",
    "4thLevelSpells": "Polymorph, Private Sanctum",
    "5thLevelSpells": "Planar Binding, Teleportation Circle"
  },
  {
    "name": "Novice Arcana Domain - Arcane Initiate",
    "identity": "Priest",
    "requirements": "Requires Intelligence 14",
    "description": "You gain a skill increase in the arcana skill, and learn a cantrip of your choice from the Arcane Spell List. If you are already proficient in a form of spellcasting, this cantrip is of that spellcasting type for you.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Arcana Domain - Purging Heals",
    "identity": "Priest",
    "requirements": "Requires Novice Arcana Domain - Arcane Initiate, Level 4",
    "description": "When you cast a Healing spell on yourself or an ally, you can cast Dispel Magic on them as part of the casting of the Heal without expending a spell charge or spell points.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Arcana Domain - Expansive Knowledge",
    "identity": "Priest",
    "requirements": "Requires Novice Arcana Domain - Arcane Initiate, Spellcasting, Level 5",
    "description": "You learn a number of spells from the Arcane spell list equal to your spellcasting level, these spells are always prepared for you, and don't count against the number of spells you can prepare. Each time your spellcasting level increases, you learn an additional spell from the Arcane spell list. This spell must be of a level less than or equal to your Spellcasting Level, and must be prepared as normal.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Creation Domain Spells",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Domain Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Burning Hands, Magic Weapon",
    "2ndLevelSpells": "Heat Metal, Spiritual Weapon",
    "3rdLevelSpells": "Elemental Weapon, Glyph of Warding",
    "4thLevelSpells": "Fabricate, Summon Construct",
    "5thLevelSpells": "Animate Objects, Creation"
  },
  {
    "name": "Novice Creation Domain - Empowered Weapon",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "During the end of each Rest, you can spend an hour and imbue a single weapon with power to grant it +1 to attack rolls and 2x its base weapon damage dice.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Creation Domain - Fire Hardened Plates",
    "identity": "Priest",
    "requirements": "Requires Novice Creation Domain - Empowered Weapon, Level 4",
    "description": "You gain resistance to fire damage, and gain +1 Defense and Armor while wearing heavy armor",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Creation Domain - Saint of the Forge",
    "identity": "Priest",
    "requirements": "Requires Advanced Creation Domain - Fire Hardened Plates, Level 9",
    "description": "You are immune to fire damage, and while wearing heavy armor have resistance to bludgeoning, slashing, and piercing damage.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Death Domain Spells",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Domain Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "False Life, Spider Sting",
    "2ndLevelSpells": "Gentle Repose, Silence",
    "3rdLevelSpells": "Speak with Dead, Life Transference",
    "4thLevelSpells": "Blight, Death Ward",
    "5thLevelSpells": "Antilife Shell, Raise Dead"
  },
  {
    "name": "Novice Death Domain - Epidemic Necromancy",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "You learn a necromancy cantrip of your choice from any spell list. In addition, whenever you cast a necromancy spell, you may have that spell target an additional target, provided that both targets are within range.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Death Domain - Corrupting Spells",
    "identity": "Priest",
    "requirements": "Requires Novice Death Domain - Epidemic Necromancy, Level 4",
    "description": "Whenever you hit an enemy with a damaging spell or effect, you can cause the damage dealt to be Dark damage instead of its original damage type.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Death Domain - Feast on the Dark",
    "identity": "Priest",
    "requirements": "Requires Advanced Death Domain - Corrupting Spells, Level 9",
    "description": "Whenever you kill an enemy with your Dark damage, you can heal yourself or an ally within range of the spell for half the amount of damage dealt",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Life Domain Spells",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Domain Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Detect Intent, Sanctuary",
    "2ndLevelSpells": "Aid, Prayer of Healing",
    "3rdLevelSpells": "Aura of Vitality, Beacon of Hope",
    "4thLevelSpells": "Aura of Life, Death Ward",
    "5thLevelSpells": "Mass Cure Wounds, Raise Dead"
  },
  {
    "name": "Novice Life Domain - Practiced Healer",
    "identity": "Priest",
    "requirements": "Requires Divine Spellcasting",
    "description": "Whenever you cast a spell to heal a creature, that creature gains additional hit points equal to your wisdom modifier + the spells level",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Life Domain - Protective Healing",
    "identity": "Priest",
    "requirements": "Requires Novice Life Domain - Practiced Healer, Level 4",
    "description": "Whenever you heal an ally, either you or your target (your choice) gains a number of temporary hit points equal to the amount of hit points restored.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Life Domain - Flawless Healing",
    "identity": "Priest",
    "requirements": "Requires Advanced Life Domain - Protective Healing, Level 9",
    "description": "Whenever you heal an ally, the roll for the amount of hit points restored is always the max value of the roll.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Light Domain Spells",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Domain Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Color Spray, Faerie Fire",
    "2ndLevelSpells": "Blindness / Deafness, Scorching Rays",
    "3rdLevelSpells": "Daylight, Fireball",
    "4thLevelSpells": "Guardian of Faith, Wall of Fire",
    "5thLevelSpells": "Dawn, Wall of Light"
  },
  {
    "name": "Novice Light Domain - Warding Flare",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "Whenever you are attacked by a creature within 30 feet of you, you can use your reaction to impose disadvantage on the attack roll, causing a sudden flare of light to erupt between you. A creature that can't be blinded is immune to this feature. \n\nYou also learn the light cantrip if you don't already know it.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Light Domain - Mobile Flare",
    "identity": "Priest",
    "requirements": "Requires Novice Light Domain - Warding Flare, Level 4",
    "description": "You can now use your warding flare reaction whenever one of your allies is attacked. Additionally, the blinding effect lasts until the end of the target's turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Light Domain - Corona of Light",
    "identity": "Priest",
    "requirements": "Requires Advanced Light Domain - Mobile Flare, Level 7",
    "description": "You can use an action to emit an aura of sunlight that lasts for one minute or until you dismiss it. You emit bright light in a 60 foot radius, and dim light another 30 feet beyond that. Any enemies inside the aura of light have disadvantage against any saving throws caused by spells that deal Light or Fire damage.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Nature Domain Spells",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Domain Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Entangle, Find Familiar",
    "2ndLevelSpells": "Barkskin, Spike Growth",
    "3rdLevelSpells": "Plant Growth, Summon Fey",
    "4thLevelSpells": "Dominate Beast, Summon Elemental",
    "5thLevelSpells": "Tree Stride, Wrath of Nature"
  },
  {
    "name": "Novice Nature Domain - Primal Practitioner",
    "identity": "Priest",
    "requirements": "Requires Wisdom 14",
    "description": "You learn a cantrip of your choice from the Primal Spell List, and gain a skill increase in the Nature Skill. If you are proficient in a form of spellcasting, this spell is of that type.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Nature Domain - Warded from the Elements",
    "identity": "Priest",
    "requirements": "Requires Novice Nature Domain - Primal Practitioner, Level 4",
    "description": "Whenever an ally of yours within 30 feet of you takes elemental damage (acid, cold, fire, lightning, thunder) you can use your reaction to grant that ally resistance to that damage.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Nature Domain - Nature's Ally",
    "identity": "Priest",
    "requirements": "Requires Advanced Nature Domain - Warded from the Elements, Level 9",
    "description": "As an action, you can force each Beast or Plant creature within 30 feet that can see you to make a Will save against your Ability DC. If a creature fails this saving throw, they are charmed by you for 1 minute or until they take damage from you or an ally. While these creatures are charmed, you can spend an action to individually command each of them what to do on their next turn.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Order Domain Spells",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Domain Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Command, Comprehend Languages",
    "2ndLevelSpells": "Hold Person, Enthrall",
    "3rdLevelSpells": "Haste, Tongues",
    "4thLevelSpells": "Compulsion, Freedom of Movement",
    "5thLevelSpells": "Dominate Person, Modify Memory"
  },
  {
    "name": "Novice Order Domain - Commanding Influence",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "Whenever you target an ally with a spell, they can use their reaction to make a single weapon attack against an enemy within range.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Order Domain - Quick Commands",
    "identity": "Priest",
    "requirements": "Requires Novice Order Domain - Commanding Influence, Level 4",
    "description": "Whenever you cast an enchantment spell, you can reduce its casting time by 1 action (to a minimum of 1 action).",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Order Domain - Lead the Masses",
    "identity": "Priest",
    "requirements": "Requires Advanced Order Domain - Quick Commands, Level 9",
    "description": "Whenever you cast an enchantment spell, you can target one additional target, provided both targets are within range.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Tempest Domain Spells",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Domain Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Fog Cloud, Thunderwave",
    "2ndLevelSpells": "Dust Devil, Shatter",
    "3rdLevelSpells": "Tidal Wave, Lightning Bolt",
    "4thLevelSpells": "Control Water, Ice Storm",
    "5thLevelSpells": "Insect Plague, Destructive Wave"
  },
  {
    "name": "Novice Tempest Domain - Storm's Rebuke",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "Whenever an enemy hits you with a melee attack, you can use your reaction to force them to make a Reflex Saving Throw. The creature takes 2d8 Lightning or Thunder damage (your choice) on a failed saving throw, and half as much on a successful one.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Tempest Domain - Forceful Crash",
    "identity": "Priest",
    "requirements": "Requires Novice Tempest Domain - Storm's Rebuke, Level 4",
    "description": "Whenever you deal lightning or thunder damage to a creature, you can also push them up to 10 feet in any direction (away from you)",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Tempest Domain - Storm's Lift",
    "identity": "Priest",
    "requirements": "Requires Advanced Tempest Domain - Forceful Crash, Level 9",
    "description": "Whenever you are not indoors or underground, you have a flying speed equal to half your walking speed.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Trickery Domain Spells",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Domain Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Disguise Self, Unnoticeable",
    "2ndLevelSpells": "Invisibility, Darkvision",
    "3rdLevelSpells": "Hypnotic Pattern, Major Image",
    "4thLevelSpells": "Dimension Door, Polymorph",
    "5thLevelSpells": "Dominate Person, Modify Memory"
  },
  {
    "name": "Novice Trickery Domain - Hidden Blessing",
    "identity": "Priest",
    "requirements": "Requires Wisdom 14",
    "description": "You can spend an action to touch another creature and bless them for one hour. While blessed, that creature has advantage on all Stealth checks. You can bless one creature at any given time.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Trickery Domain - Now You See Me",
    "identity": "Priest",
    "requirements": "Requires Novice Trickery Domain - Hidden Blessing, Level 4,",
    "description": "As two actions, you can make yourself invisible until the end of your next turn. You lose this effect if you make an attack or cast a spell while invisible. You can use this ability a number of times equal to your spellcasting modifier per day.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Trickery Domain - Perfect Copy",
    "identity": "Priest",
    "requirements": "Requires Advanced Trickery Domain - Now You See Me, Level 9",
    "description": "As an action, you create a perfect illusion of yourself that lasts for 1 minute, or until you lose your concentration (as if you were concentrating on a spell). The illusion appears in an unoccupied space that you can see within 30 feet of you. As an action on your turn, you can move the illusion up to 30 feet to a space you can see, but it must remain within 120 feet of you.\n\nFor the duration, you can cast spells as though you were in the illusion's space, but you must use your own senses. Additionally, when both you and your illusion are within 5 feet of a creature that can see the illusion, you have advantage on attack rolls against that creature, given how distracting the illusion is to the target.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "War Domain Spells",
    "identity": "Priest",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Domain Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Divine Spells for you.",
    "1stLevelSpells": "Bane, Divine Favor",
    "2ndLevelSpells": "Cloud of Daggers, Find Steed",
    "3rdLevelSpells": "Conjure Barrage, Spirit Guardians",
    "4thLevelSpells": "Staggering Smite, Stone Skin",
    "5thLevelSpells": "Steel Wind Strike, Destructive Wave"
  },
  {
    "name": "Novice War Domain - We Hold",
    "identity": "Priest",
    "requirements": "Requires Wisdom 14",
    "description": "Whenever you score a critical hit or kill an enemy, you and allies within 10 feet of you gain temporary hit points equal to your Wisdom Modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert War Domain - Guided Strikes",
    "identity": "Priest",
    "requirements": "Requires Novice War Domain - We Hold, Level 7",
    "description": "You can add your Wisdom modifier to your attack rolls with melee weapons.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Cunning Action",
    "identity": "Scoundrel",
    "requirements": "Requires Dexterity 14",
    "description": "Once on each of your turns, you can take one of the Hide, Step, or Stride actions as a free action.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Elusive",
    "identity": "Scoundrel, Mystic",
    "requirements": "Requires Level 5",
    "description": "No attack roll has advantage against you unless you are incapacitated.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Evasion",
    "identity": "Scoundrel, Warden, Mystic",
    "requirements": "Requires Dexterity 16",
    "description": "When you are subjected to an effect that allows you to make a Reflex saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert",
    "identity": "Scoundrel",
    "requirements": "Requires Intelligence 14",
    "description": "You gain a number of skill increases equal to your intelligence modifier. Each time your intelligence modifier increases, you gain an additional skill increase.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Nimble",
    "identity": "Scoundrel, Mystic",
    "requirements": "Requires Dexterity 14",
    "description": "Your walking speed increases by 10 feet, and you gain a swimming and climbing speed of 15 feet. If you already have a swimming or climbing speed, those speeds increase by 5 feet instead.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Remarkable Reflexes",
    "identity": "Scoundrel",
    "requirements": "Initiative 14",
    "description": "On the first round of combat you can take 2 turns. The first turn is taken on your initiative, and the second is taken at your initiative -10. You cannot use this feature if you are surprised.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Stroke of Luck",
    "identity": "Scoundrel",
    "requirements": "Requires Level 10",
    "description": "Once per day, you can turn a single missed weapon attack into a hit, or a single ability check roll into a natural 20.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Uncanny Dodge",
    "identity": "Scoundrel, Mystic",
    "requirements": "Requires Dexterity 14",
    "description": "When an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Arcane Trickster - Mage Hand Expert",
    "identity": "Scoundrel",
    "requirements": "Requires Arcane Spellcasting",
    "description": "You learn the Mage Hand and Minor Illusion cantrips from the Arcane spell list. If you already know one or both of these cantrips, you learn one of your choice instead.\n\nAdditionally, you have improved control over the mage hand cantrip (like picking pockets and disarming traps), and can turn the hand invisible at will. You can perform tasks without being noticed by making a successful Thievery check against your target's Perception check.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Arcane Trickster - Look at the Hand",
    "identity": "Scoundrel",
    "requirements": "Requires Novice Arcane Trickster - Mage Hand Expert, Level 3",
    "description": "You can an action to use your mage hand to distract enemies, giving yourself advantage on all attacks against them until the start of your next turn",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Arcane Trickster - Spell Theif",
    "identity": "Scoundrel",
    "requirements": "Requires Advanced Arcane Trickster - Look at the Hand, Level 7",
    "description": "When an enemy attempts to cast a spell, you can use your reaction to attempt to steal the knowledge of the spell from them. You force the enemy caster to make a check using their Spell Proficiency against your Ability DC. If they succeed, they cast the spell as normal and are immune to this effect for 24 hours. If they fail, their spell fizzles and you gain a single charge of their spell that you can use to cast the spell without expending a spell slot. This charge expires at the end of your next Rest. \n\nYou cannot attempt to steal a spell while you have a stored spell charge.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Assassin - Ambush",
    "identity": "Scoundrel",
    "requirements": "Requires Initiative 6",
    "description": "Whenever you attack an enemy that has not acted yet in combat, you have advantage on the attack roll. Additionally, any successful attack against an enemy that hasn't acted yet in combat is an automatic critical hit.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Assassin - Infiltrator",
    "identity": "Scoundrel",
    "requirements": "Requires Novice Assassin - Ambush, Level 3",
    "description": "You can spend a week crafting a false identity for yourself. You can't establish an identity that already belongs to someone else. Thereafter, if you adopt the identity as a disguise, other creatures believe you to be that person until you give them a reason not to.\n\nYou gain the ability to unerringly mimic another person's speech, writing, and behavior. You must spend at least three hours studying these three components of the person's behavior, listening to speech, examining handwriting, and observing mannerisms.\n\nYour ruse is indiscernible to the casual observer. This removes the restriction from the above ability to copy an already existing persona (However a close ally will spot your ruse).",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Assassin - Coup De Grace",
    "identity": "Scoundrel",
    "requirements": "Requires Advanced Assassin - Infiltrator, Level 7",
    "description": "When you hit an enemy with an attack and it is surprised (or who hasn't acted yet in this combat) It must make a Fortitude saving throw against your Ability DC or your attack deals double damage (including any critical hit damage).",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Mastermind - Act the Part",
    "identity": "Scoundrel",
    "requirements": "Requires Intelligence 14",
    "description": "You can cast the spell Disguise Self a number of times per day equal to your Charisma modifier. This action does not count as casting a spell for you. Additionally, you can spend 10 minutes observing a creature (must be able to hear them) to be able to mimic their speech patterns and accent, able to pass yourself off as a native speaker.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Mastermind - Help from Afar",
    "identity": "Scoundrel",
    "requirements": "Requires Novice Mastermind - Act the Part, Level 3",
    "description": "You can spend an action to grant a creature within 30 feet of you advantage on a single attack, ability check, or saving throw.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Mastermind - Nope, Not Me",
    "identity": "Scoundrel",
    "requirements": "Requires Advanced Mastermind - Help from Afar, Level 7",
    "description": "When you are attacked and there is another enemy or ally within 5 feet of you, you can spend your reaction to cause the attack to target them instead.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Poisoner - Poisoner's Vial",
    "identity": "Scoundrel",
    "requirements": "Requires Intelligence 14",
    "description": "You gain a Poisoner's Vial, a special device used to store poisons. During each Rest, you brew a potent poison and store it in your Poisoner's Vial. You create a number of doses of poison equal to your Intelligence modifier (minimum of 1), and these doses last until you next brew and refill your Vial. \n\nYou can use two actions to coat a single blade or a handful of arrows (5) in this poison. Whenever an enemy ingests or is damaged by a slashing or piercing weapon coating in this poison, they must make a Fortitude saving throw against a DC 9 + your level + your intelligence modifier or take 1d4 Poison damage.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Poisoner - Custom Toxins",
    "identity": "Scoundrel",
    "requirements": "Requires Novice Poisoner - Poisoner's Vial, Level 3",
    "description": "You gain the ability to customize your poisons. Your poison's damage dice increases to 1d6, and it gains one of the following effects:\n\n- Slowing: target's move speed is reduced by 10 feet\n\n- Dizzying: target's next saving throw is made with disadvantage\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Poisoner - Magical Toxins",
    "identity": "Scoundrel",
    "requirements": "Requires Advanced Poisoner - Custom Toxins, Level 7",
    "description": "Your proficiency with Poisons increases. You can now use a single action to apply your poison to a single sword blade, a pair of daggers, or a quiver of arrows (10).\n\nYou gain the ability to infuse magical reagents into your poisons, granting them increasingly potent effects. Choose one of the effects below, on a failed save the target of your poison's suffer its effect:\n\n- Blinding - target loses vision for 1 round \n\n- Charming - target is charmed by you for 1 hour or until you or one of your allies takes hostile action against it. \n\n- Paralytic -target loses its next two actions \n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Ruffian - Anything Will Do",
    "identity": "Scoundrel",
    "requirements": "Requires Sneak Attack",
    "description": "You gain proficiency in Medium armor. In addition, you can use your sneak attack with unarmed attacks, or attacks with any simple or improvised weapon (instead of just finesse weapons.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Ruffian - Gut Punch",
    "identity": "Scoundrel",
    "requirements": "Requires Novice Ruffian - Anything Will Do, Level 3",
    "description": "When you use an action to intimidate an enemy you can see, they must make a Will saving throw against your Ability DC. If you have hit them with your sneak attack since the end of their last turn, they have disadvantage on the saving throw. On a failed saving throw, they are Frightened until the end of their next turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Ruffian - Crippling Strikes",
    "identity": "Scoundrel",
    "requirements": "Requires Advanced Ruffian - Gut Punch, Level 7",
    "description": "When you hit an enemy with an unarmed, improvised, or bludgeoning attack and trigger your sneak attack damage, the damage from your attack ignores all armor or physical resistances.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Scout - On the Move",
    "identity": "Scoundrel",
    "requirements": "Requires Dexterity 14",
    "description": "When an enemy ends their turn within 5 feet of you, you can use your reaction to take the Step action\n\nYour walking speed increases by 5 feet, and you gain a swimming and climbing speed of 15 feet. If you already have a swimming or climbing speed, those speeds increase by 5 feet instead.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Scout - Forward Operator",
    "identity": "Scoundrel",
    "requirements": "Requires Novice Scout - On the Move, Initiative 6",
    "description": "You have advantage on initiative rolls. Whenever you make an attack roll during the first round of combat against an enemy that hasn't acted yet, your attack roll has advantage.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Scout - Clear the Camp",
    "identity": "Scoundrel",
    "requirements": "Requires Advanced Scout - Forward Operator, Level 7",
    "description": "You can use your sneak attack twice per turn, instead of once, though you cannot use it against the same enemy twice in one turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Swashbuckler - En Guarde",
    "identity": "Scoundrel",
    "requirements": "Requires Charisma 14",
    "description": "Your skill as a fencer has allowed you to shut down an opponents offensive. When you hit an enemy with a melee attack, they are incapable of making attacks of opportunity against you until the start of your next turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Swashbuckler - Taunting Bravado",
    "identity": "Scoundrel",
    "requirements": "Requires Novice Swashbuckler - En Guarde, Level 3",
    "description": "You can spend an action to make a Persuasion or Performance check contested by your chosen target's Insight check. If you succeed, the chosen target has disadvantage on all attacks that do not target you, and cannot make attacks of opportunity against enemies other than you. This effect lasts for one minute, or until one of your allies affects them with an attack or spell.\n\nIf you attempt this action against a target who is not hostile to you and succeed, then they are Charmed by you for 1 minute.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Swashbuckler - Panache",
    "identity": "Scoundrel",
    "requirements": "Requires Advanced Swashbuckler - Taunting Bravado, Level 7",
    "description": "You can add your Charisma modifier to your initiative rolls.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Spellblade Spellcasting Increase",
    "identity": "Spellblade",
    "requirements": "Requires Spellblade Spellcasting",
    "description": "Your spellcasting level increases by 1. You can take this perk multiple times, and each time you do so your spellcasting level increases by 1. You may not take this perk if it would cause your spellcasting level to be higher than your character level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Arcane Propulsion",
    "identity": "Spellblade, Arcanist",
    "requirements": "Requires Arcane Spellcasting",
    "description": "Your movement speed increases by 10 feet, and your jump height and length increase by 10 feet.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Durable Magic",
    "identity": "Spellblade, Arcanist, Priest, Wildling, Champion, Warden, Bard",
    "requirements": "Requires Spellcasting, Level 5",
    "description": "While you maintain concentration on a spell you have a +2 Bonus to Defense and all saving throws",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Enchanted Blade",
    "identity": "Spellblade, Arcanist",
    "requirements": "Requires Spellcasting",
    "description": "You enchant a melee weapon, allowing you to magically enhance your abilities with it. You can use your Intelligence modifier for attack rolls with this weapon instead of Strength or Dexterity. You can only have one weapon enchanted this way at one time.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Enhanced Shield",
    "identity": "Spellblade",
    "requirements": "Requires Spellcasting",
    "description": "You can cast the shield spell as a reaction to an area of effect spell, and can add its bonus to Reflex or Fortitude saving throws that result from such spells.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Spell Scholar",
    "identity": "Spellblade",
    "requirements": "Requires Spellcasting",
    "description": "You learn a number of spells equal to your spellcasting level. Each time your spellcasting level increases, you learn an additional spell. If your form of spellcasting requires you to prepare spells, these spells are always prepared for you and do not count against your number of spells prepared.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Bastion - Arcane Defense",
    "identity": "Spellblade",
    "requirements": "Requires Arcane Spellcasting",
    "description": "You can use your arcane prowess to weave a constant magical shield around yourself. As long as you are conscious, this shield replaces your Defense calculation with the following formula: 9 + your level + your intelligence modifier + any defense bonuses from armor, your Stuck Defense calculation with: 9 + your level + your intelligence modifier + any defense bonuses from armor, and your touch defense to: 9 +dexterity modifier + your level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Bastion - Bulwark's Defense",
    "identity": "Spellblade",
    "requirements": "Requires Novice Bastion - Arcane Defense, Level 3",
    "description": "You gain the ability to momentarily protect allies near you with your arcane shield. When one of your allies within 10 feet is attacked, you can spend your reaction to add your intelligence modifier to their defense value until the end of the attacker's turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Bastion - The Wall",
    "identity": "Spellblade",
    "requirements": "Requires Advanced Bastion - Bulwark's Defense, Level 7",
    "description": "Your arcane shield grows in size and strength. As an action you can grant all allies within 15 feet your arcane defense instead of their standard defense calculation. This effect lasts until the beginning of your next turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Artillerist - Wand Master",
    "identity": "Spellblade",
    "requirements": "Requires Spellcasting",
    "description": "You are a master of wands and their use. In your downtime, you can craft a wand as long as you have a sharp instrument and a bit of wood. Additionally, whenever you use a wand to cast a spell and roll a one on any of the damage dice, you can re-roll those dice. You must keep the new roll.\n\nYou learn the spell Magic Missile. It is always prepared for you if you have to prepare spells, though it isn't counted against your number of spells prepared.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Artillerist - Efficient Missiles",
    "identity": "Spellblade",
    "requirements": "Requires Novice Artillerist - Wand Master, Level 3",
    "description": "You have begun to master the spell Magic Missile. Whenever you cast Magic Missile, the effect of the spell is determined as if you spent an additional action to cast it (maximum of 3 actions).",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Artillerist - Overwhelming Barrage",
    "identity": "Spellblade",
    "requirements": "Requires Advanced Artillerist - Efficient Missiles, Level 7",
    "description": "You have complete mastery over your barrage of missiles. Whenever you cast the spell Magic Missile and spend at least two actions, the spell is cast at 1 level higher than the level you cast it at.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Warden Spellcasting Increase",
    "identity": "Warden",
    "requirements": "Requires Warden Spellcasting",
    "description": "Your spellcasting level increases by 1. You can take this perk multiple times, and each time you do so your spellcasting level increases by 1. You may not take this perk if it would cause your spellcasting level to be higher than your character level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Companion Training",
    "identity": "Warden, Wildling",
    "requirements": "Requires Animal Companion",
    "description": "When you take the Command an Animal action on your turn, your companion gains 3 actions to use rather than 2.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Fade Away",
    "identity": "Warden",
    "requirements": "Requires Level 5",
    "description": "You can use an action to become invisible, along with any equipment you are wearing or carrying, for one minute. This effect ends early if you cast a spell or take any hostile action. You can use this ability once per day.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Feral Senses",
    "identity": "Warden, Wildling",
    "requirements": "Requires Wisdom 16",
    "description": "When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it.\n\nYou are also aware of the location of any invisible creature within 30 feet of you, provided that you aren't blinded or deafened.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Lands Stride",
    "identity": "Warden",
    "requirements": "Requires Dexterity 14",
    "description": "Difficult terrain doesn't cost you any extra feet of movement. You have advantage on any save against a spell that attempts to hinder your movement.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Precision Aim",
    "identity": "Warden",
    "requirements": "Requires Hunter's Mark, Level 5",
    "description": "You can add your Wisdom Modifier to the attack rolls of any weapon attacks you make against a target marked with your Hunter's Mark.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Predator's Insight",
    "identity": "Warden",
    "requirements": "Requires Hunter's Mark",
    "description": "You can use your Hunter's Mark to mark a target outside of combat, allowing you to study their mannerisms and gain insight into their behaviors. If you spend a minute studying your target you gain advantage on all Insight, Deception, or Persuasion checks against them.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Targeted Weaknesses",
    "identity": "Warden",
    "requirements": "Requires Hunter's Mark, Level 7",
    "description": "You can add your Wisdom Modifier to the damage rolls of any weapon attacks you make against a target marked with your Hunter's Mark.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Rover",
    "identity": "Warden, Scoundrel, Wildling",
    "requirements": "Requires Dexterity 14",
    "description": "Your walking speed increases by 5, and you gain a climbing speed and a swimming speed equal to your walking speed.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Connecting Mark",
    "identity": "Warden",
    "requirements": "Requires Hunter's Mark, Level 3",
    "description": "You can use the magic of your hunters mark to track your quarry over extraordinary distances. As long as your marked target is on the same plane as you and is not hidden from Divination magic, you can sense the direction of your marked target.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Hunter Conclave Spells",
    "identity": "Warden",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Conclave Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Primal Spells for you.",
    "1stLevelSpells": "Ensnaring Strike, Unnoticeable",
    "2ndLevelSpells": "Cordon of Arrows, Locate Animals or Plants",
    "3rdLevelSpells": "Conjure Barrage, Slow",
    "4thLevelSpells": "Dominate Beast, Spectral Hound",
    "5thLevelSpells": "Steel Wind Strike, Swift Quiver"
  },
  {
    "name": "Novice Hunter - Focus",
    "identity": "Warden",
    "requirements": "Requires Hunter's Mark",
    "description": "Once per turn when you hit an enemy marked by your Hunter's mark with an attack, you can add an additional Hunter's Mark dice to the damage roll of the attack.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Hunter - Surrounded",
    "identity": "Warden",
    "requirements": "Requires Novice Hunter - Focus, Level 5",
    "description": "When you spend an action to mark an enemy with your Hunter's Mark, you can mark a second enemy as part of the same action.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Hunter - Hunter's Defense",
    "identity": "Warden",
    "requirements": "Requires Novice Hunter - Surrounded, Level 5",
    "description": "You gain the following benefits\n\n- You have advantage on saving throws against being frightened. \n\n- Opportunity attacks against you are made with disadvantage\n\nYou can use your reaction to give yourself advantage on a Reflex Saving Throw\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Fade Walker Conclave Spells",
    "identity": "Warden",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Conclave Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Primal Spells for you.",
    "1stLevelSpells": "Protection from the Unnatural, Zephyr Strike",
    "2ndLevelSpells": "Invisibility, See Invisibility",
    "3rdLevelSpells": "Blink, Clairvoyance",
    "4thLevelSpells": "Banishment, Dimension Door",
    "5thLevelSpells": "Banishing Strike, Teleportation Circle"
  },
  {
    "name": "Novice Fade Walker - Fade Wound",
    "identity": "Warden",
    "requirements": "Requires Hunter's Mark",
    "description": "Whenever you mark an enemy with your Hunter's Mark, you mark them in the ethereal plane as well. Each of your attacks against this target is converted into Arcane damage, and once per round you can do an additional dice of your hunter's mark damage to this target.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Fade Walker - Step Out and In",
    "identity": "Warden",
    "requirements": "Requires Novice Fade Walker - Fade Wound, Level 3",
    "description": "As an action, you can cast the spell Etherealness without expending a spell charge. This spell ends at the end of your next turn, unless you will it to end early.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Fade Walker - Fade Strikes",
    "identity": "Warden",
    "requirements": "Requires Advanced Fade Walker - Step Out and In, Level 7",
    "description": "When you use the attack action, you can teleport up to 15 feet directly before each attack to an unoccupied space that you can see. If you attack two different targets with separate attacks, you can make a 3rd attack as a free action and without suffering the multiattack penalty, provided it targets a different enemy than the first two attacks.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Night Stalker Conclave Spells",
    "identity": "Warden",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Conclave Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Primal Spells for you.",
    "1stLevelSpells": "Disguise Self, Muffle",
    "2ndLevelSpells": "Darkness, Misty Step",
    "3rdLevelSpells": "Nondetection, Haste",
    "4thLevelSpells": "Greater Invisibility, Spectral Hound",
    "5thLevelSpells": "Seeming, Hold Monster"
  },
  {
    "name": "Novice Night Stalker - One With The Dark",
    "identity": "Warden",
    "requirements": "Requires Wisdom 14",
    "description": "You have magical darkvision to a range of 60 feet, and are invisible to other creatures relying on darkvision or low-light vision to see.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Night Stalker - Bring The Dark",
    "identity": "Warden",
    "requirements": "Requires Novice Night Stalker - One With The Dark, Level 3",
    "description": "As an action, you can turn yourself invisible until the end of your next turn. This invisibility ends early if you cast a spell, make an attack, or otherwise engage in a hostile activity.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Night Stalker - Always Elusive",
    "identity": "Warden",
    "requirements": "Requires Advanced Night Stalker - Bring The Dark, Level 7",
    "description": "Whenever a creature makes an attack against you and doesn't have advantage, you can use your reaction to force the creature to make that attack with disadvantage.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Drakewarden Conclave Spells",
    "identity": "Warden",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Conclave Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Primal Spells for you.",
    "1stLevelSpells": "Absorb Elements, Beast Bond",
    "2ndLevelSpells": "Beast Sense, Dragon's Breath",
    "3rdLevelSpells": "Flame Arrows, Protection from Energy",
    "4thLevelSpells": "Locate Creature, Dominate Beast",
    "5thLevelSpells": "Awaken, Immolation"
  },
  {
    "name": "Novice Drakewarden - Dragonling",
    "identity": "Warden",
    "requirements": "Requires Wisdom 14",
    "description": "You have guardianship over a tiny dragon familiar that is bound to you. This dragon acts in the same way as a familiar summoned by the find familiar spell, except it is of the type: dragon, its size is tiny, and it cannot be shunted away into a pocket dimension. Your dragon speaks and understands Draconic, and your bond with this dragon allows you to do so as well, if you couldn't already.\n\nIf you opt to take the Beast Companion feature as part of your Wildling's choice, your dragon grows into a young companion, and you gain access to the following form for your animal companion:\n\nDrake\n\n+1 Str\n\n+1 Dex\n\n+4 Int\n\nHealth: Your Level * (Con + 6)\n\nLand Speed: 30\n\nFly Speed: 30\n\nDefense 13 + Dex Modifier + level\n\nArmor: (level/2)\n\nImmune to damage of its same element\n\nMelee attack: Bite, Str + level to hit, 1d6 + Str slashing damage + INT damage of its element",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Drakewarden - Dragon's Breath",
    "identity": "Warden",
    "requirements": "Requires Novice Drakewarden - Dragonling, Animal Companion, Level 3",
    "description": "Your companion gains access to the following ability if it is Mature or older. This ability is in addition to the companion abilities normally granted by their progression.\n\nElemental Breath - 2 Actions - Your companion breathes its element in a 20 foot cone, forcing each creature in the area to make a Fortitude save against your Ability DC or suffer 6d6 damage of that element. Creatures who succeed on the saving throw take half damage.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Drakewarden - Elemental Bond",
    "identity": "Warden",
    "requirements": "Requires Advanced Drakewarden - Dragon's Breath, Level 7",
    "description": "Whenever you or the drake takes damage of an elemental type, the drake can spend their reaction to grant you or themselves resistance to that damage until the end of the round.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Fighting Style",
    "identity": "Warrior, Warden, Champion",
    "requirements": "Requires Strength 14 or Dexterity 14",
    "description": "You gain a fighting style from the list. You can take this feat up to twice.\n\nYou cannot take it a second time until 5th level or higher.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Maneuver Master",
    "identity": "Warrior, Warden, Champion, Barbarian",
    "requirements": "Requires Strength 14 or Dexterity 14",
    "description": "You learn an additional Ability Feature. You can take this feature as many times as you desire.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Indomitable",
    "identity": "Warrior",
    "requirements": "Requires Constitution 16",
    "description": "When you fail a saving throw, you can choose to succeed instead. You can take this feat a second time at level 5 or higher, and a 3rd time at level 8 or higher",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Improved Critical",
    "identity": "Warrior, Warden, Champion, Barbarian",
    "requirements": "Requires Level 3",
    "description": "Your critical threshold decreases by 1",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Superior Critical",
    "identity": "Warrior",
    "requirements": "Requires Improved Critical, Level 7",
    "description": "Your critical threshold decreases by 1",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Survivor",
    "identity": "Warrior",
    "requirements": "Requires Level 9",
    "description": "At the start of each of your turns, if you have no more than half of your hit points left, you regain hit points equal to 5 + your Constitution modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Arcane Archer - Arcane Shot",
    "identity": "Warrior",
    "requirements": "Requires Dexterity 14",
    "description": "You learn how to infuse your arrows with magical energy. You learn the Prestidigitation or Druidcraft cantrip.\n\nAdditionally, you learn two of the Arcane Shot options from the Arcane Shot Options List. You can use your Arcane Shot ability a number of times equal to your Intelligence modifier. \n\nYou regain all expended uses of this ability at the end of each Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Arcane Archer - Curved Shot",
    "identity": "Warrior",
    "requirements": "Requires Novice Arcane Archer - Arcane Shot, Level 3",
    "description": "You learn how to direct an errant arrow toward a new target. When you make an attack roll with a magic arrow and miss, you can use a bonus action to reroll the attack roll against a different target within 60 feet of the original target.\n\nAdditionally, you learn another Arcane Shot option from the Arcane Shot Options List.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Arcane Archer - Empowered Shot",
    "identity": "Warrior",
    "requirements": "Requires Advanced Arcane Archer - Curved Shot, Level 7",
    "description": "You learn three more Arcane Shot options from the Arcane Shot Options List. Each of your Arcane Shots is now Empowered.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Cavalier - Mounted Warrior",
    "identity": "Warrior",
    "requirements": "Requires Wisdom 14",
    "description": "You gain a skill increase in one of the following skills: Animal Handling, History, Insight, Performance, or Persuasion.\n\nAdditionally, you have advantage on saving throws made to avoid falling off your mount. If you fall off your mount and aren't airborne, you can land on your feet if you're not incapacitated.\n\nFinally, mounting or dismounting a creature doesn't cost you an action if you do so as part of a Stride Action. If you spend an action to mount a creature, you can command your mount to Stride as part of that action.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Cavalier - Warding Mark",
    "identity": "Warrior",
    "requirements": "Requires Novice Cavalier - Mounted Warrior, Level 3",
    "description": "When you hit a creature with a melee weapon attack, you can mark the creature until the end of your next turn. This effect ends early if you are incapacitated or you die, or if someone else marks the creature.\n\nWhile it is within 5 feet of you, a creature marked by you has disadvantage on any attack roll that doesn't target you (including your mount).\n\nIn addition, if a creature marked by you deals damage to anyone other than you, you can make a special melee weapon attack against the marked creature as a reaction. You have advantage on the attack roll, and if it hits, the attack's weapon deals extra damage to the target equal to your level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Cavalier - Run Them Down",
    "identity": "Warrior",
    "requirements": "Requires Novice Cavalier - Mounted Warrior, Level 3",
    "description": "You can run down your foes, whether you're mounted or not. If you move at least 10 feet in a straight line right before attacking a creature and you hit it with the attack, that target must succeed on a Fortitude saving throw against your Ability DC or be knocked prone. You can use this feature only once on each of your turns.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Novice Samurai - Fighting Spirit",
    "identity": "Warrior",
    "requirements": "Requires Constitution 14",
    "description": "You gain a skill increase in one of the following skills: History, Insight, Performance, or Persuasion. Alternatively, you learn two languages of your choice. Additionally, you gain the following action:\n\nFighting Spirit: As an action, you can give yourself advantage on all weapon attack rolls until the end of the current turn. When you do so, you also gain 5 temporary hit points. The number of hit points increases when you reach certain levels in this class, increasing to 10 at 4th level and 15 at 8th level.\n\nYou can use this ability a number of times equal to _ your Constitution Modifier. You regain all expended uses of it when you finish a Rest",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Samurai - Perceptive Discipline",
    "identity": "Warrior",
    "requirements": "Requires Novice Samurai - Fighting Spirit, Level 3",
    "description": "Your discipline and attention to detail allow you to excel in social situations. Whenever you make a Persuasion, Deception, or Society check, you gain a bonus to the check equal to your Wisdom modifier.\n\nWhen you roll initiative and have no uses of Fighting Spirit remaining, you regain one use.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Samurai - Delayed Defeat",
    "identity": "Warrior",
    "requirements": "Requires Advanced Samurai - Perceptive Discipline, Level 7",
    "description": "If you take damage that reduces you to 0 hit points, you can use your reaction to delay falling unconscious, and you take an extra turn immediately after the current one. While you have 0 hit points during that extra turn, taking damage causes death saving throw failures as normal, and three death saving throw failures can still kill you. When the extra turn ends, you fall unconscious if you still have 0 hit points.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Wildling Spellcasting Increase",
    "identity": "Wildling",
    "requirements": "Requires Wildling Spellcasting",
    "description": "Your spellcasting level increases by 1. You can take this perk multiple times, and each time you do so your spellcasting level increases by 1. You may not take this perk if it would cause your spellcasting level to be higher than your character level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Fey Companion",
    "identity": "Wildling, Warden",
    "requirements": "Requires Charisma 14 or Wisdom 14",
    "description": "You gain a Familiar Companion without having to cast the Find Familiar spell. Its type is Fey, and it can change its shape as will. If it should perish, you can touch it and expend a spell charge of 1st level or higher to return it to full hit points.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Beast Spells",
    "identity": "Wildling",
    "requirements": "Requires Shapechange, Level 5",
    "description": "You can cast spells while shapechanged.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Nature's Sanctuary",
    "identity": "Wildling",
    "requirements": "Requires Level 3",
    "description": "Beasts, plant creatures, and other natural creatures are hesitant to attack you. Whenever one of these beings targets you with an attack or forces you to make a saving throw(single target only), they must first make a Will save against your Ability DC. On a successful save the creature is immune to this effect for 24 hours. On a failed save the creature must select a new target or lose the attack or effect.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Pest Form",
    "identity": "Wildling",
    "requirements": "Requires Shapechange",
    "description": "You can use your wildshape to turn into a small or tiny sized creature. This creature can take whatever form you desire, so long as it does not have any combat statistics. While in this form your maximum hit points are reduced to equal your level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Empowered Form",
    "identity": "Wildling",
    "requirements": "Requires Level 3, Shapechange",
    "description": "While shapechanged, your form's melee attacks deal double their base damage dice with each attack. Additionally, when you choose the Brute or Ambusher form, you can select two abilities rather than 1.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Monstrous Form",
    "identity": "Wildling",
    "requirements": "Shapechange, Level 6",
    "description": "Whenever you shapechange, you can expend two uses of your ability to assume the Monstrosity form instead of the Brute or Ambusher form.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Primal Regeneration",
    "identity": "Wildling",
    "requirements": "Requires Shapechange, Spellcasting",
    "description": "While you are shapechanged, you can expend a spell charge to regain hit points equal to 2d8 * the level of the charge expended.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Verdant Weapon",
    "identity": "Wildling, Warden",
    "requirements": "Requires Trained in Nature",
    "description": "You cultivate a living branch that grows and shapes itself into a weapon of your choice. You can use an action to change this weapon's shape into that of any simple melee weapon. When not in combat, your weapon takes the shape of a simple walking stick. This weapon can be used as a Primal spellcasting focus.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Shaman Conclave Spells",
    "identity": "Wildling",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Conclave Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Primal Spells for you.",
    "1stLevelSpells": "Bless, Speak with Animals",
    "2ndLevelSpells": "Hold Person, Pass Without Trace",
    "3rdLevelSpells": "Dispel Magic, Magic Circle",
    "4thLevelSpells": "Arcane Eye, Divination",
    "5thLevelSpells": "Commune, Commune with Nature"
  },
  {
    "name": "Novice Shaman - Mistwalker",
    "identity": "Wildling",
    "requirements": "Requires Trained in Nature",
    "description": "You can use an action to disappear into mist and teleport up to 60 feet away to an unoccupied space you can see. You can use this ability once per day.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Shaman - Elemental Protection",
    "identity": "Wildling",
    "requirements": "Requires Novice Shaman - Mistwalker, Level 3",
    "description": "When you or an ally you can see within 30 feet is damaged by an elemental damage type, you can use your reaction to grant them (or yourself) resistance to that instance of that damage type.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Shaman - Protected by Nature",
    "identity": "Wildling",
    "requirements": "Requires Advanced Shaman - Elemental Protection, Level 7",
    "description": "When you are attacked by a natural creature, fey, elemental, or dragon, that creature must succeed on a Will saving throw against your Ability DC or be forced to change the target of its attack to a different target or the attack automatically misses.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Storm Speaker Conclave Spells",
    "identity": "Wildling",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Conclave Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Primal Spells for you.",
    "1stLevelSpells": "Fog Cloud, Rainfall",
    "2ndLevelSpells": "Shatter, Warding Wind",
    "3rdLevelSpells": "Call Lightning, Wind Wall",
    "4thLevelSpells": "Ice Storm, Storm Sphere",
    "5thLevelSpells": "Dawn, Maelstrom"
  },
  {
    "name": "Novice Storm Speaker - Fogling",
    "identity": "Wildling",
    "requirements": "Requires Trained in Nature",
    "description": "You are unaffected by weather effects that obscure your vision or cause hazardous terrain. (for example fog cloud, or Rainfall)",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Storm Speaker - Stormcaller",
    "identity": "Wildling",
    "requirements": "Requires Novice Storm Speaker - Fogling, Level 3",
    "description": "When you cast the spell call lightning, you can use two actions to both summon a lightning bolt and sustain the spell.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert Storm Speaker - Storm Unbound",
    "identity": "Wildling",
    "requirements": "Requires Advanced Storm Speaker - Stormcaller, Level 7",
    "description": "You can cast the spell Firestorm once per day without expending spell charges or spell points, and do not need to have the spell prepared to do so.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Swarmkeeper Conclave Spells",
    "identity": "Wildling",
    "requirements": "Requires Spellcasting",
    "description": "At each of the spellcasting levels listed on the Conclave Spells chart below, you learn the spells listed. These spells are always prepared for you (if you are a caster that prepares spells), and do not count against the number of spells you can prepare each day. These spells are Primal Spells for you.",
    "1stLevelSpells": "Find Familiar, Speak with Animals",
    "2ndLevelSpells": "Animal Messenger, Summon Beast",
    "3rdLevelSpells": "Haste, Summon Fey",
    "4thLevelSpells": "Dominate Beast, Charm Monster",
    "5thLevelSpells": "Awaken, Hold Monster"
  },
  {
    "name": "Novice Swarmkeeper - Swarm",
    "identity": "Wildling",
    "requirements": "Requires Trained in Nature",
    "description": "You have a swarm of tiny beasts or fey spirits that are constantly about your person. Once per round when you make an attack against an enemy, you can command the swarm as a free action to:\n\n- Deal 1d4 slashing, piercing, or bludgeoning damage to your target (chosen when your swarm type is chosen) (only after you successfully hit an enemy with an attack)\n\n- The attack's target must succeed on a Fortitude saving throw against your Ability DC or be moved by the swarm up to 15 feet horizontally in a direction of your choice (only after you successfully hit an enemy with an attack).\n\nYou are moved by the swarm 5 feet horizontally in a direction of your choice. If this movement would provoke an attack of opportunity, the attack is made with disadvantage.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Advanced Swarmkeeper - Defensive Swarm",
    "identity": "Wildling",
    "requirements": "Requires Novice Swarmkeeper - Swarm, Level 3",
    "description": "The swarm's strength increases, increasing its damage to 1d8. Additionally, if a creature fails its saving throw against being moved by the swarm you force the creature to be knocked prone instead.\n\nYou also gain the following swarm option:\n\n- You can cause the swarm to take up a defensive shroud around you, granting you half-cover until the beginning of your next turn.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Expert - Massive Swarm",
    "identity": "Wildling",
    "requirements": "Requires Advanced Swarmkeeper - Defensive Swarm, Level 7",
    "description": "Your swarm has grown massive, allowing you to be completely hidden for brief periods. Its damage increases to 2d6, and when you command your swarm to grant you cover, you are now granted 3/4 cover until the start of your next turn.\n\nYou also gain the following ability: you can use your reaction to grant yourself resistance to a single instance of damage, dispersing it throughout your swarm instead",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Pact Boon - Bound Blade",
    "identity": "Patron-Sworn",
    "requirements": "Requires a binding pact with a powerful Patron, Charisma 14",
    "description": "Bound Blade\n\n-- You can use an action to create a bound weapon in your empty hand. You can choose the form that this melee weapon takes each time you create it. You are proficient with it while you wield it. This weapon counts as magical for the purpose of overcoming resistances.\n\n-- Your bound weapon disappears if it is more than 5 feet away from you for 1 minute or more. It also disappears if you use this feature again, if you dismiss the weapon (no action required), or if you die.\n\n-- You can transform one magic weapon into your pact weapon by performing a special ritual while you hold the weapon. You perform the ritual over the course of 1 hour, which can be done during a short rest.\n\n-- You can then dismiss the weapon, shunting it into an extradimensional space, and it appears whenever you create your pact weapon thereafter. You can't affect an artifact or a sentient weapon in this way. The weapon ceases being your pact weapon if you die, if you perform the 1-hour ritual on a different weapon, or if you use a 1-hour ritual to break your bond to it. The weapon appears at your feet if it is in the extradimensional space when the bond breaks.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Pact Boon - Grimoire",
    "identity": "Patron-Sworn",
    "requirements": "Requires a binding pact with a powerful Patron, Charisma 14",
    "description": "Grimoire\n\n-- Your patron gives you a grimoire called a Book of Shadows. When you gain this feature, choose three cantrips from any spell list (they don't have to be the same list). While the book is on your person, you can cast those cantrips at will. Charisma is your spellcasting modifier for these spells, and they are considered Arcane spells for you. \n\n-- If you lose your Book of Shadows, you can perform a 1-hour ceremony to receive a replacement from your patron. This ceremony can be performed during a short or long rest, and it destroys the previous book. The book turns to ash when you die.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Pact Boon - Chain",
    "identity": "Patron-Sworn",
    "requirements": "Requires a binding pact with a powerful Patron, Charisma 14",
    "description": "Chain\n\n-- You learn the Find Familiar spell and can cast it without expending any spell charges or spell points.\n\n-- Your familiar can change its shape at will, and is not limited to beast shapes like other familiars..\n\n-- Additionally, whenever you cast a spell, you can choose to have the spell originate from you or from your familiar.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Gifted Spellcasting",
    "identity": "Patron-Sworn",
    "requirements": "Requires a binding pact with a powerful Patron, Charisma 14",
    "description": "Choose a spell list associated with your Patron (Arcane, Divine, Primal). You become a 1st level Pact Spellcaster. This spellcasting level is NOT cumulative with any other spellcasting level types or increases. \n\nEach day, you have a number of castings of these spells equal to your Charisma Modifier (total, not per spell). When you cast one of these spells, it is automatically upcast to the level specified on the Spells Cast at Level column on the Pact spellcasting chart.\n\nEach time you take this Feature, your Pact Spellcasting ability increases by 1 level, and you learn new spells as shown on the Spells Known column of the Pact Spellcasting chart. These spells can be of any level up to your spellcasting level (a 2nd level pact spellcaster can know 1st and 2nd level spells).",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Ancient One Pact - Awakened Mind",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with an Ancient One",
    "description": "Your alien knowledge gives you the ability to touch the minds of other creatures. You can communicate telepathically with any creature you can see within 30 feet of you. You don't need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Ancient One Pact - Entropic Ward",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with an Ancient One",
    "description": "You learn to magically ward yourself against attack and to turn an enemy's failed strike into good luck for yourself. When a creature makes an attack roll against you, you can use your reaction to impose disadvantage on that roll. If the attack misses you, your next attack roll against the creature has advantage if you make it before the end of your next turn.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Ancient One Pact - Thought Shield",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with an Ancient One",
    "description": "Your thoughts can't be read by telepathy or other means unless you allow it. You also have resistance to psychic damage, and whenever a creature deals psychic damage to you, that creature takes the same amount of damage that you do.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Ancient One Pact - Create Thrall",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with an Ancient One, Level 7",
    "description": "You gain the ability to infect a humanoid's mind with the alien magic of your patron. You can use your action to touch an incapacitated humanoid. That creature is then charmed by you until a Remove Curse spell is cast on it, the charmed condition is removed from it, or you use this feature again.\n\nYou can communicate telepathically with the charmed creature as long as the two of you are on the same plane of existence.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Celestial Pact - Light Bringer",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Celestial",
    "description": "You learn the Light and Sacred Flame, and Divine Lance cantrips.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Celestial Pact - Healing Light",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Celestial",
    "description": "You have a pool of d6s that you spend to fuel this healing. The number of dice in the pool equals your level.\n\nAs an action, you can heal one creature you can see within 30 feet of you, spending dice from the pool. The maximum number of dice you can spend at once equals your Charisma modifier (minimum of one die). Roll the dice you spend, add them together, and restore a number of hit points equal to the total.\n\nYour pool regains all expended dice when you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Celestial Pact - Radiant Soul",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Celestial",
    "description": "Your link to the Celestial allows you to serve as a conduit for radiant energy. You have resistance to Light damage, and when you cast a spell that deals Light or Fire damage, you add your (Charisma or Intelligence) modifier to one Light or Fire damage roll of that spell against one of its targets.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Celestial Pact - Celestial Resistance",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Celestial",
    "description": "You gain temporary hit points whenever you finish a Rest. These temporary hit points equal your level + your Charisma Modifier. Additionally, choose up to five creatures you can see at the end of the rest. Those creatures each gain temporary hit points equal to half your level + your Charisma modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Celestial Pact - Searing Vengeance",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Celestial, Level 7",
    "description": "When you have to make a death saving throw at the start of your turn, you can instead spring back to your feet with a burst of radiant energy. You regain hit points equal to half your hit point maximum, and then you stand up if you so choose. Each creature of your choice that is within 30 feet of you takes Light damage equal to 2d8 + your Charisma modifier, and is blinded until the end of the current turn.\n\nOnce you use this feature, you can't use it again until you finish a long rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Demonic Pact - Dark One's Hunger",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Demon",
    "description": "When you reduce a hostile creature to 0 hit points, you gain temporary hit points equal to your Charisma Modifier + your level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Demonic Pact - Dark One's Blessing",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Demon",
    "description": "You can call on your patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add a d10 to your roll. You can do so after seeing the initial roll but before any of the roll's effects occur.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Demonic Pact - Fiendish Resilience",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Demon",
    "description": "You can choose one damage type when you finish a Rest. You gain resistance to that damage type until you choose a different one with this feature. Damage from magical weapons or silver weapons ignores this resistance.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Demonic Pact - Hurl Through Hell",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Demon, Level 7",
    "description": "When you hit a creature with an attack, you can use this feature to instantly transport the target through the lower planes. The creature disappears and hurtles through a nightmare landscape.\n\nAt the end of your next turn, the target returns to the space it previously occupied, or the nearest unoccupied space. If the target is not a fiend, it takes 10d10 psychic damage as it reels from its horrific experience.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Fey pact - Fey Presence",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Fey",
    "description": "Your patron bestows upon you the ability to project the beguiling and fearsome presence of the fey. As an action, you can cause each creature in a 10-foot cube originating from you to make a Will saving throw against your ability DC. The creatures that fail their saving throws are all charmed or frightened by you (your choice) until the end of your next turn.\n\nOnce you use this feature, you can't use it again until you finish a Rest.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Fey pact - Misty Escape",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Fey",
    "description": "You can vanish in a puff of mist in response to harm. When you take damage, you can use your reaction to turn invisible and teleport up to 60 feet to an unoccupied space you can see. You remain invisible until the end of your next turn or until you take a hostile action.\n\nOnce you use this feature, you can't use it again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Fey pact - Beguiling Defenses",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Fey",
    "description": "Your patron teaches you how to turn the mind-affecting magic of your enemies against them. You are immune to being charmed, and when another creature attempts to charm you, you can use your reaction to attempt to turn the charm back on that creature. The creature must succeed on a Will saving throw against your Ability DC or be charmed by you for 1 minute or until the creature takes any damage.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Fey pact - Dark Delirium",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Fey, Level 7",
    "description": "You can plunge a creature into an illusory realm. As an action, choose a creature that you can see within 60 feet of you. It must make a Will saving throw against your Ability DC. On a failed save, it is charmed or frightened by you (your choice) for 1 minute or until your concentration is broken (as if you are concentrating on a spell). This effect ends early if the creature takes any damage.\n\nUntil this illusion ends, the creature thinks it is lost in a misty realm, the appearance of which you choose. The creature can see and hear only itself, you, and the illusion.\n\nYou must finish a Rest before you can use this feature again.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Hex Pact - Curse",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Profane Being",
    "description": "As an action, choose one creature you can see within 30 feet of you. The target is cursed for 1 minute. The curse ends early if the target dies, you die, or you are incapacitated. Until the curse ends, you gain the following benefits:\n\n- You can add your level to damage rolls against your cursed target.\n\n- Your critical threshold is decreased by 1 against this target\n\n- If the cursed target dies, you regain hit points equal to your Charisma modifier.\n\nYou can use this ability once per day.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Hex Pact - Hex Warrior",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Profane Being, Pact Boon - Bound Blade",
    "description": "You gain proficiency with medium armor, shields, and martial weapons.\n\nWhen you attack an enemy with your bound weapon, you can use your Charisma modifier for the attack and damage rolls.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Hex Pact - Cursed Soul",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Profane Being, Hex Pact - Curse",
    "description": "When a humanoid you have cursed dies, you can cause its spirit to rise from its corpse as a specter. When the specter appears, it gains temporary hit points equal to your level. Roll initiative for the specter, which has its own turns.\n\nIt obeys your verbal commands (no actions needed), and has the following statistics: 25 hit points, defense 15, 50 foot fly speed, and has saving throws equal to your level. It has the following attack: 2 Actions - Your Charisma + your level to hit, on hit 3d6 Dark damage and the target must make a Fortitude saving throw or have its max hit points reduced by the damage taken until their next Rest.\n\nThe specter remains in your service until the end of your next Rest at which point it vanishes to the afterlife. Once you bind a specter with this feature, you can't use the feature again until you finish a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Hex Pact - Defensive Hex",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Profane Being, Hex Pact - Curse",
    "description": "If the target cursed by your Hexblade's Curse hits you with an attack roll, roll a d6. On a 4 or higher, the attack instead misses you, regardless of its roll.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Hex Pact - Curse Transfer",
    "identity": "Patron-Sworn",
    "requirements": "Requires a Pact with a Profane Being, Hex Pact - Curse, Level 5",
    "description": "You can spread your Curse from a slain creature to another creature. When the creature cursed by your Curse dies, you can apply the curse to a different creature you can see within 30 feet of you, provided you aren't incapacitated.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Cantrip Master",
    "identity": "Spellcasting",
    "requirements": "Requires Spellcasting",
    "description": "You learn two cantrips from a single spell list of your choice. If you already have proficiency in a type of spell, you can use the same spellcasting modifier. If you do not have proficiency in a type of spells, your casting modifier is either Intelligence, Charisma, or Wisdom (your choice). You are proficient in the casting of these Cantrips, but are not granted proficiency in other spells from the chosen spell list.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Arcane Spellcasting",
    "identity": "Spellcasting",
    "requirements": "Requires Intelligence 14 or Charisma 14",
    "description": "You gain the ability to cast Arcane spells using a spellcasting focus, staff, or wand. Intelligence or Charisma (your choice) is your spellcasting modifier for spells of this type and you are proficient in the casting of these spells. If you are already proficient in spellcasting, you can use the same casting modifier for these spells.\n\nYou learn 4 Spells from the Arcane spell list. You have a number of spell charges as shown below on the Universal Spell Charge chart.\n\nYou can take this ability multiple times. Each time after the first your spellcasting ability increases by 1 level, and you learn three additional Arcane spells. You cannot take this feature if it would increase your spellcasting ability to a level higher than your character level, or if you gained Arcane Spellcasting as part of your Core Identity.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Divine Spellcasting",
    "identity": "Spellcasting",
    "requirements": "Requires Charisma 14 or Wisdom 14",
    "description": "You gain the ability to cast Divine spells using a holy symbol, emblazoned shield, banner, or wand. Wisdom or Charisma (your choice) is your spellcasting modifier for spells of this type and you are proficient in the casting of these spells. If you are already proficient in spellcasting, you can use the same casting modifier for these spells.\n\nYou learn 4 Spells from the Divine spell list. You have a number of spell charges as shown below on the Universal Spell Charge chart.\n\nYou can take this ability multiple times. Each time after the first your spellcasting ability increases by 1 level, and you learn three additional Divine spells. You cannot take this feature if it would increase your spellcasting ability to a level higher than your character level, or if you gained Divine Spellcasting as part of your Core Identity.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Primal Spellcasting",
    "identity": "Spellcasting",
    "requirements": "Requires Intelligence 14 or Wisdom 14",
    "description": "You gain the ability to cast Primal spells using a totem, natural focus, staff, or wand. Wisdom or Intelligence (your choice) is your spellcasting modifier for spells of this type and you are proficient in the casting of these spells. If you are already proficient in spellcasting, you can use the same casting modifier for these spells.\n\nYou learn 4 Spells from the Primal spell list. You have a number of spell charges as shown below on the Universal Spell Charge chart.\n\nYou can take this ability multiple times. Each time after the first your spellcasting ability increases by 1 level, and you learn three additional Primal spells. You cannot take this feature if it would increase your spellcasting ability to a level higher than your character level, or if you gained Primal Spellcasting as part of your Core Identity.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Innate Spellcasting",
    "identity": "Spellcasting",
    "requirements": "Requires Charisma 14 or Constitution 14",
    "description": "You gain the ability to cast Arcane spells (or the type of spells granted by your Bloodline feature) using a staff, wand, or other focus. Charisma or Constitution (your choice) is your spellcasting modifier for spells of this type and you are proficient in the casting of these spells. If you are already proficient in spellcasting, you can use the same casting modifier for these spells.\n\nYou learn 4 Spells from the Arcane spell list (Unless you have the bloodline feature, in which case you learn spells from the listed granted by that feature). You have a number of spell points as shown below on the Universal Spell Points chart.\n\nYou can take this ability up to 5 times total. Each time after the first your spellcasting ability increases by 1 level, and you learn three additional Arcane spells. You cannot take this feature if it would increase your spellcasting ability to a level higher than your character level, or if you gained Arcane or Innate Spellcasting as part of your Core Identity.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Athlete",
    "identity": "General",
    "requirements": "Requires Strength 14 or Dexterity 14",
    "description": "Increase your Strength or Dexterity by 1.\n\nWhen you are prone, you can stand up as part of a stride action, standing up costs you 5 feet of movement.\n\nYou gain a climbing and swimming speed of 15 feet. If you already have one of these speeds, it increases by 10 feet.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Actor",
    "identity": "General",
    "requirements": "Requires Charisma 14",
    "description": "Increase your Charisma by 1.\n\nYou have advantage of Charisma (Deception) and Charisma (Performance) checks to pass yourself off as someone else.\n\nYou can mimic the speech of another person or the sounds made by other creatures. You must have heard the speech or sound for at least 1 minute. A successful Wisdom (Insight) check contested by your Charisma (Deception) check allows a listener to determine the effect is faked.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Trap Expert",
    "identity": "General",
    "requirements": "Requires Wisdom 14 or Intelligence 14",
    "description": "Increase your Wisdom or Intelligence by 1.\n\nYou have advantage on Perception checks and Investigation checks made to detect the presence of secret doors.\n\nYou have advantage on saving throws made to avoid or resist traps.\n\nYou have resistance to damage dealt by traps.\n\nYou can search for traps while traveling at a normal pace.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Inspiring Leader",
    "identity": "General",
    "requirements": "Requires Charisma 14",
    "description": "Increase your Charisma by 1.\n\nYou can spend 10 minutes inspiring your companions, shoring up their will to fight. When you do so, choose up to six friendly creatures (which can include yourself) within 30 feet of you that can see or hear you and can understand you. Each creature gains temporary hit points equal to your level + your Charisma modifier. A creature can't gain temporary hit points in this way again until they finish a rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Keen Mind",
    "identity": "General",
    "requirements": "Requires Intelligence 14",
    "description": "Increase your Intelligence by 1.\n\nYou always know which way is north.\n\nYou always know how the number of hours left before the next sunrise or sunset.\n\nYou can accurately recall anything you have seen or heard within the past month.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Linguist",
    "identity": "General",
    "requirements": "Requires Intelligence 14",
    "description": "Increase your Intelligence by 1.\n\nYou learn three languages of your choice.\n\nYou can easily create written ciphers. Others cannot decipher a code you create unless you teach it to them, they succeed on an Intelligence check (DC = your Intelligence score + your level + 10), or they use magic to decipher it.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Observant",
    "identity": "General",
    "requirements": "Requires Wisdom 14 or Intelligence 14",
    "description": "Increase your Intelligence or Wisdom by 1.\n\nIf you can see a creature's mouth while it is speaking a language you understand, you can interpret their words by reading their lips.\n\nYou have advantage on all Perception and Investigation checks relating to observing details.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Skilled",
    "identity": "General",
    "requirements": "Requires Intelligence 14",
    "description": "Increase your Intelligence by 1.\n\nYou gain 3 skill increases, and if your intelligence is 19 or greater: one additional skill increase.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Skulker",
    "identity": "General",
    "requirements": "Requires Dexterity 14",
    "description": "Increase your Dexterity by 1.\n\nYou can try to hide when you are only lightly obscured from the creature from which you are hiding.\n\nWhen you are hidden from a creature and miss it with a ranged weapon attack, making the attack doesn't reveal your position.\n\nDim light doesn't impose disadvantage on Wisdom (Perception) bonuses made with sight.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Tough",
    "identity": "General",
    "requirements": "Requires Strength 14 or Constitution 14",
    "description": "Increase your Strength or Constitution by 1\n\nIncrease your hit points by an amount equal to 2 * your current level\n\nEach time you gain a level, you gain two additional hit points.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Archer",
    "identity": "Combat",
    "requirements": "Requires Dexterity 14",
    "description": "Increase your Dexterity by 1.\n\nAttacking at any range up to your weapon's maximum doesn't impose disadvantage on your ranged weapon attack rolls.\n\nYour ranged weapons ignore half cover and three-quarters cover.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Bludgeoning Specialist",
    "identity": "Combat",
    "requirements": "Requires Strength 14",
    "description": "Increase your Strength by 1.\n\nWhen you make an attack roll with a weapon that deals bludgeoning damage and you miss, but would have hit the target using their Touch defense, the target takes damage equal to your Strength Modifier.\n\nWhen you score a critical hit with a weapon that deals bludgeoning damage, if the target is a Large-sized creature or smaller, it must succeed on a Fortitude saving throw or be knocked prone. The saving throw DC equals 9 + your level + your Strength modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Crossbow Master",
    "identity": "Combat",
    "requirements": "Requires Dexterity 14, Proficiency with Crossbows",
    "description": "Increase your Dexterity by 1.\n\nYou ignore the loading quality of crossbows with which you are proficient.\n\nBeing within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Defensive Duelist",
    "identity": "Combat",
    "requirements": "Requires Dexterity 14",
    "description": "Increase your Dexterity by 1.\n\nWhen you are wielding a finesse weapon you are proficient with in one hand (and no other weapons) and another creature hits you with a melee attack, you can use your reaction to add your Dexterity modifier to your Defense against that attack, potentially causing it to miss.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Dual Wielder",
    "identity": "Combat",
    "requirements": "Requires Dexterity 14",
    "description": "Increase your Dexterity by 1.\n\nWhen wielding a weapon in each hand, you gain a +1 bonus to Defense and you can wield a weapon in each hand, even if the weapons aren't light.\n\nYou can draw or sheath two one-handed weapons when you take the Draw action instead of one.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Elemental Adept",
    "identity": "Combat",
    "requirements": "Requires Spellcasting",
    "description": "Increase your spellcasting ability score by 1.\n\nWhen you gain this feat, choose one of the following damage types: acid, cold, fire, lightning, or thunder. Spells you cast ignore resistance to the chosen type, and whenever you roll damage for a spell that deals damage of the chosen type, treat any rolled 1's as being a 2.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Firearms Apprentice",
    "identity": "Combat",
    "requirements": "Requires Proficiency with Martial Weapons",
    "description": "Increase your Dexterity by 1.\n\nYou gain proficiency with firearms.\n\nYou may cast bullets from scrap or other metal sources as part of a rest (10 per rest)",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Firearms Master",
    "identity": "Combat",
    "requirements": "Requires Proficiency with Firearms",
    "description": "Increase your Dexterity by 1.\n\nYou ignore the loading quality of firearms with which you are proficient.\n\nBeing within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls.\n\nAttacking at any range up to your weapon's maximum doesn't impose disadvantage on your ranged weapon attack rolls.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Great Weapon Momentum",
    "identity": "Combat",
    "requirements": "Requires Proficiency with Martial Weapons",
    "description": "On your turn, when you score a critical hit with a two-handed melee weapon attack or reduce a creature to 0 hit points with one, you can make one melee weapon attack as a reaction. This attack is not subject to the multi-attack penalty.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Mage Slayer",
    "identity": "Combat",
    "requirements": "Requires Strength 14 or Dexterity 14",
    "description": "Increase your Strength or Dexterity by 1.\n\nWhen a creature within your melee reach casts a spell, you can use your reaction to make a melee weapon attack against that creature.\n\nWhen you damage a creature that is concentrating on a spell, they have disadvantage on the saving throw they make to maintain concentration.\n\nYou have advantage on saving throws against spells cast by creatures with your reach.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Mounted Combatant",
    "identity": "Combat",
    "requirements": "",
    "description": "Your Constitution increases by 1.\n\nYou have advantage on melee attack rolls against unmounted creatures that are the same size or smaller than your mount.\n\nYou can force an attack targeted at your mount to target you instead.\n\nIf your mount is subjected to an effect that allows it to make a Reflex save to take only half damage, it takes no damage if it succeeds and half damage if it fails.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Piercing Specialist",
    "identity": "Combat",
    "requirements": "Requires Dexterity 14",
    "description": "Increase your Dexterity by 1.\n\nOnce per turn, when you hit a creature with a weapon attack that deals piercing damage, you can reroll one of the attack's damage dice, and you must use the new roll.\n\nWhen you score a critical hit that deals piercing damage to a creature, you can roll one additional damage die when determining the extra piercing damage the target takes.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Polearm Chargebreaker",
    "identity": "Combat",
    "requirements": "Requires Proficiency with Martial Weapons",
    "description": "While wielding a polearm (glaive, halberd, pike, quarterstaff, spear,trident, etc), other creatures provoke an opportunity attack from you when they enter your reach. Successful hits with this opportunity attack deal double the number of weapon damage dice. This attack cannot gain the benefits of a critical hit.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Savage Attacker",
    "identity": "Combat",
    "requirements": "Requires Proficiency with Martial Weapons",
    "description": "Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon's damage dice and use either total.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Sentinel",
    "identity": "Combat",
    "requirements": "Requires Wisdom 14",
    "description": "Whenever you hit a creature with an opportunity attack, its speed drops to 0 for the rest of the turn. This stops any movement they may have been taking.\n\nCreatures within your reach provoke opportunity attacks even if they were taking the Step action.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Slashing Specialist",
    "identity": "Combat",
    "requirements": "Requires Strength 14 or Dexterity 14",
    "description": "Increase your Strength or Dexterity by 1.\n\nOnce per turn when you hit a creature with an attack that deals slashing damage, you can reduce the speed of the target by 10 feet until the start of your next turn.\n\nWhen you score a critical hit that deals slashing damage to a creature, you grievously wound it. Until the start of your next turn, the target has disadvantage on all attack rolls.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "War Caster",
    "identity": "Combat",
    "requirements": "Requires Spellcasting",
    "description": "You have advantage on Fortitude saves that you make to maintain concentration on a spell when you take damage.\n\nYou can use your weapon as a spellcasting focus for your spells.\n\nWhen a hostile creature's movement provokes an opportunity attack from you, you can use your reaction to cast a spell at the creature, instead of making an opportunity attack. The spell must have a casting time of 1 or 2 actions and must target only that creature.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Shield Master",
    "identity": "Armor",
    "requirements": "Requires Proficiency with Shields",
    "description": "You gain the following benefits while wielding a shield:\n\nIf you aren't incapacitated, you can add your shield's Defense bonus to any Reflex save made against a spell or other effect that affects only you.\n\nIf you are subjected to an effect which allows you to make a Reflex save for half damage, you can use your reaction to take no damage, interposing your shield between you and the effect.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Lightly Armored",
    "identity": "Armor",
    "requirements": "",
    "description": "Increase your Strength or Dexterity by 1.\n\nYou become proficient with light armor and bucklers.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Moderately Armored",
    "identity": "Armor",
    "requirements": "Requires Proficiency with Light Armor",
    "description": "Increase your Strength or Dexterity by 1.\n\nYou become proficient with medium armor and shields.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Heavily Armored",
    "identity": "Armor",
    "requirements": "Requires Proficiency with Medium Armor",
    "description": "Increase your Strength by 1.\n\nYou become proficient with heavy armor and tower shields",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Light Armor Master",
    "identity": "Armor",
    "requirements": "Requires Proficiency with Light Armor",
    "description": "You can wear Light armor under your clothing, concealing it.\n\nWhile wearing Light armor, you can ignore Dexterity caps on your armor.\n\nWhile wearing Light armor, your armor value is increased by 1.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Medium Armor Master",
    "identity": "Armor",
    "requirements": "Requires Proficiency with Medium Armor",
    "description": "Wearing medium armor doesn't impose disadvantage on Dexterity (Stealth) checks.\n\nWhen wearing medium armor, your dexterity cap increases by 1.\n\nWhen wearing medium armor, your armor value is increased by 1.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Heavy Armor Master",
    "identity": "Armor",
    "requirements": "Requires Proficiency with Heavy Armor",
    "description": "Increase your Strength or Constitution by 1 .\n\nWhen wearing heavy armor your armor value is increased by 3.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Rage",
    "identity": "Mutliclass",
    "requirements": "Requires Strength 14 or Constitution 14",
    "description": "As an action, you can unleash the power within yourself and enter a rage. While raging, you gain the following benefits:\n\n- Your armor value is equal to your constitution modifier (if it is higher than your worn armor's value)\n\n- You gain additional damage to your unarmed and melee weapon attack rolls equal to your level with the attack.\n\n- Any additional benefits granted by identity choices\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Inspiration",
    "identity": "Mutliclass",
    "requirements": "Requires Charisma 14",
    "description": "You can inspire others through stirring words or music. To do so, you may use an action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d4.\n\nOnce within the next 10 minutes, the creature can roll the inspiration die and add the number rolled to any d20 roll. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the DM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.\n\nYou can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a rest.\n\nYour Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d6 at 3rd level, a d8 at 5th level, a d10 at 7th level, and a d12 at 9th level.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Smite",
    "identity": "Mutliclass",
    "requirements": "Requires Charisma 14, Spellcasting",
    "description": "When you hit an enemy with a weapon attack, you can expend a spell charge to deal extra damage to that enemy of an elemental type of your choice (chosen at 1st level). This damage is equal to 1d8 + 1d8 per level of the spell charge.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Bloodline",
    "identity": "Mutliclass",
    "requirements": "Requires Constitution 14",
    "description": "You unlock latent power that has been dormant in your blood. Choose one of the Bloodlines from the Empowered Bloodline list, and gain its special ability. If you later take the Innate Spellcasting feature, your bloodline determines the spell list your innate casting grants you access to.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Ki",
    "identity": "Mutliclass",
    "requirements": "Requires Wisdom 14",
    "description": "You have a number of Ki points equal to your Wisdom Modifier + your level. You can use these points to activate special abilities. Your pool of Ki points completely refills at the end of each Rest. At 1st level, you have access to the following abilities:\n\nPatient Defense\n\n-- You can spend 2 ki points to take the Dodge action as a free action on your turn.\n\nStep of the Wind\n\n-- You can spend 1 ki point to take the Stride or Step action as a free action on your turn, and your jump distance is doubled for the turn.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Flurry of Blows",
    "identity": "Mutliclass",
    "requirements": "Requires Dexterity 14",
    "description": "Immediately after you take the Attack action on your turn, you can make two unarmed strikes as a single action. These strikes do not suffer the multi-attack penalty",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Martial Arts Dice",
    "identity": "Mutliclass",
    "requirements": "Requires Dexterity 14 or Strength 14",
    "description": "Your discipline and practice has allowed you to hone your fighting style with certain weapons. Whenever you are wielding a simple weapon or no weapon at all, you can use your Dexterity Modifier in the place of your strength modifier for both attack and damage rolls with that weapon (or your unarmed strike).\n\nAdditionally at level one you gain a dice that can be used in place of any damage die when you make an attack with a simple weapon or unarmed attack. This damage dice is a d4 at level 1, and increases to a d6 at level 3, a d8 at level 5, a d10 at level 7, and a d12 at level 9.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Font of Healing and Harm",
    "identity": "Mutliclass",
    "requirements": "Requires Divine Spellcasting",
    "description": "You have access to a Font of Healing and Harm that you can tap into. This font provides you with a number of casts of the Heal or Harm spell (cast at a level equal to _ your spellcasting level, rounded up) per day equal to your Wisdom Modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Sneak Attack",
    "identity": "Mutliclass",
    "requirements": "Requires Dexterity 14",
    "description": "You are capable of targeting your enemy's weak points to inflict massive damage. When you make an attack roll with a finesse weapon that does slashing or piercing damage against an enemy and you have advantage on the attack, or when an ally is within 5 feet of your target, you can add additional d6s of the same damage type equal to your level. You can use this ability once per turn.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Thieves' Knack",
    "identity": "Mutliclass",
    "requirements": "Requires Intelligence 14",
    "description": "When you make an attempt at a skill check and are Untrained in that skill, you can add +2 to your skill check result.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Arcane Assistance",
    "identity": "Mutliclass",
    "requirements": "Requires Intelligence 14",
    "description": "Whenever you or an ally within 60 feet attempts an attack roll, ability check, or saving throw, you can spend your reaction to magically assist in that attempt, adding your Intelligence modifier to the roll. You can add this bonus after you see the roll, but not after the DM has declared the results of the roll.\n\nYou can use this feature a number of times per day equal to your Intelligence Modifier.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Hunter's Mark",
    "identity": "Mutliclass",
    "requirements": "Requires Wisdom 14",
    "description": "You use an action to mark a target as your prey. Whenever you hit this target with a weapon or unarmed attack, the target suffers an extra 1d4 of damage matching the type of your attack. This damage increases to 1d6 at level 3, 1d8 at level 5, 1d10 at level 7 and 1d12 at level 9.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Action Surge",
    "identity": "Mutliclass",
    "requirements": "Requires Constitution 14",
    "description": "You gain the following ability: You can channel your adrenaline to gain 2 additional actions and an additional reaction. These actions must be used on your current turn, but the extra reaction doesn't expire until the start of your next turn. You can use this ability a number of times equal to your Constitution Modifier. Your uses of this ability recharge each day when you complete a Rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Maneuver Dice",
    "identity": "Mutliclass",
    "requirements": "Requires Dexterity 14 or Strength 14",
    "description": "Many of your abilities granted by the Ability Features you choose will allow you to make a check or roll damage dice. Whenever you use one of these abilities, you can add your Maneuver Dice to the d20 roll for any skill check, or to the attack or damage roll for any attack. You can only use this dice once per action.\n\nThis dice is a d4 at level 1, increases to a d6 at level 3, a d8 at level 5, a d10 at level 7, and a d12 at level 9.\n\n",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Shapechange",
    "identity": "Mutliclass",
    "requirements": "Requires Wisdom 14",
    "description": "As a master of communion with nature, you have learned to change your form into that of a wild beast. You have a number of uses for this ability equal to your Wisdom Modifier (minimum of 1). \n\nAs an action, you magically reshape your form to assume the shape of a beast of your choice, choosing one of the stat blocks at the end of this chapter that best fits the shape you chose (Ambusher or Brute). Your size, mental stats, and skill proficiencies stay the same, but your physical stats and abilities shift to match those of your chosen form. Your form might have bonuses listed that are added to any checks you make that they relate to. The overall appearance of the chosen form is up to you, but its abilities must match one of the provided stat blocks. You remain in this form until you use a free action to will yourself out of it, or until you Rest or are reduced to 0 hit points.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Empowered Upcasting",
    "identity": "Mutliclass",
    "requirements": "Constitution 14, Spellcasting",
    "description": "Whenever you cast a spell using spell points, you can upcast the spell beyond a normal spellcaster's limits. For the purposes of upcasting, you can treat your Upcast Level as your Max Spell Level when determining how high of a level you will cast your chosen spell at, and how many spell points you will expend.\n\nYou have a number of uses of this ability equal to your Constitution modifier. You regain all expended uses of this ability at the end of a rest.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Young Animal Companion",
    "identity": "Animal Companion",
    "requirements": "You gain a young animal companion, the form of which you choose. Its stats and abilities are detailed in the Animal Companion Appendix",
    "description": "",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Mature Animal Companion",
    "identity": "Animal Companion",
    "requirements": "Young Animal Companion, Level 3",
    "description": "Your animal companion grows into an adult of its species, gaining benefits as it grows with you. The changes to its stats and abilities as it matures are detailed in the Animal Companion Appendix",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Specialized Animal Companion",
    "identity": "Animal Companion",
    "requirements": "Mature Animal Companion, Level 5",
    "description": "Through specialized training, your companion becomes either a Savage or Nimble Animal Companion, learning new abilities and further specializing its stats. These changes are detailed in the Animal Companion Appendix",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  },
  {
    "name": "Apex Animal Companion",
    "identity": "Animal Companion",
    "requirements": "Specialized Animal Companion, Level 7",
    "description": "Your companion reaches the height of their species, an Apex predator far beyond their natural possibilities. Their stats improve and they learn new abilities as detailed in the Animal Companion Appendix.",
    "1stLevelSpells": "",
    "2ndLevelSpells": "",
    "3rdLevelSpells": "",
    "4thLevelSpells": "",
    "5thLevelSpells": ""
  }
]
