[
  {
    "name": "Banishing Arrow",
    "description": "You use abjuration magic to try to temporarily banish your target to a harmless location in the Feywild. The creature hit by the arrow must also succeed on a Will saving throw or be banished. While banished in this way, its speed is 0, and it is incapacitated. At the end of its next turn, the target reappears in the space it vacated or in the nearest unoccupied space if that space is occupied.\n\nWhen this shot is Empowered, the target takes an additional 3d6 Arcane damage when the arrow hits it.",
    "list": "Arcane Shot"
  },
  {
    "name": "Beguiling Arrow",
    "description": "Your enchantment magic causes this arrow to temporarily beguile its target. Choose one of your allies within 30 feet of the target. The target must succeed on a Will saving throw, or it takes 2d6 Psychic damage and is charmed by the chosen ally until the start of your next turn. This effect ends early if the chosen ally attacks the charmed target, deals damage to it, or forces it to make a saving throw.\n\nThe Psychic damage increases to 4d6 when this shot is Empowered.",
    "list": "Arcane Shot"
  },
  {
    "name": "Bursting Arrow",
    "description": "You imbue your arrow with force energy drawn from the school of evocation. The arrow detonates after your attack. Immediately after the arrow hits the creature, the target and all other creatures within 10 feet of it take 3d6 fire damage each.\n\nThe Fire damage increases to 6d6 when this shot is Empowered.",
    "list": "Arcane Shot"
  },
  {
    "name": "Enfeebling Arrow",
    "description": "You weave necromantic magic into your arrow. The creature hit by the arrow takes an extra 2d6 dark damage. The target must also succeed on a Fortitude saving throw, or the damage dealt by its weapon attacks is halved until the start of your next turn.\n\nThe Dark damage increases to 4d6 when this shot is Empowered.",
    "list": "Arcane Shot"
  },
  {
    "name": "Grasping Arrow",
    "description": "When this arrow strikes its target, conjuration magic creates grasping, poisonous brambles, which wrap around the target. The creature hit by the arrow takes an extra 2d6 Poison damage, its speed is reduced by 10 feet, and it takes 2d6 slashing damage the first time on each turn it moves 1 foot or more without teleporting. The target or any creature that can reach it can use two actions to remove the brambles with a successful Athletics check against your Fighter save DC. Otherwise, the brambles last for 1 minute or until you use this option again.\n\nThe Poison damage and slashing damage both increase to 4d6 when this shot is Empowered.",
    "list": "Arcane Shot"
  },
  {
    "name": "Piercing Arrow",
    "description": "You use transmutation magic to give your arrow an ethereal quality. You fire a ghostly arrow in a straight line that passes through objects and enemies alike. Each creature in that line must make a Reflex saving throw. On a failed save, a creature takes damage as if it were hit by the arrow, plus an extra 2d6 Piercing damage. On a successful save, a target takes half as much damage.\n\nThe Piercing damage increases to 4d6 when this shot is Empowered.",
    "list": "Arcane Shot"
  },
  {
    "name": "Seeking Arrow",
    "description": "Using divination magic, you grant your arrow the ability to seek out your target, allowing the arrow to curve and twist its path in search of its prey. Choose a creature you have seen in the last minute who is within the maximum range of your weapon. This creature must make a Reflex save. On a failed save, it takes damage as if it were hit by the arrow, plus an extra 2d6 Arcane damage, and you learn the target’s current location. On a successful save, the target takes half as much damage, and you don’t learn its location.\n\nThe Arcane damage increases to 4d6 when this shot is Empowered.",
    "list": "Arcane Shot"
  },
  {
    "name": "Shadow Arrow",
    "description": "You weave illusion magic into your arrow, causing it to occlude your foe’s vision with shadows. The creature hit by the arrow takes an extra 2d6 Psychic damage, and it must succeed on a Will saving throw or be unable to see anything farther than 5 feet away until the start of your next turn.\n\nThe Psychic damage increases to 4d6 when this shot is Empowered.",
    "list": "Arcane Shot"
  }
]
