[
  {
    "name": "Divine Bloodline",
    "description": "Spell List: Divine spell list\n\nTrained Skill: Religion\n\nInherited Ability: Once per day, if you fail a saving throw or miss with an attack roll, you can roll 2d4 and add it to the total, possibly changing the outcome."
  },
  {
    "name": "Draconic Bloodline",
    "description": "Spell List: Arcane spell list\n\nTrained Skill: Arcana or Nature\n\nInherited Ability: Choose a Draconic Ancestry from the chart below. This ancestry determines your later features.\n\nBlack - Acid\n\nSilver, White - Cold\n\nBrass, Gold, Red - Fire\n\nBlue, Bronze - Lightning\n\nGreen - Poison\n\nAdditionally, your body is covered in draconic scales. When you aren’t wearing armor, you have a natural armor with +3 Defense and no Dexterity Maximum. This armor has an Armor value of 1."
  },
  {
    "name": "Profane Bloodline",
    "description": "Spell List: Arcane + Occult spell lists\n\nTrained Skill: Arcana or Stealth\n\nInherited Ability: You have Darkvision to 120 feet, granting you the ability to see in total darkness. When you reach 3rd level, you learn the Darkness spell (independent of the other spells you learn), and can cast it as an action using 2 spell points."
  },
  {
    "name": "Storm Spirit Bloodline",
    "description": "Spell List: Primal spell list\n\nTrained Skill: Nature\n\nInherited Ability: You can use an action on your turn to cause whirling gusts of elemental air to briefly surround you immediately before or after you cast a spell of 1st level or higher. Doing so allows you to fly up to 10 feet without provoking opportunity attacks."
  },
  {
    "name": "Psion Bloodline",
    "description": "Spell List: Arcane + Occult spell lists\n\nTrained Skill: Arcana\n\nInherited Ability: You can form a telepathic connection between your mind and the mind of another. As an action, choose one creature you can see within 30 feet of you. You and the chosen creature can speak telepathically with each other while the two of you are within a number of miles of each other equal to your Charisma modifier (minimum of 1 mile). To understand each other, you each must speak mentally in a language the other knows.\n\nThe telepathic connection lasts for a number of minutes equal to your level. It ends early if you are incapacitated or die or if you use this ability to form a connection with a different creature."
  }
]
