[
  {
    "name": "Careful Spell",
    "description": "When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell's full force. To do so, you spend 1 Spell Point and choose a number of those creatures up to your Casting modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell.",
    "list": "Metamagic"
  },
  {
    "name": "Distant Spell",
    "description": "When you cast a spell that has a range of 5 feet or greater, you can spend 1 Spell Point to double the range of the spell.\n\nWhen you cast a spell that has a range of touch, you can spend 1 Spell Point to make the range of the spell 30 feet.",
    "list": "Metamagic"
  },
  {
    "name": "Elemental Spell",
    "description": "When you cast a spell that deals a type of damage from the following list, you can spend 1 Spell Point to change that damage type to one of the other listed types: acid, cold, fire, lightning, thunder.",
    "list": "Metamagic"
  },
  {
    "name": "Empowered Spell",
    "description": "When you roll damage for a spell, you can spend 1 Spell Point to reroll a number of the damage dice up to your Casting modifier (minimum of one). You must use the new rolls.\n\nYou can use Empowered Spell even if you have already used a different Metamagic option during the casting of the spell.",
    "list": "Metamagic"
  },
  {
    "name": "Extended Spell",
    "description": "When you cast a spell that has a duration of 1 minute or longer, you can spend 1 Spell Point to double its duration, to a maximum duration of 24 hours.",
    "list": "Metamagic"
  },
  {
    "name": "Heightened Spell",
    "description": "When you cast a spell that forces a creature to make a saving throw to resist its effects, you can spend 3 Spell Points to give one target of the spell disadvantage on its first saving throw made against the spell.",
    "list": "Metamagic"
  },
  {
    "name": "Quickened Spell",
    "description": "When you cast a spell that has a casting time of 2 or 3 actions, you can spend 2 Spell Points to reduce its casting time by 1 action for this casting.",
    "list": "Metamagic"
  },
  {
    "name": "Subtle Spell",
    "description": "When you cast a spell, you can spend 1 Spell Point to cast it without any somatic or verbal components.",
    "list": "Metamagic"
  },
  {
    "name": "Twinned Spell",
    "description": "When you cast a spell that targets only one creature and doesn't have a range of self, you can spend a number of Spell Points equal to the spell's level to target a second creature in range with the same spell (1 Spell Point if the spell is a cantrip).",
    "list": "Metamagic"
  },
  {
    "name": "Unerring Spell",
    "description": "If you make an attack roll for a spell and miss, you can spend 2 Spell Points to reroll the attack roll. You must use the result of the second roll.\n\nYou can use Unerring Spell even if you have already used a different Metamagic option during the casting of the spell.",
    "list": "Metamagic"
  },
  {
    "name": "Widened Spell",
    "description": "When you cast a spell that affects an area, you can spend 1 Spell Point to increase the width of a cube by 10 feet, the length of a cone by 10 feet, or the width of a line by 5 feet and its length by 10 feet.",
    "list": "Metamagic"
  }
]
