{
  "coreStats": {
    "size": "Small",
    "landSpeed": 25,
    "swimSpeed": 0,
    "climbSpeed": 0,
    "flySpeed": 0,
    "burrowSpeed": 0,
    "hitPoints": 6,
    "languages": [
      "Common",
      "Gnomish"
    ],
    "ability": ""
  },
  "subraces": [
    {
      "name": "Forest",
      "description": "As an action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, cast a spell, or force someone to make a saving throw. You may use this trait once per day.",
      "requirements": "",
      "penalty": ""
    },
    {
      "name": "Rock",
      "description": "You have advantage on all Will saves against magic.",
      "requirements": "",
      "penalty": ""
    }
  ],
  "generalPerks": [
    {
      "name": "Natural Illusionist",
      "description": "You know the Minor Illusion cantrip. Intelligence is your spellcasting modifier for it. You are proficient in its casting.",
      "requirements": ""
    },
    {
      "name": "Gnomish Obsession",
      "description": "You gain Apprentice proficiency with one skill of your choice. At 5th level, your proficiency with this skill increases by one level (up to a maximum of Expert).",
      "requirements": ""
    },
    {
      "name": "Speak with Small Beasts",
      "description": "Through sound and gestures, you may communicate simple ideas with small or smaller beasts.",
      "requirements": ""
    },
    {
      "name": "Artificer's Lore",
      "description": "Whenever you make a History check related to magical, alchemical, or technological items, you can do so with advantage. You have Apprentice proficiency in the Lore / History skill.",
      "requirements": ""
    },
    {
      "name": "Nimble",
      "description": "You can move through the space of any creature that is of a size larger than yours.",
      "requirements": ""
    },
    {
      "name": "Gnomish Tinkering",
      "description": "You have Apprentice proficiency in crafting. You can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp).\n\nThe device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time.\n\nThese devices can be used to create a number of effects. The Prestidigitation cantrip is a good baseline for such effects, though your DM has the final ruling",
      "requirements": ""
    },
    {
      "name": "Low-Light Vision",
      "description": "You can see in dim light as though it were by torchlight, but cannot see in darkness.",
      "requirements": ""
    }
  ]
}
