{
  "name": "Goblin",
  "size": "Medium",
  "landSpeed": 30,
  "swimSpeed": 0,
  "climbSpeed": 0,
  "flySpeed": 0,
  "burrowSpeed": 0,
  "hitPoints": 6,
  "languages": [
    "Common",
    "Goblin"
  ],
  "ability": "",
  "subraces": [
    {
      "name": "Charhide",
      "description": "You have resistance to Fire and Acid damage",
      "requirements": "",
      "penalty": ""
    },
    {
      "name": "Irongut",
      "description": "You have resistance to poison damage, and are immune to the poisoned condition.",
      "requirements": "",
      "penalty": ""
    },
    {
      "name": "Unbreakable",
      "description": "You gain 12 hit points instead of 6 from your race at 1st level.\n\nThe first time you are knocked unconscious each day, you don't gain a wound upon being stabilized.",
      "requirements": "",
      "penalty": ""
    },
    {
      "name": "Tailed",
      "description": "You have a tail, gain the Apprentice proficiency in Acrobatics, and have a climb speed of 15 feet.",
      "requirements": "",
      "penalty": ""
    }
  ],
  "generalPerks": [
    {
      "name": "Goblin Thievery",
      "description": "You gain Apprentice proficiency in thievery and stealth.",
      "requirements": ""
    },
    {
      "name": "Rough Rider",
      "description": "You can successfully mount and command medium sized animals that would otherwise not be trainable as mounts (dogs, wolves, goats, giant badgers, etc...).",
      "requirements": ""
    },
    {
      "name": "Very Sneaky",
      "description": "You suffer no movement penalty while attempting to sneak.",
      "requirements": ""
    },
    {
      "name": "Fury of the Small",
      "description": "When you damage a creature with an attack or spell and the creature's size is larger than yours, you can cause the attack or spell to deal extra damage to the creature. The extra damage equals your level.\n\nOnce you use this trait, you can't use it again until after your next rest.",
      "requirements": ""
    },
    {
      "name": "Goblin Scuttle",
      "description": "You gain the following reaction: When an ally ends a move adjacent to you, you can immediately use the disengage action.",
      "requirements": ""
    },
    {
      "name": "Keen Senses",
      "description": "You have advanced hearing and smell, and have advantage on perception checks relating those senses.",
      "requirements": ""
    },
    {
      "name": "Low-Light Vision",
      "description": "You can see in dim light as though it were by torchlight, but cannot see in darkness.",
      "requirements": ""
    }
  ]
}
