{
  "coreStats": {
    "size": "Tall",
    "landSpeed": 30,
    "swimSpeed": 0,
    "climbSpeed": 0,
    "flySpeed": 0,
    "burrowSpeed": 0,
    "hitPoints": 12,
    "languages": [
      "Common",
      "Giant"
    ],
    "ability": ""
  },
  "subraces": [
    {
      "name": "Crag-Hopper",
      "description": "You are resistant to Cold damage.\n\nYou do not need to stride before making a long jump, and have advantage on all athletics checks to jump, long jump or high jump.",
      "requirement": "",
      "penalty": ""
    },
    {
      "name": "Sand-Walker",
      "description": "You are resistant to Fire damage.\n\nYour movement speed is increased by 5 feet",
      "requirement": "",
      "penalty": ""
    }
  ],
  "generalPerks": [
    {
      "name": "Powerful Build",
      "description": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift. The movement penalty for armor and shields is reduced by 5 feet.",
      "requirement": ""
    },
    {
      "name": "Stone's Endurance",
      "description": "You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a d12. Add your Constitution modifier to the number rolled, and reduce the damage received by that total. You can use this ability once per day.",
      "requirement": ""
    },
    {
      "name": "Survival of the Fittest",
      "description": "You gain Trained proficiency in the Athletics skill.",
      "requirement": ""
    },
    {
      "name": "Deadly Velocity",
      "description": "When you make an attack with a thrown weapon, that weapon's range increments are doubled.",
      "requirement": ""
    },
    {
      "name": "Towering Presence",
      "description": "You gain Apprentice proficiency in the Intimidation skill, and have advantage on saving throws against being frightened.",
      "requirement": ""
    },
    {
      "name": "Wild Companion",
      "description": "You have a familiar, which is a fey spirit bound to you in the wilds during your youth. This familiar takes whatever form you choose, but usual forms typically possess a fly speed.\n\nThis familiar behaves as though summoned by the find familiar spell (with the following changes) and you can cast Find Familiar (without expending any spell charges or material components) only to resummon this familiar.\n\nYour familiar is always of the type: fey, your familiar is incapable of changing its physical form even when resummoned, and your familiar is incapable of taking any actions in combat.",
      "requirement": ""
    },
    {
      "name": "Low-Light Vision",
      "description": "You can see in dim light as though it were by torchlight, but cannot see in darkness.",
      "requirement": ""
    }
  ]
}
