{
  "name": "Runemade",
  "size": "Medium",
  "landSpeed": 30,
  "swimSpeed": 0,
  "climbSpeed": 0,
  "flySpeed": 0,
  "burrowSpeed": 0,
  "hitPoints": 10,
  "languages": [
    "Common",
    "FREE"
  ],
  "ability": "You don’t need to eat, drink, or breathe. You are immune to disease and the poisoned condition.",
  "subraces": [
    {
      "name": "Envoy",
      "description": "You learn an additional language.\n\nYou gain trained proficiency in a skill of your choice",
      "requirements": "",
      "penalty": ""
    },
    {
      "name": "Juggernaut",
      "description": "You gain an additional 4 hit points as part of your racial bonus at level 1.\n\nWhen making death saving throws, you require 4 failed death saves instead of 3 in order to die.",
      "requirements": "",
      "penalty": ""
    }
  ],
  "generalPerks": [
    {
      "name": "Integrated Armor",
      "description": "You gain a permanent +1 bonus to both Defense and Armor. You can rest normally no matter the style of armor you are wearing, and no longer need to remove your armor for any reason.",
      "requirements": ""
    },
    {
      "name": "Swift",
      "description": "Your movement speed increases by 10 feet.",
      "requirements": ""
    },
    {
      "name": "Powerful Build",
      "description": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift. You automatically meet the strength requirement for all armors and shields.",
      "requirements": ""
    },
    {
      "name": "Sentry's Rest",
      "description": "You do not lose consciousness when you rest, and can instead remain motionless and alert for 6 hours to gain the benefits of a full night's rest.",
      "requirements": ""
    },
    {
      "name": "Iron Fists",
      "description": "Your iron fists hit just as hard as any weapon. Your unarmed attacks do 1d6 + your strength modifier bludgeoning damage. You are proficient in these attacks.",
      "requirements": ""
    },
    {
      "name": "Specialized Design",
      "description": "You gain apprentice proficiency in a skill of your choice.",
      "requirements": ""
    },
    {
      "name": "Low-Light Vision",
      "description": "You can see in dim light as though it were by torchlight, but cannot see in darkness.",
      "requirements": ""
    }
  ]
}
