{
  "name": "Tiefling",
  "size": "Medium",
  "landSpeed": 30,
  "swimSpeed": 0,
  "climbSpeed": 0,
  "flySpeed": 0,
  "burrowSpeed": 0,
  "hitPoints": 8,
  "languages": [
    "Common",
    "Infernal"
  ],
  "ability": "",
  "subraces": [
    {
      "name": "Faustian",
      "description": "You have Apprentice proficiency in the Persuasion and Society skills.\n\nYour social interactions with other people are uninhibited by your fiendish appearance, and do not suffer the normal stigma associated with your appearance.",
      "requirements": "",
      "penalty": ""
    },
    {
      "name": "Infernal Born",
      "description": "You know the Produce Flame cantrip and can cast the spell Hellish Rebuke at 2nd level (once per day). Charisma is your spellcasting ability for these spells.\n\nYou are proficient in the casting of these spells.",
      "requirements": "",
      "penalty": ""
    },
    {
      "name": "Branded One",
      "description": "You are resistant to Fire damage.\n\nYou know the Thaumaturgy cantrip.",
      "requirements": "",
      "penalty": ""
    }
  ],
  "generalPerks": [
    {
      "name": "Skillful Tail",
      "description": "Your tail is capable of performing simple interactions, like opening an unlocked door. Your tail is incapable of any task that requires finders or significant manual dexterity, but can be used to hold simple objects.",
      "requirements": ""
    },
    {
      "name": "Silver-tongued",
      "description": "You gain the Trained proficiency level in deception.",
      "requirements": ""
    },
    {
      "name": "Cloven Hoof",
      "description": "Your move speed increases by 5 feet.",
      "requirements": ""
    },
    {
      "name": "Fiend's Door",
      "description": "Once per day you can cast the spell Misty Step without expending a spell charge or using any material components.\n\nAdditionally, you don't need to be able to see your destination in order to teleport there. Even if you have additional spell charges, you cannot cast this spell this way using another spellcasting feature.",
      "requirements": ""
    },
    {
      "name": "Resist in Kind",
      "description": "You gain advantage on all Will saving throws against magical effects cast or caused by Fiendish enemies.",
      "requirements": ""
    },
    {
      "name": "Infernal Ally",
      "description": "You gain a familiar ally bound to you through the chaos in your blood. This familiar takes whatever form you choose.\n\nThis familiar behaves as though summoned by the find familiar spell (with the following changes) and you can cast Find Familiar (without expending any spell charges or material components) only to resummon this familiar.\n\nYour familiar is always of the type: Fiend, your familiar is incapable of changing its physical form even when resummoned, and your familiar is incapable of taking any actions in combat",
      "requirements": ""
    },
    {
      "name": "Low-Light Vision",
      "description": "You can see in dim light as though it were by torchlight, but cannot see in darkness.",
      "requirements": ""
    }
  ]
}
