[
  {
    "id": "39c32c2c-e38e-4b8a-99c6-65bed4dd59ba",
    "name": "Healing Hands",
    "description": "As an action, you can touch a creature and cause it to regain a number of hit points equal to your level. Once you use this trait, you can't use it again until you finish a rest.",
    "requirements": ""
  },
  {
    "id": "cf5de4ac-873d-4d5b-8354-086d1114c25d",
    "name": "Divine Blessing",
    "description": "You learn a Divine cantrip of your choice. Charisma is your spellcasting modifier for it.\n\nYou are proficient in the use of this cantrip",
    "requirements": ""
  },
  {
    "id": "44019731-d50a-4207-916c-db7305da69e1",
    "name": "Celestial Resistance",
    "description": "You have resistance to Dark damage or Light damage.",
    "requirements": ""
  },
  {
    "id": "9a5b5347-9493-425a-8216-70ff2caa04a1",
    "name": "Powerful Presence",
    "description": "You have apprentice proficiency in two of the following skills: Persuasion, Intimidation, and Society.",
    "requirements": ""
  },
  {
    "id": "8a3c80ee-77ba-406d-afc5-34b91834975c",
    "name": "Stronger Together",
    "description": "You have advantage on all checks to assist an ally in a skill that you have at least Trained proficiency level in.",
    "requirements": ""
  },
  {
    "id": "52d90a4d-67f4-482f-a857-2058149f56e9",
    "name": "Talented",
    "description": "You gain one skill increase to a skill of your choosing",
    "requirements": ""
  },
  {
    "id": "caee0677-575e-428d-9632-b90a22dcec7b",
    "name": "Powerful Swimmer",
    "description": "You have a swim speed of 15 feet.",
    "requirements": ""
  },
  {
    "id": "12c16432-850a-468d-9cb3-df960d94e4b3",
    "name": "Lightfoot",
    "description": "You do not set off pressure plates, tripwires, or other ground based traps.",
    "requirements": ""
  },
  {
    "id": "569c5cca-8240-44e0-a3a6-3d24d0fe14c7",
    "name": "Nimble Dodge",
    "description": "When you fail a Reflex save, you can use your reaction to reroll the save and keep the new result. You can use this ability once per day.",
    "requirements": ""
  },
  {
    "id": "3ed01bbc-8ed1-4f2f-81b8-917f52f062f2",
    "name": "Nine Lives",
    "description": "When you take damage that would reduce your hit points to 0, you can choose to be reduced to 1 hit point instead.\n\nYou may only use this ability Nine times, and it does not recharge.",
    "requirements": ""
  },
  {
    "id": "3ffec420-cd37-447d-ade5-f771ab4fccea",
    "name": "Cat's Claws",
    "description": "Your retractable claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.",
    "requirements": ""
  },
  {
    "id": "f19dd0f2-372c-4357-b1f7-993bf75c8216",
    "name": "Masterful Hunter",
    "description": "You have apprentice level proficiency in stealth and survival.",
    "requirements": ""
  },
  {
    "id": "6e257c83-e81b-4eab-9665-f61c53eb117c",
    "name": "Wish-Granter",
    "description": "Once per day, you can give an ally advantage on any attack, ability check, or saving throw.",
    "requirements": ""
  },
  {
    "id": "89b8b2bd-909f-40e4-9ae6-087d0bd8a17c",
    "name": "Future-Sight",
    "description": "At the beginning of every day, roll a d20 and record the result. Once per day, you can replace any roll you make with the recorded result. This roll ONLY replaces the rolled value, not any modifiers or bonuses you may have.",
    "requirements": ""
  },
  {
    "id": "ecf2ae1a-1352-4ca4-a41b-689859718bae",
    "name": "Advanced Movement",
    "description": "You gain the advanced movement ability detailed under your chosen subrace.",
    "requirements": ""
  },
  {
    "id": "60fe2da0-562a-45de-b390-af742515019a",
    "name": "Djinni Spellcasting",
    "description": "You gain the Djinn Spellcasting feature detailed under your chosen subrace.\n\nConstitution is your spellcasting modifier for these spells. You are proficient in the use of these spells.",
    "requirements": ""
  },
  {
    "id": "9f76a8d9-5017-4a6a-9cc1-79ea377c37a1",
    "name": "Advanced Djinni Spellcasting",
    "description": "You gain the Advanced Spells ability detailed under your chosen subrace.",
    "requirements": ""
  },
  {
    "id": "301f9769-4491-474c-9d77-1f8b2c377db9",
    "name": "Semi-Cosmic Knowledge",
    "description": "You gain the Apprentice proficiency in two skills of your choice.",
    "requirements": ""
  },
  {
    "id": "cd5d1e2e-24f7-4730-ae36-0ecdf2341e3b",
    "name": "Dwarven Armor Training",
    "description": "You reduce the movement penalties from heavy and medium armor by 5 feet. You gain proficiency in light armor. If you already have proficiency in light armor, you instead gain proficiency in medium armor. If you already have proficiency in medium armor, you gain proficiency in heavy armor.",
    "requirements": ""
  },
  {
    "id": "a754f35f-9354-4191-bcbb-a6b3ae656404",
    "name": "Dwarven Combat Training",
    "description": "You are proficient with the battleaxe, handaxe, light hammer, and warhammer.",
    "requirements": ""
  },
  {
    "id": "f3aa556b-bf0c-4506-a0a1-addc70fa0227",
    "name": "Dwarven Toughness",
    "description": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level.",
    "requirements": ""
  },
  {
    "id": "4470d1e5-95b3-4aa5-93b0-96dc0e82130f",
    "name": "Clan Artisan",
    "description": "You gain Apprentice proficiency with the Crafting skill, as well as with the artisan's tools of your choice. If you would already gain Apprentice proficiency in Crafting, you gain the Trained proficiency level instead.\n\nIn addition, You have advantage on any check relating to stonework or any other dwarven craftsmanship.",
    "requirements": ""
  },
  {
    "id": "25f348a6-65af-47a6-9018-950cc48888d3",
    "name": "One with the Mountain",
    "description": "You can cast the spell Meld into Stone once per day as an innate spell.\n\nAccustomed to life under the mountain, you are incapable of (naturally) getting lost while underground. You are capable of retracing your steps or finding your way to the surface.\n\nYou can cast the spell Enlarge once per day as a 2nd-level innate spell. You may only use the enlarge option, and may only target yourself.",
    "requirements": ""
  },
  {
    "id": "09cb6fab-0559-4c33-bc60-b151557a477f",
    "name": "Low-light Vision",
    "description": "You can see in dim light as though it were by torchlight, but cannot see in darkness.",
    "requirements": ""
  },
  {
    "id": "ceb2c517-5338-4387-871b-73e85200f1c8",
    "name": "Fey Magic",
    "description": "You know one cantrip of your choice from the Primal spell list. Wisdom is your spellcasting Ability for it. You are proficient in the casting of this spell.",
    "requirements": ""
  },
  {
    "id": "513c1e6d-71ea-4ce5-b610-4266200c67e2",
    "name": "Speech of Beast and Leaf",
    "description": "You have the Ability to communicate in a limited manner with beasts and plants. They can understand the meaning of your words, though you have no special Ability to understand them in return. You have advantage on all Charisma checks you make to influence them.",
    "requirements": ""
  },
  {
    "id": "1ee4f053-ad6f-496d-9f61-8973e514baa7",
    "name": "Longstrider",
    "description": "Your movement speed increases by 5",
    "requirements": ""
  },
  {
    "id": "6a01d226-df3f-4402-95af-cad237d7c8bd",
    "name": "One with Nature",
    "description": "You have Trained proficiency in the Nature Skill",
    "requirements": ""
  },
  {
    "id": "395d6abc-924c-469e-993e-e43336931a4c",
    "name": "Read the Leaves",
    "description": "You have advantage on all survival checks while in forest or woods.",
    "requirements": ""
  },
  {
    "id": "12fe8f9f-a14b-4bfa-a54c-e9b915c86e75",
    "name": "Natural Illusionist",
    "description": "You know the Minor Illusion cantrip. Intelligence is your spellcasting modifier for it. You are proficient in its casting.",
    "requirements": ""
  },
  {
    "id": "608d035a-e3d9-45d9-a65e-542490e15986",
    "name": "Gnomish Obsession",
    "description": "You gain Apprentice proficiency with one skill of your choice. At 5th level, your proficiency with this skill increases by one level (up to a maximum of Expert).",
    "requirements": ""
  },
  {
    "id": "10f01da0-3e19-48f8-84e0-16df2f40257b",
    "name": "Speak with Small Beasts",
    "description": "Through sound and gestures, you may communicate simple ideas with small or smaller beasts.",
    "requirements": ""
  },
  {
    "id": "34db766e-785d-4ed9-a941-e33db4405582",
    "name": "Artificer's Lore",
    "description": "Whenever you make a History check related to magical, alchemical, or technological items, you can do so with advantage. You have Apprentice proficiency in the Lore / History skill.",
    "requirements": ""
  },
  {
    "id": "d533c9a2-80f7-411b-8f40-bb6708379d87",
    "name": "Nimble",
    "description": "You can move through the space of any creature that is of a size larger than yours.",
    "requirements": ""
  },
  {
    "id": "4ca1355b-dbe5-4dee-a050-cd42429837bb",
    "name": "Gnomish Tinkering",
    "description": "You have Apprentice proficiency in crafting. You can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp).\n\nThe device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time.\n\nThese devices can be used to create a number of effects. The Prestidigitation cantrip is a good baseline for such effects, though your DM has the final ruling",
    "requirements": ""
  },
  {
    "id": "a4eef7c2-8069-4205-86f6-8f775a82eaa8",
    "name": "Breath Weapon",
    "description": "You can use an action to exhale destructive energy. When you use your breath weapon, all creatures in the target area must make a saving throw, the type and shape of which is determined by your ancestry.\n\nThe DC of this saving throw is 9 + your Constitution modifier + your level. A creature takes 2d6 + your Constitution modifier damage on a failed save, and half as much damage on a successful one. The damage type is determined by your ancestry.\n\nThe damage increases to 3d6 at 3rd level, 4d6 at 5th, and 5d6 at 10th level.\n\nYou may use your breath weapon once per day.",
    "requirements": ""
  },
  {
    "id": "a0d1a917-ebb4-4ec7-ac8c-1edaf0411f2e",
    "name": "Draconic Claws",
    "description": "You grow retractable claws from the tips of your fingers. Extending or retracting the claws requires no action. The claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d6 + your Strength modifier, instead of the normal bludgeoning damage for an unarmed strike.",
    "requirements": ""
  },
  {
    "id": "25c86edd-431c-4c9b-b568-3ee9f6a8d83f",
    "name": "Iron Jaws",
    "description": "You can use your action to make a visceral bite attack with your draconic maw. This attack does damage equal to 1d6 + your Strength modifier, and provides you with a number of temporary hit points equal to the damage dealt with this attack.\n\nYou are proficient with this attack, but can only gain its benefits once per day.",
    "requirements": ""
  },
  {
    "id": "1345d7ad-d3dc-4023-8244-7513fbc12915",
    "name": "Imposing Predator",
    "description": "You gain Apprentice proficiency in the intimidation skill, and have advantage on all saving throws against becoming frightened.",
    "requirements": ""
  },
  {
    "id": "b00614e9-6da2-46f9-af75-42c5003b1e0e",
    "name": "Survivalist",
    "description": "You gain Trained proficiency in the survival skill.",
    "requirements": ""
  },
  {
    "id": "fe067003-63ee-40db-8434-e2dbdf544463",
    "name": "Stone's Endurance",
    "description": "You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a d12. Add your Constitution modifier to the number rolled, and reduce the damage received by that total. You can use this ability once per day.",
    "requirements": ""
  },
  {
    "id": "a0b59e47-9c32-487a-8c3d-f536e6840589",
    "name": "Survival of the Fittest",
    "description": "You gain Trained proficiency in the Athletics skill.",
    "requirements": ""
  },
  {
    "id": "9ee0d619-6588-4c69-9c57-31edb45fd704",
    "name": "Deadly Velocity",
    "description": "When you make an attack with a thrown weapon, that weapon's range increments are doubled.",
    "requirements": ""
  },
  {
    "id": "9ade7d8c-fcb5-4974-b0ff-05508d1b43e2",
    "name": "Towering Presence",
    "description": "You gain Apprentice proficiency in the Intimidation skill, and have advantage on saving throws against being frightened.",
    "requirements": ""
  },
  {
    "id": "c1a5ca5f-7840-4a93-9427-3ebbe067d96c",
    "name": "Wild Companion",
    "description": "You have a familiar, which is a fey spirit bound to you in the wilds during your youth. This familiar takes whatever form you choose, but usual forms typically possess a fly speed.\n\nThis familiar behaves as though summoned by the find familiar spell (with the following changes) and you can cast Find Familiar (without expending any spell charges or material components) only to resummon this familiar.\n\nYour familiar is always of the type: fey, your familiar is incapable of changing its physical form even when resummoned, and your familiar is incapable of taking any actions in combat.",
    "requirements": ""
  },
  {
    "id": "c71ff897-3675-4c54-abd4-e63268cd3014",
    "name": "Brave",
    "description": "You have advantage on saving throws against being frightened.",
    "requirements": ""
  },
  {
    "id": "20f96b48-a357-4e1b-8ffd-aa80443d8aa2",
    "name": "Lucky",
    "description": "When you roll a 1 on an attack roll, Ability check, or saving throw, you can reroll the die. You must use the new result, even if it is a 1.",
    "requirements": ""
  },
  {
    "id": "22cf6c5f-4d16-4010-87ae-ff0eb23f5696",
    "name": "Halfling Charm",
    "description": "You have Apprentice proficiency with the Persuasion skill, and can give yourself advantage on a persuasion ability check with a member of a non-halfling race once per day.",
    "requirements": ""
  },
  {
    "id": "2129c8bb-5e0e-4e94-8835-dba6c53c3d6d",
    "name": "Sticky Fingers",
    "description": "You have Trained proficiency in Thievery.",
    "requirements": ""
  },
  {
    "id": "cd79cd13-8bf7-46ee-8cf1-7ebf4e3b5b78",
    "name": "Sure Footed",
    "description": "You gain a climbing speed of 10 feet",
    "requirements": ""
  },
  {
    "id": "9da67c36-99fe-41fa-a87f-bc514859287e",
    "name": "Martial Culture",
    "description": "You gain Trained proficiency in the Athletics skill.",
    "requirements": ""
  },
  {
    "id": "81399b92-0d4e-44c9-98e8-44cb3011ccce",
    "name": "Saving Face",
    "description": "If you miss an attack roll or fail an ability check or saving throw, you can gain a bonus to the roll equal to the number of allies you can see within 30 feet (max +5). You can use this ability once per day.",
    "requirements": ""
  },
  {
    "id": "41e10f3c-4a25-4f70-a245-64f26866c370",
    "name": "Hobgoblin Combat Training",
    "description": "You are proficient with all weapons.",
    "requirements": ""
  },
  {
    "id": "5376f238-fcaf-483a-9c5c-6175295ae6d3",
    "name": "Formation Training",
    "description": "You gain the following reaction: If you are the target of an attack while next to an ally, you can give yourself a +1 bonus to your defense against that attack.",
    "requirements": ""
  },
  {
    "id": "84c16381-77c8-415b-97c3-184c9613be3e",
    "name": "Keen Senses",
    "description": "You have advanced hearing and smell, and have advantage on perception checks relating those senses.",
    "requirements": ""
  },
  {
    "id": "5eeba97b-95ee-429a-81bb-7de1219f4ecd",
    "name": "Practiced",
    "description": "You gain one skill increase to a skill of your choosing",
    "requirements": ""
  },
  {
    "id": "42bea861-1d26-4193-9ba5-6c59a0982377",
    "name": "Talented",
    "description": "You gain one skill increase to a skill of your choosing",
    "requirements": ""
  },
  {
    "id": "35c056e0-8ebb-4636-b234-23cefa77585a",
    "name": "Martialist",
    "description": "You gain proficiency with simple weapons. If you already have proficiency with simple weapons, you gain proficiency with martial weapons.",
    "requirements": ""
  },
  {
    "id": "79d39de8-8d08-4244-b3d1-2ebe11dfb7f7",
    "name": "Human Determination",
    "description": "When you roll a 1 on an attack roll, Ability check, or saving throw, you can reroll the die. You must use the new result, even if it is a 1.",
    "requirements": ""
  },
  {
    "id": "3fa15e01-b6c8-4400-8d62-5dac7abaf1a1",
    "name": "Knack",
    "description": "When you attempt a skill check for a skill that you are untrained in, you may treat the roll as if you had Apprentice proficiency in that skill.",
    "requirements": ""
  },
  {
    "id": "3adc48c1-bb99-47a6-aaa9-833da87d467d",
    "name": "Mage's Apprentice",
    "description": "You learn a cantrip of your choice from a spell list of your choice. Your casting ability for this spell is Intelligence for Arcane Spells, and Wisdom for Divine and Primal Spells. You are proficient in this spell.",
    "requirements": ""
  },
  {
    "id": "9fdea506-881a-4760-9da0-ab1b63741feb",
    "name": "Human Adaptability",
    "description": "You gain a 10 foot climbing or swimming speed, or increase one of those two movement speeds by 10 feet.",
    "requirements": ""
  },
  {
    "id": "425cbbc0-51c8-4719-a73f-eb56554f1120",
    "name": "Skillful Deceiver",
    "description": "You gain Apprentice proficiency in Deception and Stealth.",
    "requirements": "Changeling Subrace"
  },
  {
    "id": "e44e1303-fe53-4934-a8c5-5ae5be406491",
    "name": "Mind Link",
    "description": "You can speak telepathically to any creature you can see within a number of feet equal to 10 * your level. You don't need to share a language for the creature to understand you, but the creature must be able to understand at least one language.\n\nWhen you're using this trait to speak with a creature telepathically, you may use your action to allow the creature to speak back to you telepathically. Once allowed, this effect lasts for one hour or until you use another action to end the link. The creature may only speak back as long as they are within the traits range and can see you.\n\nOpening a link to another creature severs the link with the original creature",
    "requirements": "Kalashtar Subrace"
  },
  {
    "id": "4d7270cf-170f-4cf2-ac90-a1bf2bb6be60",
    "name": "Severed from Dreams",
    "description": "You are immune to spells and other magical effects that would cause you to dream, and as a byproduct are immune to non-magical effects that would put you to sleep.",
    "requirements": "Kalashtar Subrace"
  },
  {
    "id": "41b84d86-46f1-4f6f-a125-d614aa5e2c51",
    "name": "Aggressive",
    "description": "You gain the following reaction: When an enemy ends their movement within sight range, you can move up to your speed towards them.",
    "requirements": "Half-Orc Subrace"
  },
  {
    "id": "7c7b1069-4c9e-442a-9518-ad21df3f3405",
    "name": "Fearsome Prowess",
    "description": "You gain the Trained proficiency level in the Athletics or Intimidation skill.",
    "requirements": "Half-Orc Subrace"
  },
  {
    "id": "456edfcb-d627-4804-a2a5-40b1914a6e6a",
    "name": "Powerful Build",
    "description": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift. The movement penalty for armor and shields is reduced by 5 feet.",
    "requirements": "Half-Orc Subrace"
  },
  {
    "id": "586bd7f4-a126-471f-bcff-376af948fad6",
    "name": "Savage Attacks",
    "description": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit.",
    "requirements": "Half-Orc Subrace"
  },
  {
    "id": "80606553-5944-469b-8a6e-d32410b4d30a",
    "name": "Relentless Endurance",
    "description": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can use this ability once per day.",
    "requirements": "Half-Orc Subrace"
  },
  {
    "id": "d3f6432a-06aa-4cc4-9802-10ab756675ba",
    "name": "Overlooked Brute",
    "description": "You gain the Apprentice proficiency level in Deception, and have advantage on deception checks to make yourself appear less intelligent than you are.",
    "requirements": "Half-Orc Subrace"
  },
  {
    "id": "a454eb99-7fe7-4607-8d49-982c6b501074",
    "name": "Elf Magic",
    "description": "You know one cantrip of your choice from the Arcane or Primal spell list. If you chose an Arcane spell, Intelligence is your spellcasting modifier for it. If you chose a Primal spell, Wisdom is your spellcasting modifier for it.\n\nYou are proficient in the casting of this spell.",
    "requirements": "Half-Elf Subrace"
  },
  {
    "id": "9bf72100-8611-43a5-a8dd-66c71e6df2cc",
    "name": "Elven Weapon Training",
    "description": "You are proficient with the longsword, shortsword, shortbow, and longbow.",
    "requirements": "Half-Elf Subrace"
  },
  {
    "id": "8e242873-ad58-4ca5-b770-e27be709bda8",
    "name": "Fleet of Foot",
    "description": "You gain Apprentice proficiency in the Acrobatics skill, and each of your movement speeds increases by 5 feet.",
    "requirements": "Half-Elf Subrace"
  },
  {
    "id": "cfec5f31-985f-442c-8dc0-26e1a4c68a27",
    "name": "Mask of the Wild",
    "description": "You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena.",
    "requirements": "Half-Elf Subrace"
  },
  {
    "id": "204fca15-11d5-4c43-8a8c-107694e7a065",
    "name": "Vast Knowledge (Requires age 250+)",
    "description": "You gain the Trained proficiency in a skill of your choice.",
    "requirements": "Half-Elf Subrace"
  },
  {
    "id": "761ac999-a221-4c76-9221-54589accca42",
    "name": "Elven Step",
    "description": "When you Step, you may move up to half your movement speed rather than the standard 5 feet.",
    "requirements": "Half-Elf Subrace"
  },
  {
    "id": "54fc4bbc-1e6f-4934-849e-416bb71a31ff",
    "name": "Adaptive Skin",
    "description": "The pigment and patterning of your scales constantly adjust to match your surroundings. In areas that your skin has had time to match to the area (1 hour), you have advantage on stealth checks while remaining still.",
    "requirements": ""
  },
  {
    "id": "036ab268-ca70-42bd-b241-9338f2db8ac2",
    "name": "Cunning Artisan",
    "description": "As part of a short rest, you can harvest bone and hide from a slain beast, construct, dragon, monstrosity, or plant creature of size Small or larger to create one of the following items: a shield, a club, a javelin, or 1d4 darts or blowgun needles.\n\nTo use this trait, you need a blade, such as a dagger, or appropriate artisan's tools, such as leatherworker's tools.",
    "requirements": ""
  },
  {
    "id": "d02755ae-b3ac-41ec-9e95-86ab83d38a43",
    "name": "Hunter's Talent",
    "description": "You gain the Apprentice proficiency level in two of the following skills of your choice: Nature, Perception, Stealth, and Survival.",
    "requirements": ""
  },
  {
    "id": "a03416b7-3f75-4280-858d-4c3219a9d98d",
    "name": "Hardened Scales",
    "description": "Your scales provide you with a natural suit of armor. Your scales provide a Defense bonus of +3, with no Dexterity cap, and an Armor value of 1.",
    "requirements": ""
  },
  {
    "id": "a7c7ce8e-f992-4cd5-b887-af4d40db8441",
    "name": "Hungry Jaws",
    "description": "In battle, you can throw yourself into a vicious feeding frenzy, chomping down on your foes. This bite attack does damage equal to 1d6 + your Strength modifier, and provides you with a number of temporary hit points equal to the damage dealt with this attack.\n\nYou are proficient in this attack, but can only gain its additional benefits once per day.",
    "requirements": ""
  },
  {
    "id": "6a5415d6-d332-4370-9e0c-74de6229fda1",
    "name": "Reptilian Healing",
    "description": "You heal far faster than other races. Whenever you recover hit points at the end of a rest, you regain additional hit points equal to your level.",
    "requirements": ""
  },
  {
    "id": "9ed581d8-8336-4147-ae6d-952e468ace3c",
    "name": "Skilled Hunter",
    "description": "You have apprentice level proficiency in stealth and survival.",
    "requirements": ""
  },
  {
    "id": "871d6d99-5403-4e82-bcfb-1f2039985ddb",
    "name": "Emissary of the Sea",
    "description": "Aquatic beasts have an extraordinary affinity with your people. You can communicate simple ideas with beasts that can breathe water. They can understand the meaning of your words, though you have no special ability to understand them in return.",
    "requirements": ""
  },
  {
    "id": "b6d470ae-d02d-4ea2-be83-d14082e2a2f0",
    "name": "Primordialist",
    "description": "You learn a cantrip of your choice from the Primal spell list. Constitution is your casting modifier for this cantrip.\n\nYou are proficient in the casting of this spell",
    "requirements": ""
  },
  {
    "id": "4ccec93f-efe6-4867-8914-14c14706e2f6",
    "name": "Royal Outsider",
    "description": "Despite being outsiders to common culture, Triton's carry an air of nobility and societal familiarity with them from the depths. You gain Apprentice proficiency in the Persuasion and Society skills.",
    "requirements": ""
  },
  {
    "id": "97410eba-752e-4ab8-a6ac-e8a6d3d21934",
    "name": "Swift",
    "description": "Your land and swim speeds each increase by 5 feet",
    "requirements": ""
  },
  {
    "id": "71510bc2-5dc6-4b62-b05d-4b3d613dacec",
    "name": "Undauntable Personality",
    "description": "When you fail a Will saving throw, you can use your reaction to reroll the save and keep the new result. You can use this ability once per day.",
    "requirements": ""
  },
  {
    "id": "47e758cf-ddd9-4389-aaec-759f3ba7bc0e",
    "name": "Integrated Armor",
    "description": "You gain a permanent +1 bonus to both Defense and Armor. You can rest normally no matter the style of armor you are wearing, and no longer need to remove your armor for any reason.",
    "requirements": ""
  },
  {
    "id": "9fbdfb12-d6ce-4312-af99-6da523b59c79",
    "name": "Swift Stride",
    "description": "Your movement speed increases by 10 feet.",
    "requirements": ""
  },
  {
    "id": "5b048962-9458-41f9-8767-91bd059c94b4",
    "name": "Sentry's Rest",
    "description": "You do not lose consciousness when you rest, and can instead remain motionless and alert for 6 hours to gain the benefits of a full night's rest.",
    "requirements": ""
  },
  {
    "id": "03066ae0-2478-4c56-940d-abc739e1973e",
    "name": "Iron Fists",
    "description": "Your iron fists hit just as hard as any weapon. Your unarmed attacks do 1d6 + your strength modifier bludgeoning damage. You are proficient in these attacks.",
    "requirements": ""
  },
  {
    "id": "7def76ce-58b5-445e-8878-db00edf28267",
    "name": "Specialized Design",
    "description": "You gain apprentice proficiency in a skill of your choice.",
    "requirements": ""
  },
  {
    "id": "d979b8dd-8dca-4415-a030-b7f89b54a627",
    "name": "Bestial Nature",
    "description": "You gain the Trained proficiency level in the Athletics, Intimidation, Acrobatics, or Survival skill.",
    "requirements": ""
  },
  {
    "id": "6f6f9304-3061-4240-b3de-909c3155b472",
    "name": "Animal Endurance",
    "description": "When you fail a fortitude save, you can use your reaction to reroll the save and keep the new result. You can use this ability once per shift, and only while shifted.",
    "requirements": ""
  },
  {
    "id": "de1427a3-9adf-486d-8e6c-0c2dc12e0839",
    "name": "Persistent Adaptation",
    "description": "You gain a climbing or swimming speed of 10 feet.",
    "requirements": ""
  },
  {
    "id": "c683c631-1a02-4e3b-8b9c-bd8419d79c26",
    "name": "Skillful Tail",
    "description": "Your tail is capable of performing simple interactions, like opening an unlocked door. Your tail is incapable of any task that requires finders or significant manual dexterity, but can be used to hold simple objects.",
    "requirements": ""
  },
  {
    "id": "5b147eb1-2464-4c5f-bf3f-a9f858e1b5e3",
    "name": "Silver-tongued",
    "description": "You gain the Trained proficiency level in deception.",
    "requirements": ""
  },
  {
    "id": "63b0727a-f0e0-4fff-9242-090c671f229e",
    "name": "Cloven Hoof",
    "description": "Your move speed increases by 5 feet.",
    "requirements": ""
  },
  {
    "id": "547273ca-20c9-44e5-8f5c-f06bd477680b",
    "name": "Fiend's Door",
    "description": "Once per day you can cast the spell Misty Step without expending a spell charge or using any material components.\n\nAdditionally, you don't need to be able to see your destination in order to teleport there. Even if you have additional spell charges, you cannot cast this spell this way using another spellcasting feature.",
    "requirements": ""
  },
  {
    "id": "10c65682-3ac1-4132-a0a0-867c30cfe717",
    "name": "Resist in Kind",
    "description": "You gain advantage on all Will saving throws against magical effects cast or caused by Fiendish enemies.",
    "requirements": ""
  },
  {
    "id": "2514f5ee-a6b9-4b6a-a5e2-a662b644c83d",
    "name": "Infernal Ally",
    "description": "You gain a familiar ally bound to you through the chaos in your blood. This familiar takes whatever form you choose.\n\nThis familiar behaves as though summoned by the find familiar spell (with the following changes) and you can cast Find Familiar (without expending any spell charges or material components) only to resummon this familiar.\n\nYour familiar is always of the type: Fiend, your familiar is incapable of changing its physical form even when resummoned, and your familiar is incapable of taking any actions in combat",
    "requirements": ""
  },
  {
    "id": "f375e6b9-12af-4eb8-b3f2-07d30f580765",
    "name": "Low-Light Vision",
    "description": "You can see in dim light as though it were by torchlight, but cannot see in darkness.",
    "requirements": ""
  }
]
