[
  {
    "name": "Protector",
    "description": "You can use two actions to unleash the divine energy within yourself, causing your eyes to glimmer and two luminous, incorporeal wings to sprout from your back.\n\nYour transformation lasts for 1 minute or until you end it as an action. During it, you have a flying speed of 20 feet.\n\nOn each of your turns,you can mark one of your allies with a glowing aura. Whenever they are struck by an enemy attack or spell that enemy takes Light damage equal to your level.\n\nYou can use this trait once per day",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Sourge",
    "description": "You can use two actions to unleash the divine energy within yourself, causing a searing light to radiate from you, pour out of your eyes and mouth, and threaten to char you.\n\nYour transformation lasts for 1 minute or until you end it as an action. During it, you shed bright light in a 10-foot radius and dim light for an additional 10 feet.\n\nAt the end of each of your turns, you and each creature within 10 feet of you take Light damage equal to your level.\n\nAdditionally, On each of your turns, you can deal extra Light damage to one target when you deal damage to it with an attack or a spell. The extra Light damage equals your level.\n\nYou can use this trait once per day",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Fallen",
    "description": "You can use two actions to unleash the divine energy within yourself, causing your eyes to turn into pools of darkness and two skeletal, ghostly, flightless wings to sprout from your back.\n\nThe instant you transform, other creatures within 10 feet of you that can see you must each succeed on a Will saving throw (DC 9 + your level + your Charisma modifier) or become frightened of you until the end of your next turn.\n\nYour transformation lasts for 1 minute or until you end it as an action. During it, once on each of your turns, you can deal extra Dark damage to one target when you deal damage to it with an attack or a spell. The extra Dark damage equals your level.\n\nYou can use this trait once per day",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Sprinter",
    "description": "Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns.\n\nYour move speed increases by 5 feet.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Stalker",
    "description": "You gain the Trained proficiency level in the stealth skill.\n\nYou have a climbing speed of 15 feet.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Pridelord",
    "description": "You have advantage on all ability checks against being frightened.\n\nYou gain the following ability: As an action, you can let out an especially menacing roar. Creatures of your choice within 10 feet of you that can hear you must succeed on a Will saving throw or become frightened of you until the end of your next turn.\n\nThe DC of the save equals 9 + your level + your Constitution modifier.\n\nOnce you use this trait, you can’t use it again until you finish a rest.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Air Djinni",
    "description": "You have resistance to Thunder damage, and can hold your breath indefinitely while not incapacitated.\n\nAdvanced Movement (if selected): Fly speed 10 feet\n\nDjinn Spellcasting (if selected): You know the Lightning Lash and Gust cantrips. You know the spell Thunderwave and can cast it once per day as a 1st-level innate spell.\n\nAdvanced Spells (if selected): At 3rd level, you learn the spell Shatter and Levitate, and can cast them each once per day as a 2nd-level innate spell.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Earth Djinni",
    "description": "You have resistance to Poison damage, and advantage on all saving throws against being poisoned.\n\nAdvanced Movement (if selected): Burrow speed 10 feet\n\nDjinn Spellcasting (if selected): You know the Druidcraft and Primal Savagery cantrips. You know the spell Catapult and can cast it once per day as a 1st-level innate spell.\n\nAdvanced Spells (if selected): At 3rd level, you learn the spell Earthen Grasp and Barkskin, and can cast each of them once per day as a 2nd-level innate spell.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Fire Djinni",
    "description": "You have resistance to Fire damage\n\nAdvanced Movement (if selected): Movement speed increases by 10 feet\n\nDjinn Spellcasting (if selected): You know the Produce Flame cantrip. You know the spell Burning Hands and can cast it once per day as a 1st-level innate spell.\n\nAdvanced Spells (if selected): At 3rd level, you learn the spell Flaming Sphere and Flame Blade, and can cast each of them once per day as a 2nd-level innate spell.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Water Djinni",
    "description": "You have resistance to Cold damage, and can breathe both air and water.\n\nAdvanced Movement (if selected): Swimming speed 10 feet\n\nDjinn Spellcasting (if selected): You know the Acid Splash and Shape water cantrips. You know the spell Ice Knife and can cast it once per day as a 1st-level innate spell.\n\nAdvanced Spells (if selected): At 3rd level, you learn the spell Acid Arrow and Snowball Swarm, and can cast each of them once per day as a 2nd-level innate spell.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Forge-born",
    "description": "You are resistant to Fire damage, and have Apprentice proficiency in Crafting",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Iron-mind",
    "description": "You have advantage on all Will saves against magical effects",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Rock-foot",
    "description": "You have advantage on athletics checks against being grappled, shoved, or knocked prone. Your fists are as if made of stone. Your unarmed attacks do 1d6 + your strength modifier bludgeoning damage.\n\nIf you do not already have proficiency with unarmed attacks, your proficiency is Trained for the purposes of determining your attack modifiers.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Strong-blood",
    "description": "You are resistant to Poison damage, and have advantage on all saves against poison.\n\nAdditionally whenever you gain hit points at the end of a rest, you can gain additional hit points equal to your level.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Sea",
    "description": "You are resistant to Cold damage.\n\nYou have a swim speed of 15 feet and can breathe both air and water.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "High",
    "description": "You have advantage on all Will saves against magical effects.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Wood",
    "description": "As an action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, cast a spell, or force someone to make a saving throw. You may use this trait once per day.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Longarm",
    "description": "You have a reach of 10 feet when making melee attacks. This does not stack with other range increasing effects.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "City Walker",
    "description": "You can cast Disguise Self at will, appearing up to 3 feet shorter than normal, allowing you to blend in more naturally with humans and elves.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Hidden One",
    "description": "As an action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, cast a spell, or force someone to make a saving throw. You may use this trait once per day.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Guardian of Nature",
    "description": "You can cast the spell Barkskin and Entangle each once per day. Wisdom is your spellcasting modifier for these spells. You are proficient in the casting of these spells",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Forest",
    "description": "As an action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, cast a spell, or force someone to make a saving throw. You may use this trait once per day.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Rock",
    "description": "You have advantage on all Will saves against magic.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Charhide",
    "description": "You have resistance to Fire and Acid damage",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Irongut",
    "description": "You have resistance to poison damage, and are immune to the poisoned condition.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Unbreakable",
    "description": "You gain 12 hit points instead of 6 from your race at 1st level.\n\nThe first time you are knocked unconscious each day, you don't gain a wound upon being stabilized.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Tailed",
    "description": "You have a tail, gain the Apprentice proficiency in Acrobatics, and have a climb speed of 15 feet.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Black",
    "description": "You are resistant to Acid damage.\n\nBreath weapon (if selected): Cone - Fortitude save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Copper",
    "description": "You are resistant to Acid damage.\n\nBreath weapon (if selected):  Line - Fortitude save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Blue ",
    "description": "You are resistant to Lightning damage.\n\nBreath weapon (if selected): Cone - Reflex save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": " Bronze",
    "description": "You are resistant to Lightning damage.\n\nBreath weapon (if selected): Line - Reflex save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Red",
    "description": "You are resistant to Fire damage.\n\nBreath weapon (if selected): Cone - Reflex save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Brass",
    "description": "You are resistant to Fire damage.\n\nBreath weapon (if selected): Line - Reflex save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Gold",
    "description": "You are resistant to Fire damage.\n\nBreath weapon (if selected): Line - Reflex save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Green",
    "description": "You are resistant to Poison damage.\n\nBreath weapon (if selected): Line - Fortitude save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Steel",
    "description": "You are resistant to Poison damage.\n\nBreath weapon (if selected): Line - Fortitude save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "White ",
    "description": "You are resistant to Cold damage\n\nBreath weapon (if selected): Cone - Fortitude save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Silver",
    "description": "You are resistant to Cold damage\n\nBreath weapon (if selected): Line - Fortitude save",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Crag-Hopper",
    "description": "You are resistant to Cold damage.\n\nYou do not need to stride before making a long jump, and have advantage on all athletics checks to jump, long jump or high jump.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Sand-Walker",
    "description": "You are resistant to Fire damage.\n\nYour movement speed is increased by 5 feet",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Lightfoot",
    "description": "You can attempt to hide even when you are only obscured by a creature that is at least one size larger than you.\n\nYou gain Apprentice proficiency in the stealth skill.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Stout",
    "description": "You have advantage on saving throws against poison, and you have resistance to poison damage.\n\nWhenever you gain hit points at the end of a rest, you can gain additional hit points equal to your level.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Pitchburner",
    "description": "You are resistant to Fire damage.\n\nWhen fighting an opponent in melee range that you cannot see, if you can hear them, you do not suffer disadvantage on attack rolls against them and they do not gain advantage on attack rolls against you due to their hidden nature.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Runtboss",
    "description": "You have Trained proficiency with the Intimidation or Persuasion skill.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Versatile",
    "description": "You gain an additional identity feat or ability feat",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Half-Elf",
    "description": "You have some of the general appearance traits of one with elven descent.\n\nYou can select up to two of your perks from the elf general perk list.\n\nYou gain an additional general perk",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Half-Orc",
    "description": "You have some of the general appearance traits of one of orcish descent.\n\nYou can select up to two of your perks from the orc general perk list.\n\nYou gain an additional general perk",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Changeling (Rare)",
    "description": "Shapechange:\n\nAs a ritual (1 minute), you can magically change your appearance and your voice. You determine the specifics of the changes, including your coloration, hair length, and sex. You can also adjust your height and weight, but not so much that your size or physiology changes.\n\nYou can make yourself appear as a member of another race, though none of your in game statistics change. You can't duplicate the appearance of a creature you've never seen, and you must adopt a form that has the same arrangement of limbs that you have.\n\nYour clothing and equipment aren't affected by this trait. You stay in this new form until you use an action to revert to your true form, or until you die.",
    "requirements": "One of your ability boosts must be to Charisma",
    "penalty": "You receive 2 general perks instead of 3"
  },
  {
    "name": "Kalashtar (Rare)",
    "description": "Whenever you are targeted by a spell or effect that causes you to make a Will saving throw, you can use your reaction to give yourself advantage on the save.\n\nYou have resistance to Psychic damage.",
    "requirements": "One of your ability boosts must be to Wisdom",
    "penalty": "You receive 2 general perks instead of 3"
  },
  {
    "name": "Wetlander",
    "description": "You are resistant to poison damage.\n\nYou gain a swim speed of 15 feet, and can hold your breath up to 15 minutes.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Landstrider",
    "description": "You are resistant to Fire damage, and can go 10x longer than a normal creature without food or water.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Frilled",
    "description": "You have the Trained proficiency level in intimidation, and can demoralize foes without sharing a language.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Cliffscale",
    "description": "You gain a climbing speed of 15 feet and, as long as you aren't wearing footwear, can cling to walls and ceilings with your feet leaving your hands free for actions.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Deep Dweller",
    "description": "You have adapted to living without the use of your sight. You gain a blindsight with a range of 15 feet.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Oceanic Predator",
    "description": "You have resistance to Cold and Poison damage.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Primalist",
    "description": "You learn a cantrip of your choice from the Primal spell list. Wisdom is your casting modifier for this cantrip. You are proficient in the casting of this spell",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Runed-flesh",
    "description": "Whenever you succeed a saving throw against a magical effect, you gain temporary hit points equal to your constitution modifier.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Wanderer",
    "description": "You gain a 10 foot bonus to your movement speed",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "War-Scarred",
    "description": "You gain an additional 4 hit points as part of your racial bonus at level 1.\n\nWhen making death saving throws, you require 4 failed death saves instead of 3 in order to die.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Envoy",
    "description": "You learn an additional language.\n\nYou gain trained proficiency in a skill of your choice",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Juggernaut",
    "description": "You gain an additional 4 hit points as part of your racial bonus at level 1.\n\nWhen making death saving throws, you require 4 failed death saves instead of 3 in order to die.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Beasthide",
    "description": "Whenever you shift, you again 1d8+ your Constitution Modifier in temporary hit points. While shifted, you have a +1 bonus to your Defense and Armor",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Longtooth",
    "description": "While shifted, you can use your elongated claws or fangs to attack as an action. This attack does not suffer the multi-attack penalty. If you hit, you can deal 1d6 + your strength modifier as piercing damage to your target.\n\nYour proficiency with this attack begins at Apprentice at level 1, and increases to Trained at level 6, Expert at level 11, and Master at level 16.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Swiftstride",
    "description": "Whenever you shift, your land speed increases by 10 feet. Additionally, while shifted, you can disengage as a reaction when a creature ends its turn within 5 feet of you.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Wildhunt",
    "description": "While shifted, you have advantage on Wisdom related skill checks, and no creature within 30 feet may make an attack roll with advantage against you (as long as you arent incapacitated).",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Faustian",
    "description": "You have Apprentice proficiency in the Persuasion and Society skills.\n\nYour social interactions with other people are uninhibited by your fiendish appearance, and do not suffer the normal stigma associated with your appearance.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Infernal Born",
    "description": "You know the Produce Flame cantrip and can cast the spell Hellish Rebuke at 2nd level (once per day). Charisma is your spellcasting ability for these spells.\n\nYou are proficient in the casting of these spells.",
    "requirements": "",
    "penalty": ""
  },
  {
    "name": "Branded One",
    "description": "You are resistant to Fire damage.\n\nYou know the Thaumaturgy cantrip.",
    "requirements": "",
    "penalty": ""
  }
]
