{
  "coreStats": {
    "size": "Medium",
    "landSpeed": 30,
    "swimSpeed": 0,
    "climbSpeed": 0,
    "flySpeed": 0,
    "burrowSpeed": 0,
    "hitPoints": 6,
    "languages": [
      "Common",
      "Primordial"
    ],
    "ability": ""
  },
  "subraces": [
    {
      "name": "Air Djinni",
      "description": "You have resistance to Thunder damage, and can hold your breath indefinitely while not incapacitated.\n\nAdvanced Movement (if selected): Fly speed 10 feet\n\nDjinn Spellcasting (if selected): You know the Lightning Lash and Gust cantrips. You know the spell Thunderwave and can cast it once per day as a 1st-level innate spell.\n\nAdvanced Spells (if selected): At 3rd level, you learn the spell Shatter and Levitate, and can cast them each once per day as a 2nd-level innate spell.",
      "requirement": "",
      "penalty": ""
    },
    {
      "name": "Earth Djinni",
      "description": "You have resistance to Poison damage, and advantage on all saving throws against being poisoned.\n\nAdvanced Movement (if selected): Burrow speed 10 feet\n\nDjinn Spellcasting (if selected): You know the Druidcraft and Primal Savagery cantrips. You know the spell Catapult and can cast it once per day as a 1st-level innate spell.\n\nAdvanced Spells (if selected): At 3rd level, you learn the spell Earthen Grasp and Barkskin, and can cast each of them once per day as a 2nd-level innate spell.",
      "requirement": "",
      "penalty": ""
    },
    {
      "name": "Fire Djinni",
      "description": "You have resistance to Fire damage\n\nAdvanced Movement (if selected): Movement speed increases by 10 feet\n\nDjinn Spellcasting (if selected): You know the Produce Flame cantrip. You know the spell Burning Hands and can cast it once per day as a 1st-level innate spell.\n\nAdvanced Spells (if selected): At 3rd level, you learn the spell Flaming Sphere and Flame Blade, and can cast each of them once per day as a 2nd-level innate spell.",
      "requirement": "",
      "penalty": ""
    },
    {
      "name": "Water Djinni",
      "description": "You have resistance to Cold damage, and can breathe both air and water.\n\nAdvanced Movement (if selected): Swimming speed 10 feet\n\nDjinn Spellcasting (if selected): You know the Acid Splash and Shape water cantrips. You know the spell Ice Knife and can cast it once per day as a 1st-level innate spell.\n\nAdvanced Spells (if selected): At 3rd level, you learn the spell Acid Arrow and Snowball Swarm, and can cast each of them once per day as a 2nd-level innate spell.",
      "requirement": "",
      "penalty": ""
    }
  ],
  "generalPerks": [
    {
      "name": "Wish-Granter",
      "description": "Once per day, you can give an ally advantage on any attack, ability check, or saving throw.",
      "requirement": ""
    },
    {
      "name": "Future-Sight",
      "description": "At the beginning of every day, roll a d20 and record the result. Once per day, you can replace any roll you make with the recorded result. This roll ONLY replaces the rolled value, not any modifiers or bonuses you may have.",
      "requirement": ""
    },
    {
      "name": "Advanced Movement",
      "description": "You gain the advanced movement ability detailed under your chosen subrace.",
      "requirement": ""
    },
    {
      "name": "Djinni Spellcasting",
      "description": "You gain the Djinn Spellcasting feature detailed under your chosen subrace.\n\nConstitution is your spellcasting modifier for these spells. You are proficient in the use of these spells.",
      "requirement": ""
    },
    {
      "name": "Advanced Djinni Spellcasting",
      "description": "You gain the Advanced Spells ability detailed under your chosen subrace.",
      "requirement": ""
    },
    {
      "name": "Semi-Cosmic Knowledge",
      "description": "You gain the Apprentice proficiency in two skills of your choice.",
      "requirement": ""
    },
    {
      "name": "Low-Light Vision",
      "description": "You can see in dim light as though it were by torchlight, but cannot see in darkness.",
      "requirement": ""
    }
  ]
}
