{
  "coreStats": {
    "size": "Medium",
    "landSpeed": 30,
    "swimSpeed": 0,
    "climbSpeed": 0,
    "flySpeed": 0,
    "burrowSpeed": 0,
    "hitPoints": 6,
    "languages": [
      "Common",
      "Elvish"
    ],
    "ability": ""
  },
  "subraces": [
    {
      "name": "Sea",
      "description": "You are resistant to Cold damage.\n\nYou have a swim speed of 15 feet and can breathe both air and water.",
      "requirement": "",
      "penalty": ""
    },
    {
      "name": "High",
      "description": "You have advantage on all Will saves against magical effects.",
      "requirement": "",
      "penalty": ""
    },
    {
      "name": "Wood",
      "description": "As an action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, cast a spell, or force someone to make a saving throw. You may use this trait once per day.",
      "requirement": "",
      "penalty": ""
    }
  ],
  "generalPerks": [
    {
      "name": "Elf Magic",
      "description": "You know one cantrip of your choice from the Arcane or Primal spell list. If you chose an Arcane spell, Intelligence is your spellcasting modifier for it. If you chose a Primal spell, Wisdom is your spellcasting modifier for it.\n\nYou are proficient in the casting of this spell.",
      "requirement": ""
    },
    {
      "name": "Elven Weapon Training",
      "description": "You are proficient with the longsword, shortsword, shortbow, and longbow.",
      "requirement": ""
    },
    {
      "name": "Fleet of Foot",
      "description": "You gain Apprentice proficiency in the Acrobatics skill, and each of your movement speeds increases by 5 feet.",
      "requirement": ""
    },
    {
      "name": "Mask of the Wild",
      "description": "You can attempt to hide even when you are only lightly obscured by foliage, heavy rain, falling snow, mist, and other natural phenomena.",
      "requirement": ""
    },
    {
      "name": "Vast Knowledge (Requires age 250+)",
      "description": "You gain the Trained proficiency in a skill of your choice.",
      "requirement": ""
    },
    {
      "name": "Elven Step",
      "description": "When you Step, you may move up to half your movement speed rather than the standard 5 feet.",
      "requirement": ""
    },
    {
      "name": "Low-Light Vision",
      "description": "You can see in dim light as though it were by torchlight, but cannot see in darkness.",
      "requirement": ""
    }
  ]
}
