{
  "coreStats": {
    "size": "Tall",
    "landSpeed": 30,
    "swimSpeed": 0,
    "climbSpeed": 0,
    "flySpeed": 0,
    "burrowSpeed": 0,
    "hitPoints": 8,
    "languages": [
      "Common",
      "Giant"
    ],
    "ability": ""
  },
  "subraces": [
    {
      "name": "Longarm",
      "description": "You have a reach of 10 feet when making melee attacks. This does not stack with other range increasing effects.",
      "requirement": "",
      "penalty": ""
    },
    {
      "name": "City Walker",
      "description": "You can cast Disguise Self at will, appearing up to 3 feet shorter than normal, allowing you to blend in more naturally with humans and elves.",
      "requirement": "",
      "penalty": ""
    },
    {
      "name": "Hidden One",
      "description": "As an action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, cast a spell, or force someone to make a saving throw. You may use this trait once per day.",
      "requirement": "",
      "penalty": ""
    },
    {
      "name": "Guardian of Nature",
      "description": "You can cast the spell Barkskin and Entangle each once per day. Wisdom is your spellcasting modifier for these spells. You are proficient in the casting of these spells",
      "requirement": "",
      "penalty": ""
    }
  ],
  "generalPerks": [
    {
      "name": "Powerful Build",
      "description": "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift. The movement penalty for armor and shields is reduced by 5 feet.",
      "requirement": ""
    },
    {
      "name": "Fey Magic",
      "description": "You know one cantrip of your choice from the Primal spell list. Wisdom is your spellcasting Ability for it. You are proficient in the casting of this spell.",
      "requirement": ""
    },
    {
      "name": "Speech of Beast and Leaf",
      "description": "You have the Ability to communicate in a limited manner with beasts and plants. They can understand the meaning of your words, though you have no special Ability to understand them in return. You have advantage on all Charisma checks you make to influence them.",
      "requirement": ""
    },
    {
      "name": "Longstrider",
      "description": "Your movement speed increases by 5",
      "requirement": ""
    },
    {
      "name": "One with Nature",
      "description": "You have Trained proficiency in the Nature Skill",
      "requirement": ""
    },
    {
      "name": "Read the Leaves",
      "description": "You have advantage on all survival checks while in forest or woods.",
      "requirement": ""
    },
    {
      "name": "Low-Light Vision",
      "description": "You can see in dim light as though it were by torchlight, but cannot see in darkness",
      "requirement": ""
    }
  ]
}
